[
    {
        "URL": "https://infotel.ca/newsitem/police-crisis-intervention/cp67379207",
        "Title": "With spotlight on policing failures, how can the system better respond to mental-health crises? | iNFOnews | Thompson-Okanagan's News Source",
        "Body Text": "Subscribe\n\nWould you like to subscribe to our newsletter?\n\nYes No\n \nSearch for businesses in Penticton, South Okanagan & Similkameen Areas|\n \nClick here to Search All News s\nCurrent Conditions\nPartly Cloudy  17.1°C\nHome\nNews\nCOVID-19\nWeather\nOpinion\nSports and\nEntertainment\nEvents\niNwordl\nBusiness Directory\nAbout\nSubsites\nMy Infotel\nKamloops\nKelowna\nPenticton\nVernon\nWith spotlight on policing failures, how can the system better respond to mental-health crises?\nCassandra Szklarski\nPolice keep an eye protesters during a demonstration calling for justice for the death of George Floyd and all victims of police brutality, in Montreal on June 7, 2020. When someone broke into her car earlier this month, Meenakshi Mannoe considered calling police. The Vancouver resident weighed several questions: Would she get her belongings back? Was it even worth the hassle? And the tipping point: What good would it ultimately do? The weekend killing of Rodney Levi near Metepenagiag, N.B., -- the second Indigenous person to die at the hands of police in that province in less than a month -- has only intensified calls to defund the police as a part of a holistic approach to re-define public safety and how it's achieved. THE CANADIAN PRESS/Graham Hughes\nRepublished June 15, 2020 - 2:08 PM\nOriginal Publication Date June 15, 2020 - 12:01 PM\n\nTORONTO - When someone broke into her car earlier this month, Meenakshi Mannoe knew the potential consequences of calling police.\n\nThe Vancouver resident weighed several questions: Would she get her belongings back? Was it even worth the hassle? And the tipping point: What good would it ultimately do?\n\nUltimately, Mannoe believed it wasn't a big deal — she could easily replace her lost portable speaker and first aid kit, and she questioned the impact of calling the cops on someone desperate enough to take them.\n\n\"Is it an inconvenience? Absolutely. But I don't want to contribute to the over-criminalization of folks, or hyper-policing when I know that people are doing things just to get by, just to survive.\"\n\nThe decision was an easy one for Mannoe, well-versed in the myriad systemic forces that underlie day-to-day struggles of many as a campaign staffer with Pivot Legal Society, which examines police accountability, drug policy, homelessness, and sex workers' rights.\n\nBut they're questions she says we're increasingly facing as anger-fuelled protests draw fresh scrutiny over the prevalence of police brutality and systemic racism facing Black and Indigenous people.\n\nThe weekend killing of Rodney Levi near Metepenagiag, N.B., — the second Indigenous person to die at the hands of an officer in that province in less than a month — has only intensified calls to defund the police as a part of a holistic approach to re-define public safety and how it's achieved.\n\n\"From Indigenous communities we regularly hear the sentiment that people feel over-policed and under-protected,\" Mannoe said last week, before Levi's death.\n\n\"I think this is a vital moment to really reframe what justice looks like and to heed calls from our courts like the Truth and Reconciliation Commission, or the Missing and Murdered Indigenous Women and Girls (national inquiry) and really look at: How do we create culturally safe and responsive Indigenous-led crisis intervention?\"\n\nThe defund movement doesn't mean abolishing police — although there are calls for that, too — but rather is an acknowledgment that law enforcement has ballooned to encompass far-ranging responsibilities it's incapable of addressing, says Toronto city councillor Kristyn Wong-Tam, who will introduce a motion later this month to cut Toronto's police budget by 10 per cent.\n\n\"In some ways, we have set them up to fail,\" says Wong-Tam, noting calls often involve people in the throes of a mental health crisis or substance abuse.\n\n\"Asking police officers to be the social worker that shows up on the doorstep armed with guns and pepper spray, I just don't think that has given us always the best outcome.\"\n\nLevi was killed Friday night after RCMP say they responded to a complaint about an \"unwanted person\" at a home near Metepenagiag, about 30 kilometres west of Miramichi. Officers say they were confronted by a man carrying knives, and tried to subdue him with a stun gun. Levi was ultimately shot by an officer and declared dead in hospital.\n\nSince then, Chief Bill Ward of the Metepenagiag Mi'kmaq Nation has said Levi was an invited guest at the home, where he had planned to seek guidance from a church minister.\n\nThen there are the deaths of Chantel Moore, an Indigenous woman in Edmundston, N.B., who was shot by police who had come to perform a wellness check, and Regis Korchinski-Paquet, a Black woman who fell from her Toronto balcony after family members called police to her home.\n\nThe circumstances around each case have not been disclosed and are being examined by independent police investigation agencies. But experts say they highlight the myriad ways racial bias and mental-health stigma can make any police interaction dangerously fraught.\n\nEspecially for someone who is Black, Indigenous or a person of colour, the very presence of an armed officer could aggravate an already delicate situation, says the James R. Johnston chair in Black Canadian studies at Dalhousie University.\n\n\"When you have experiences, for example, in Toronto where Black men are 20 times more likely to be harmed or killed by police than (white) people, then yes, of course we're going to be anxious,\" says OmiSoore Dryden.\n\n\"And, you know, we don't all teach our children, 'Go to police,' that they will help them if they're lost or whatever,\" said Dryden. \"We know not to do that.\"\n\nDryden says the very inception of policing was rooted in protecting property, which further institutionalized racism by enforcing slavery.\n\n\"It meant in the creation of this country, that those Black people fleeing slavery were captured and returned into slavery and those Black people who were freed were often trafficked into slavery, even though they weren't slaves,\" she says.\n\n\"For many that uniform is a symbol of harm and abuse and fear. It is not a symbol for care and kindness and support.\"\n\nJust like the rest of society, police officers are vulnerable to conscious and unconscious biases that can cloud their judgment, says Jennifer Lavoie, an associate professor in criminology at Wilfrid Laurier University.\n\n\"That becomes problematic when you're a police officer and you have implicit biases that involve perceptions of threat or aggression or violence that are attached to specific populations such as BIPOC populations,\" says Lavoie.\n\n\"When you're approaching and providing services to a person they're more than their mental health crisis. It's important to approach that person holistically.\"\n\nNevertheless, calling 911 is the only option most people have when faced with a public safety crisis, even when someone is clearly in mental distress, Lavoie says.\n\nMost cities have a patchwork of additional services that can respond to some emergency calls, but they are inconsistent and not always 24-hours, she notes.\n\nLavoie would like to see more funding for crisis intervention teams that many police services have across the country.\n\nIn Toronto, they're known as Mobile Crisis Intervention Teams, or MCIT, and involve a mental health nurse and a specially trained police officer. But they respond only if it's clear a weapon is not involved or if first-responding officers deems it safe for a nurse to arrive. Citizens also cannot call MCIT directly.\n\nWong-Tam says they are also overwhelmed by demand, noting the force receives roughly 30,000 calls a year related to mental health but that the MCIT only respond to about 6,000 calls a year.\n\nHamilton's Crisis Outreach and Support Team, known as COAST, includes a mobile team of a mental health professional and a plain-clothes police officer in an unmarked car, but it, too, is not 24-hours.\n\n\"There is a period of time where they're not available, and if they're on call, there's only so many units that are available,\" Lavoie says.\n\nIn Vancouver, Car 87 teams a police constable with a registered nurse or a registered psychiatric nurse to provide on-site assessments. Meanwhile, nurses can also help callers to a crisis line and triage situations to Car 87, ambulance or police.\n\nAs part of her research, Lavoie says she's developed a 40-hour training program being tested with Durham Region police in Ontario that uses scenario-based exercises with actors who portray \"authentic mental health crises.\"\n\n\"That's the only way to really, I think, train officers on how to respond to a person in mental health crisis.\"\n\nFormer Ottawa cop-turned-professor Greg Brown, of Carleton University's department of law & legal studies, says police training includes just a cursory overview of mental health conditions but that more robust education isn't the answer.\n\nHe'd like to see a portion of police funds reallocated to some sort of social services department within the force that could respond to such calls, but he'd also like to see \"more use-of-force training, so they can perform more professionally.\"\n\nHe says most police services dedicate 10 to 12 hours a year towards firearms and hand-to-hand fighting skills.\n\n\"We have police officers that are rusty at use-of-force and then you have an incident where they have to use force and they don't perform properly,\" he says.\n\n\"And then people wonder, 'Why? Why does that officer behave like that? Aren't they trained?' And the answer is, 'Not really.'\"\n\nWong-Tam would like to see funds diverted to affordable housing, career counselling, skills training, recreation youth programs and mental-health crisis support. She says a 10 per cent budget cut in Toronto would yield $122 million.\n\nMannoe agrees that addressing society's myriad inequalities would do more to reduce police interactions to begin with, but so, too, would a broader understanding of systemic forces that affect police and society's ability to hold them accountable.\n\n\"I think people are looking for this kind of big alternative system that's going to replace police but really it's just (about) turning our minds towards compassion for people who are in a bad place.\"\n\n— With files from Adina Bresge\n\nThis report by The Canadian Press was first published June 15, 2020.\n\nNote to readers: This is a corrected story. A previous version said Meenakshi Mannoe considered calling the police. In fact, she knew she did not want to call the police.\n\nNews from © The Canadian Press, 2020\n\n\nMore News ...\niN RESPONSE: Readers have their say\nFollowing are emailed reader responses to stories or letters to the...\niN VIDEO: Iconic A&W whistle dog returns after fans made enough noise\nThailand's prime minister wants to outlaw cannabis, 2 years after it was decriminalized\n$11 million commercial property for sale near downtown Kelowna\nPopular Penticton News\nAnother BC nurse suspended for snooping on medical records\nMay 19, 2024 6:30 AM\nBC transwoman scores minor human rights victory against Ministry of Health\nMay 19, 2024 7:00 PM\nFiddling with timesheet nets BC nurse $23,000 in pay and a suspension\nMay 20, 2024 6:00 AM\niN PHOTOS: Okanagan's hot rods gathered in West Kelowna for World of Wheels\nMay 19, 2024 4:15 PM\nOne woman’s battle for long-term care in Interior Health for elderly family members\nMay 18, 2024 7:00 AM\nTop News\nCooler, wetter weather reduces wildfire activity in northeast B.C.\nMay 21, 2024 1:08 PM\nDefense rests without ex-President Trump taking the witness stand in his New York hush money trial\nMay 21, 2024 1:04 PM\n'Happy tears' of victim's sister after prison attack on serial killer Robert Pickton\nMay 21, 2024 12:52 PM\nThe Latest | UN food aid collapses in Rafah as Israeli leaders decry war crime accusations\nMay 21, 2024 12:22 PM\niN RESPONSE: Readers have their say\nMay 21, 2024 12:00 PM\nTrending Now\nTRENDING NOW: Gentle kittens don't know how to fight\nKamloops\nHome\nNews\nLocal\nBC\nBusiness\nCanada\nCorrections\nFYI\nTop News\nTrending Now\nWorld\nWeird\nKamloops Weather\nThings to Do\nGalleries\nGolf Courses\nMuseums\nParks & Beaches\nSnow Sports\nWineries\nSports\nCFL\nCurling\nFigure Skating\nMLB\nNBA\nNFL\nNHL\nSoccer\nLifestyle\nDiet & Fitness\nFood\nHealth\nHoroscopes\nParenting\nTravel\nEntertainment\nBooks\nCelebrities\nMovies\nMusic\nTV\nEvents\nBusiness Search\nPeople Search\nReverse Lookup\nRestaurants\nGovernment Listings\nPostal Codes\nKelowna\nHome\nNews\nLocal\nBC\nBusiness\nCanada\nCorrections\nFYI\nTop News\nTrending Now\nWorld\nWeird\nKelowna Weather\nThings to Do\nGalleries\nGolf Courses\nMuseums\nParks & Beaches\nSnow Sports\nWineries\nSports\nCFL\nCurling\nFigure Skating\nMLB\nNBA\nNFL\nNHL\nSoccer\nLifestyle\nDiet & Fitness\nFood\nHealth\nHoroscopes\nParenting\nTravel\nEntertainment\nBooks\nCelebrities\nMovies\nMusic\nTV\nEvents\nBusiness Search\nPeople Search\nReverse Lookup\nRestaurants\nGovernment Listings\nPostal Codes\nPenticton\nHome\nNews\nLocal\nBC\nBusiness\nCanada\nCorrections\nFYI\nTop News\nTrending Now\nWorld\nWeird\nPenticton Weather\nThings to Do\nGalleries\nGolf Courses\nMuseums\nParks & Beaches\nSnow Sports\nWineries\nSports\nCFL\nCurling\nFigure Skating\nMLB\nNBA\nNFL\nNHL\nSoccer\nLifestyle\nDiet & Fitness\nFood\nHealth\nHoroscopes\nParenting\nTravel\nEntertainment\nBooks\nCelebrities\nMovies\nMusic\nTV\nEvents\nBusiness Search\nPeople Search\nReverse Lookup\nRestaurants\nGovernment Listings\nPostal Codes\nVernon\nHome\nNews\nLocal\nBC\nBusiness\nCanada\nCorrections\nFYI\nTop News\nTrending Now\nWorld\nWeird\nVernon Weather\nThings to Do\nGalleries\nGolf Courses\nMuseums\nParks & Beaches\nSnow Sports\nWineries\nSports\nCFL\nCurling\nFigure Skating\nMLB\nNBA\nNFL\nNHL\nSoccer\nLifestyle\nDiet & Fitness\nFood\nHealth\nHoroscopes\nParenting\nTravel\nEntertainment\nBooks\nCelebrities\nMovies\nMusic\nTV\nEvents\nBusiness Search\nPeople Search\nReverse Lookup\nRestaurants\nGovernment Listings\nPostal Codes\n© 2024 InfoTel News Ltd\nContact iNFOTEL MULTIMEDIA | \nContact iNFOnews | \nSubmit News Tips | \nPrivacy Policy & Disclaimer | \nSitemap | \nNewsletter Signup\nView Site in: Desktop | Mobile"
    },
    {
        "URL": "https://theprovince.com/news/local-news/capilano-university-hires-its-first-director-of-indigenous-education-and-affairs/wcm/68b28723-7d6a-4c19-957f-6230b2e4ce15",
        "Title": "Capilano University hires its first director of Indigenous education and affairs | The Province",
        "Body Text": "Skip to Content\nSections\nSearch\nSubscribe\nSign In\nVancouver Canucks\nSports\nHot Topics\nNews\nEntertainment\nOpinion\nLife\nHomes\nNewsletters\nPuzzmo\nHealthing\nDriving\nRemembering\nePaper\nManage Print Subscription\nAdvertisement 1\nPrevious\nStanley Cup Coffee, Canucks vs. Oilers: The Boeser what-if and Garland's sleepless night\nTRENDING\nB.C. serial killer Robert Pickton savagely attacked in prison, clinging to life\nTRENDING\nWhen Lionel Messi visits Vancouver, the world will stop for local Argentines\nTRENDING\nRory McIlroy’s wife reached ‘breaking point’ leading to divorce: Report\nTRENDING\nOilers 3, Canucks 2: Valiant push comes up short to end a remarkable season\nTRENDING\nNext\nBreadcrumb Trail Links\nLocal News\nCapilano University hires its first director of Indigenous education and affairs\n\nMiranda Huron comes to Capilano University after playing instrumental role in getting the federal Indigenous Languages Act passed last summer\n\nAuthor of the article:\nGordon McIntyre\nPublished Jan 12, 2020  •  3 minute read\nJoin the conversation\nMiranda Huron is the new Director, Indigenous Education and Affairs at Capilano University in North Vancouver. PHOTO BY JASON PAYNE /PNG\nArticle content\n\nCapilano University sits on unceded Squamish and Tsleil Waututh territory on the forested slopes of North Vancouver, the school’s walls and grounds festooned with Coast Salish art, so it’s fitting it now has its first director of Indigenous education and affairs.\n\nAdvertisement 2\nSTORY CONTINUES BELOW\nArticle content\n\nMiranda Huron started her new job last week, returning to B.C. after helping Bill C-91, the Indigenous Languages Act, become federal law last summer in her role with the Assembly of First Nations (AFN).\n\nWith B.C. having just become the first province to implement the UN Declaration of Indigenous Rights (UNDRIP), it’s an exciting time to take up the position, Huron, who is Anishinaabe, said.\n\nArticle content\n\n“To be working at this institution in this new era is amazing,” she said. “It’s a great opportunity, a great time to be here.\n\n“Having learned so much from the AFN, having heard from chiefs across the country with their priorities, especially regarding post-secondary, bringing that here and getting to form new relationships with the five nations from Cap U, to have full partnerships and full understanding of what it means to be a good partner going forward.”\n\nCanucks Report\n\nEssential reading for hockey fans who eat, sleep, Canucks, repeat.\n\nSign Up\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nArticle content\nAdvertisement 3\nSTORY CONTINUES BELOW\nArticle content\n\nHuron, 41, said she’ll use the Truth and Reconciliation Commission’s calls-to-action, the call to justice in the Missing and Murdered Indigenous Women and Girls investigation, and UNDRIP as guideposts to navigate the path to developing mutual respect and inclusion on campus.\n\nThat includes curriculum, staffing, more Indigenous students.\n\n“Every step of the way,” she said. “We’re right on Squamish and Tsleil-Waututh territory, for them to be able to come here … the student success rate when being able to be closer to home is amazing, so it would be lovely for us to be their first choice and to provide responsive curriculum for their needs.”\n\nIt was a winding path that brought her back to B.C.\n\nA trip to Vancouver as a 13-year-old convinced Huron she wanted to live here, leading to undergraduate and Master’s degrees from UBC.\n\nAdvertisement 4\nSTORY CONTINUES BELOW\nArticle content\n\nShe has two decades experience at post-secondary institutions, including manager of Ch’nook Indigenous business education at UBC’s Sauder School of Business, and stints at Emily Carr and Algonquin College.\n\nHaving moved all over Ontario as a child — “My mother was a bit of a hippy” — Huron herself moved around the globe, surfing in Australia, cycling 6,000 kilometres across Canada, 5,700 kilometres in Russia from Vladivostok to Novosibirsk before her bike broke down, and 10,000 kilometres in Africa from Cairo to Cape Town.\n\nIt helps that she speaks about a dozen languages.\n\n“It’s been sort of work-work, travel-travel,” she said.\n\nHer position was created, the president of Cap U said, as an important next step to further deepen the university’s response to the Truth and Reconciliation Commission’s calls-to-action and UNDRIP.\n\nAdvertisement 5\nSTORY CONTINUES BELOW\nArticle content\n\n“Universities have an essential role to play in reconciliation,” Paul Dangerfield said.\n\nCapilano’s First Nations student services centre, Kéxwusm-áyakn (Squamish for “a place to meet”) opened in 2013.\n\nThe university itself is named after Chief Joe Capilano, also known as Joe Mathias or Sa7plek (Sahp-luk), who stood up for Indigenous rights and culture as a Skwxwú7mesh (Squamish) leader from 1895 to his death in 1910.\n\nHuron can’t wait to roll up her sleeves, can’t wait to start the process of inclusion for the Squamish, Tsleil-Waututh, Musqueam, Lil’wat and Sechelt (shíshálh) Nations.\n\n“What I’m learning is there are a lot of people here who are keen to take this on,” Huron said. “To really move projects forward that have been waiting in the wings, ideas that have been talked about for a lot of years that need impetus.”\n\ngordmcintyre@postmedia.com\n\ntwitter.com/gordmcintyre\n\nArticle content\nShare this article in your social network\nStop scratching these, and try this instead\nDaily Pulse\n|\nSponsored\nLeon Draisaitl says he's a game-time decision for Edmonton Oilers\nThe Province\nCanucks vs. Oilers: Rick Tocchet says he saw spots to attack in Edmonton penalty kill in Game 1\nThe Province\nClaim Your 50 Free Spins on Thunderstruck Wild Lightning Slots!\nLuxury Casino\n|\nSponsored\nPlay Now\nAlberta Pensioners Are Eligible For Invisible Hearing Aids\nBest Hearing Aids\n|\nSponsored\nAlways Keep a Bread Clip in Your Wallet, Here's Why\nLifeHackGuru\n|\nSponsored\nStop scrolling, stop scratching, try this instead\nDaily Pulse\n|\nSponsored\nCOMMENTS\nYou must be logged in to join the discussion or read more comments.\nCreate an Account\nSign in\nJOIN THE CONVERSATION\nAlberta Seniors Born Before 1967 Wanted For Invisible Hearing Aids\nBest Hearing Aids\n|\nSponsored\nOne Teaspoon Every Night Burns Body Fat Like Never Before, You Will Fit In Your Pants Again!\nBurn Belly Fat\n|\nSponsored\nSeniors over 70 May Pay Next To Nothing For Life Insurance Because Of This\nCovered For Life\n|\nSponsored\nLearn More\nSpray Wd-40 Up Your Faucets at Night if Alone, Here's Why\nLifeHackGuru\n|\nSponsored\nPeople Born 1944-1984 Could Apply For This Benefit\nSeniors Choice\n|\nSponsored\nRead More\nMOST POPULAR\nMilan Lucic’s wife files for divorce from Bruins forward after domestic violence allegation\nThe Province\nMOST POPULAR\nMarried Nebraska substitute teacher, 45, allegedly found undressed with teen boy in vehicle\nThe Province\nStop Buying Lottery Tickets & Start Doing This Instead!\nYukon\n|\nSponsored\nClick Here\nTRENDING\nStanley Cup Coffee, Canucks vs. Oilers: The Boeser what-if and Garland's sleepless night\nB.C. serial killer Robert Pickton savagely attacked in prison, clinging to life\nWhen Lionel Messi visits Vancouver, the world will stop for local Argentines\nRory McIlroy’s wife reached ‘breaking point’ leading to divorce: Report\nOilers 3, Canucks 2: Valiant push comes up short to end a remarkable season\nLATEST NATIONAL STORIES\nTHIS WEEK IN FLYERS"
    },
    {
        "URL": "https://www.brandonsun.com/local/2019/12/17/newspaper-letter-upsets-waywayseecappo-chief",
        "Title": "Newspaper letter upsets Waywayseecappo chief – Brandon Sun",
        "Body Text": "MAY 21, 2024\n\nBrandon\n18° C, Cloudy\n\nFULL FORECAST\n\n \n \nLOG IN CREATE ACCOUNT\nSubscribe\nTax Credit\nE-Edition\nSpecial Sections\nNewsletters\nNews\nSports\nOpinion\nWestman this Week\nThe Royal Manitoba Winter Fair\nEvents\nMultimedia\nPuzzles\nClassifieds\nObituaries\nPhoto Store\nPhoto Order Form\nAbout Us\nArchives\nContact Us\nTools\nPrivacy Policy\nMore \n      \n\n© 2024 Brandon Sun\n\n Close\n\nQuick Links\n\nHome\nArchives\nCoronavirus Coverage\nTax Credit\nSpecial Sections\nSun Bursts\nClassifieds\nObituaries\nSubscribe\nSurveys\n\nNewsletters\n\nNewsletters Home\nBeyond the Wall\nSun Bursts\n\nE-Edition\n\nAbout E-Edition\nBrandon Sun\nWestman This Week\nNewspapers In Education (NIE)\n\nNews\n\nLocal\nWestman this Week\nAgriculture\nBusiness\nCalendars\nLifestyles\nNational\nScience & Technology\nWorld\n\nOpinion\n\nOpinion home\nColumnists\nEditorials\nLetters to the Editor\nSend a letter to the Editor\nSubmit a News Tip\n\nEntertainment\n\nEntertainment\nEvents\nPuzzles\n\nMultimedia\n\nMultimedia\nPoint of View\n\nClassifieds\n\nClassifieds\nObituaries\nPhoto Store\nPhoto Order Form\n\nAbout Us\n\nAbout Us\nArchives\nContact Us\nRecent Awards\nAdvertising\nFund Raising\nHelp/FAQ\nJob Opportunities\nPrivacy Policy\nEmployee Code of Conduct Policy\nSupplier Code of Conduct Policy\nReport on Forced Labour and Child Labour in Supply Chains\nTerms and Conditions\nAccess To Information\nFP Newspapers Inc.\nLocal Journalism Initiative\n\nTools\n\nMenupage\nRSS Feeds\nSkip to content\nLOG IN CREATE ACCOUNT\n  \n SECTIONS\nLOCAL\nSPORTS\nOPINION\nWESTMAN THIS WEEK\nMORE\nCLASSIFIEDS\nOBITUARIES\nE-EDITION\nSPECIAL SECTIONS\nADVERTISE WITH US\nSUBSCRIBE\n  Local  Newspaper letter upsets Waywayseecappo chief\n\nAdvertisement\n\nLearn more about Free Press Advertising solutions\n\nNewspaper letter upsets Waywayseecappo chief\nPosted: 4:37 PM CST Tuesday, Dec. 17, 2019\nLast Modified: 4:40 PM CST Tuesday, Dec. 17, 2019\n\nAdvertisement\n\nAdvertise with us\n\n Print\n Email\n\nHey there, time traveller!\nThis article was published 16/12/2019 (1617 days ago), so information in it may no longer be current.\n\nA letter in the most recent edition of Crossroads This Week has sparked anger from Waywayseecappo First Nation.\n\nIn the Dec. 13 edition of the community newspaper, former Rossburn mayor Brian Brown wrote a letter that started off talking about the recent reckoning hockey has had with abuse and racism, and proceeds to delve into criticism for how Indigenous communities self-govern.\n\nOn Monday, Waywayseecappo Chief Murray Clearsky wrote a letter in response, calling Brown’s letter “blatantly racist.”\n\n“I played hockey for almost 40 years and am having trouble believing that these young men would take a verbal or physical insult without handing it back,” Brown wrote. “It seems that it is not racism unless it is directed by a white person towards a non-white person. If you played hockey against a team from a reserve in the 1960s you will know what I mean about reverse racism.”\n\nBrown then goes on to say that governments and Indigenous councils only want to handle problems by throwing money at them, then asks what Indigenous chiefs and councils are doing to improve their people’s economic conditions and address addiction issues. \n\n“Unfortunately, for the rest of Canada, we have a prime minister who would rather reconcile (pay them what they want) than make an attempt to change the status quo,” Brown wrote.\n\nThe former mayor, who lost last year’s election, then seems to defend the Sixties Scoop, writing “It is suggested now that we pay each child who was taken from a bad situation and given to a non-Indigenous family the sum of $40,000. How many of these children would have died if they had been left with their family?”\n\nAfter bringing up how many Indigenous children are born with Fetal Alcohol Spectrum Disorder and the suicide crisis many Indigenous communities are facing, Brown concludes by saying: “Having no future is the problem and this is something that needs to be addressed and certainly is more important than building casinos and gas stations.”\n\n“This opinion, written by the former mayor of Rossburn no less, contained nothing but racist stereotyping, false equivalence, ignorance and misinformation,” Chief Clearsky wrote in his response. “I sincerely hope that this opinion does not represent or influence how our neighbours view our people and our community.”\n\nClearsky then recommends that people who share Brown’s opinions read the reports from the Royal Commission on Aboriginal Peoples and the National Inquiry Into Missing and Murdered Indigenous Women and Girls to understand what he calls the “broken relationship” between Indigenous peoples and Canada and the impact of the country’s colonial history. \n\n“We are not weak. We are not lawless. We will not apologize for struggling to overcome what has been done to us, and we certainly recognize that there are those among us who are struggling profoundly.\n\n“Aboriginal people are not simply playing the victim in this, though I realize that may be more convenient and easier for some Canadians to believe,” Clearsky wrote. “What certainly doesn’t help are non-Aboriginal Canadians airing their uninformed, racist beliefs and opinions about our lives and communities. Surely, they have more important things to do.”\n\nThe Sun reached out to Crossroads This Week’s management and asked why they decided to publish the letter.\n\n“The letter to the editor section has long been an important forum for accountable discussion, which is why we require all letters to be signed,” publisher Ryan Nesbitt wrote in an emailed response. “When people give their viewpoint, they are held accountable for those words.\n\n“I felt it important to be in contact with a representative for the Waywayseecappo First Nation council to give them an opportunity to express their viewpoint on this letter in our next edition. Our newspaper has a long history of writing stories on the Waywayseecappo First Nation to promote the successes of the community and its people. As with all communities we cover, we look forward to continuing that positive relationship.”\n\n Brown served as mayor of the Municipality of Rossburn in non-consecutive terms, from 2007-2010 and 2015-2018. He was defeated by now-incumbent Kerry Lawless in the 2018 municipal election, coming second out of three candidates with 26.38 per cent of the vote.\n\n \n\n» cslark@brandonsun.com\n\n \n\n» Twitter: @ColinSlark\n\n \n\n \n\nAdvertisement\nAdvertise With Us\n\nAdvertisement\nAdvertise With Us\n\n Print\n Email\nREPORT ERROR\nSUBMIT A TIP\n\nAdvertisement\n\nLearn more about Free Press Advertising solutions\n\nLOCAL\n\n LOAD MORE\n\n©2024 Brandon Sun"
    },
    {
        "URL": "https://www.daily-times.com/story/news/local/navajo-nation/2019/12/24/navajo-quilter-featured-pbs-show-craft-america/2742016001/",
        "Title": "Navajo quilter featured in PBS show \"Craft in America\"",
        "Body Text": "News\nSports\nBusiness\nOpinion\nLifestyle\nAdvertise\nObituaries\neNewspaper\nLegals\nNAVAJO NATION\nNavajo quilter Susan Hudson featured in PBS show \"Craft in America\"\nNoel Lyn Smith\nFarmington Daily Times\n0:00\n0:56\nAD\n\nIGNACIO, Colorado — Susan Hudson is not afraid to use her quilts to convey her point of view about Navajo history or social issues facing Native American communities.\n\nAsk Hudson about a quilt that depicts Navajo life at Bosque Redondo and she will talk about the mistreatment of her ancestors during their internment there in the 1860s.\n\nAsk her about a quilt that centers on missing and murdered Indigenous women and she will talk about inadequacies in law to address the issue and the rise in Native communities demanding change.\n\nThese messages and the artistry Hudson uses to convey them is why she is among four quilters featured in the PBS program, \"Craft in America: Quilts.\"\n\n\"I want them to understand: We're here. We survived,\" she said in an interview at the studio she maintains in Ignacio, Colorado.\n\nHudson, who is from Sheep Springs, New Mexico, learned to sew at 9 years old. It is a skill she learned from her mother, who was forced to sew while attending boarding schools operated by the federal government.\n\nHudson is the first Navajo quilter to break into juried Native American arts shows by winning first-place prizes in textiles and best-of-show titles.\n\n\"Every time I win a ribbon, I'm representing Sheep Springs. I'm representing Navajo Nation. I'm representing our grandmas,\" said Hudson, who is Kinyaa'áanii (Towering House Clan), born for Deeshchíí'nii (Apache People Clan).\n\nHer maternal grandfather clan is Tábąąhá (Water's Edge), and her parental grandfather clan is Naakai dine'é (Mexican Clan).\n\nThrough the years, Hudson's style has evolved from star quilts to incorporating her interest in ledger drawings. Ledger art works are representational designs produced by Plains tribes using pencil, ink or watercolor on pages of ledger, or accounting books.\n\nThese pictorial quilts can take up to 18 months to complete, including sewing by machine and sewing details and binding by hand.\n\nHudson explained the process includes developing the designs. Most are based on dreams she has of her ancestors, who tell her their experiences and stories.\n\nCarolyn Ducey, curator of collections at the International Quilt Museum in Lincoln, Nebraska, said in the episode that there are 6-10 million quilters in the United States and it is a $3.7 billion industry.\n\n\"People who love to do it, love it with a passion,\" Ducey said in the program.\n\nHudson became involved with \"Craft in America\" after Carol Sauvion, the show's executive producer and director, saw her quilt, \"Missing and Murdered Indigenous Women Since 1492,\" at the Museum of International Folk Art in Santa Fe in 2018.\n\nA film crew spent three days with Hudson in May. They captured her quilting in Ignacio and in Sheep Springs, where she gathered with relatives and a quilters group from Cove, Arizona.\n\nThe segment featuring Hudson opens with a shot of her quilt entitled, \"29 Warriors,\" which has horses made of various colors of fabric surrounding a star pattern.\n\nThe star's center consists of the colors white, turquoise, yellow and black, which Hudson explained are the colors for Diné College, and the quilt is in honor of the 29 original Navajo Code Talkers.\n\nShe acknowledges that some people are puzzled by her sewing star quilts – a pattern adapted and stylized by the Lakota people.\n\nWhen asked what she would like viewers to understand about her art, she said she wants them to realize that she is Navajo but that does not pigeonhole her to art associated with the tribe.\n\n\"That's what I want them to know, that I'm taking pride in being Navajo. That I was chosen to be this. That I was chosen to do this. That door was open for me, and I ran through it,\" she said.\n\n\"Craft in America: Quilts\" will broadcast on New Mexico PBS Channel 5.1 at 9 p.m. on Dec. 27.\n\nNoel Lyn Smith covers the Navajo Nation for The Daily Times. She can be reached at 505-564-4636 or by email at nsmith@daily-times.com.\n\nSupport local journalism with a digital subscription to The Daily Times.\n\nCanadians Under Age 84 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nAd\nLearn More\nCanadians Aged 40-80 Could Apply For This Benefit\nSeniors Choice\n|\nAd\nRead More\nWhat Are the Best-Looking SUVs Of The Year? Take A Look\n(See The New Models)\nBestSearches | Search Ads\n|\nAd\nLearn More\nOrthopedic Experts Amazed: This Shoe Helps with Pain Like No Other\nBarefoot Vitality\n|\nAd\nEmpty Alaska Cruise Cabins For Sale Now (See Prices)\nSearchTopics\n|\nAd\nForget Anti-Ageing Cream, Usе This Household Item To Fill In Wrinkles\nNeotonics\n|\nAd\nTry Now\nCanadians In Alberta With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nAd\nLearn More\nThe Most Stylish SUVs That Make A Statement\nBestSearches | Search Ads\n|\nAd\nLearn More\nMore Stories\nFarmington's Susan Saiz narrowly avoided being shot on May 15, 2023\nNEWS\nRiverfest begins three-day run on Friday, May 23 in Farmington\nNEWS\nNurses Amazed: This Shoe Helps with Pain Like No Other\nBarefoot Vitality\n|\nSponsored Links\n© 2024 www.daily-times.com. All rights reserved."
    },
    {
        "URL": "https://nanaimonewsnow.com/2020/01/17/inuit-women-in-canadas-north-encountering-racialized-policing-report-says-2/",
        "Title": "Inuit women in Canada’s North encountering ‘racialized policing,’ report says | NanaimoNewsNOW | Nanaimo news, sports, weather, real estate, classifieds and more",
        "Body Text": " SECTIONS\nNEWS\nSPORTS\nCLIPPERSNOW\nWEATHER\nREAL ESTATE\nNEWS WRAP\nSTAY CONNECTED: Have the stories that matter most delivered every night to your email inbox. Subscribe to our daily local news wrap.\nBy Canadian Press\nInuit women in Canada’s North encountering ‘racialized policing,’ report says\nJan 17, 2020 | 11:10 PM\n\n\n\nOTTAWA — A national organization representing Inuit women in Canada is calling for a radical shift in the way police work is done in the North.\n\nThe demand comes after a new report released Thursday described “systemic racialized policing” in the Arctic.\n\nPauktuutit Inuit Women of Canada and Elizabeth Comack, a sociology and criminology professor at the University of Manitoba, co-authored the report, which examined how police respond to violence against women in Canada’s traditional Inuit territory, known as Inuit Nunangat.\n\nThe report says that interviews with about 45 Inuit women, and nearly as many service providers, revealed many women encounter such high rates of gender-based violence they have come to expect it in their lives.\n\nThe authors home in on actions of police officers responding to cases of domestic violence in these regions, with women saying they are often not believed when reporting abuse.\n\nSometimes, according to the report, the women reporting the violence, rather than their abusers, are the ones removed from their homes.\n\n“Racialized policing persists in Inuit women’s encounters with the justice system and it goes well beyond a few individual officers holding stereotypes about Inuit,” said Rebecca Kudloo, president of Pauktuutit Inuit Women of Canada.\n\n“Police can respond more effectively to gendered violence by adopting a ‘decolonizing framework’ that helps officers move from being an outside force to becoming more integrated with northern communities they serve.”\n\nWomen in Nunavut are the victims of violent crime at a rate more than 13 times higher than women in Canada as a whole and are 12 times more likely to be sexually assaulted than in other provinces and territories, according to data cited by the report.\n\nAlso, in 2016, Nunavut had the highest rate of female victims of police-reported family violence in Canada, with the Northwest Territories coming in second.\n\nInuit women from across Inuit Nunangat — including Nunavut, the Inuvialuit Settlement Region of the Northwest Territories, Nunavik in northern Quebec and Nunatsiavut of Newfoundland and Labrador — told the study’s authors they feel victimized by police protocols when they do report incidents of abuse.\n\nThe RCMP said in a statement Thursday it could not comment directly on the findings in the report because it had just been released.\n\nBut spokeswoman Catherine Fortin did outline steps the national police force is taking to reduce and respond to gender-based violence, including a new online training course, which is currently being developed, to teach officers how to deal sensitively with victims of trauma when conducting investigations, especially in cases of gender-based violence. \n\nThe course will be available to RCMP staff in weeks, Fortin said.\n\nThe report also emphasizes the historical context of the gendered violence that has been experienced by Inuit women over many decades, arguing it has been perpetrated or exacerbated in many cases by RCMP officers. It provides a detailed account of how Mounties were involved in moving Inuit people to permanent settlements and transporting children to residential schools.\n\nThis echoes findings of the National Inquiry into Missing and Murdered Indigenous Women and Girls, which was highly critical of the RCMP’s overall dealings with Indigenous peoples and communities. The inquiry made note of many of the same concerns and gaps in policing services for Inuit in the Arctic.\n\nThe federal government has said it will release its national plan to respond to the inquiry findings by June.\n\nFurther findings in the new study highlight concerns about inadequate dispatching systems in Arctic regions. A panel of women from all four Inuit regions held in Ottawa Thursday shared their urgent concerns about emergency calls being transferred to regional dispatching offices, slowing responses.\n\n‘When a woman is being beaten up and calls the police, how long do they wait?” Kudloo said. “When a woman is in danger, she needs somebody right there as soon as possible.”\n\nThe authors of the study found that officers spend limited stints in particular communities. This, coupled with many officers’ lack of knowledge of the Inuit language, has created a perception that police are outsiders — fuelling a widespread feeling of distrust.\n\nParticipants did note the challenges faced by police officers in the regions, including having to respond to high-risk situations of domestic violence with backup sometimes hours away.\n\nNunavut New Democrat MP Mumilaaq Qaqqaq called the report “damning” and called on the Liberal government to take swift action to address systemic issues in the North that can lead to violence, such as poor housing and mental-health services.\n\n“It is shameful that the federal government has failed to uphold the basic human rights of the people of Nunavut by refusing them housing and health care that could prevent this violence and often loss of life,” Qaqqaq said.\n\n“We see a lot more cultural programs for women, but we also need to provide men opportunities for cultural healing to address intergenerational trauma and have healthy outlets to break the cycles of violence. We need to do better. People’s lives count on it.”\n\nThe report comes with 15 recommendations, including calling for a cultural shift in policing to adapt to Inuit tradition and history in these regions. That should involve police officers becoming more connected and integrated into their communities, the report says.\n\nIt also calls for more female police officers, more Inuit civilian positions in policing to help with healing and translation and for the RCMP to revisit its posting terms for northern officers.\n\nThis report by The Canadian Press was first published Jan. 16, 2020.\n\nTeresa Wright, The Canadian Press\n\n\n\n\n\n\n\n\nby Canadian Press\nAround the Web\nCanadians Born 1944-1984 Could Be Eligible for This Benefit\nDollarGuardian\nA Teaspoon on an Empty Stomach Can Remove Parasites!\nParasiteRelief\nExpert Says This Drugstore Wrinkle Cream is Actually Worth It\nNeotonics\nThe Main Cause of Wrinkles on the Face! Attention: It's Not Age\ninfomedsolution\nMore Local News\nVIOLENT INCIDENT\nBear spray & tire iron used in parking space dispute at Nanaimo mall\n35m ago\nEXPECT DELAYS\nPaving begins along Terminal Ave. in downtown Nanaimo\n2h ago\nTHE 5 MOST UNIQUE ITEMS FOUND AT NICOL S\nThe 5 Most Unique Items Found At Nicol Street Pawnbrokers\nBILL C-18\nMeta's news ban in Canada: screenshots win, local news loses, study shows\n3h ago\nHIT VIDEO\nNanaimo students produce award-winning comedic workplace safety video\n7h ago\n5 REASONS TO SHOP SECONDHAND\n5 Reasons To Shop Secondhand\nCRISIS INTERVENTION\nVancouver Island Crisis Society executive director honoured with service award\nMay 20, 2024\nNews\nNanaimo & Central Island\nPort Alberni\nBritish Columbia\nCanada\nWorld\nWeather\nLocal Sports\nSports\nClippersNOW\nFeatures\nWater Cooler\nNanaimo Gas Prices\nSmile Sundays\nSponsored\n5 Things Friday\nPet Corner\nSignature Dish\nContact Us\nAdvertise With Us\nPrivacy Policy\nSubmission Guidelines\nTerms of Service\nContact Information\nContest Rules\nAccessibility\nReal Estate\nListings\nOpen House\nReal Estate Market Report\nListings\nSubmit an Obituary\nObituaries\nLegal and Public Notices\nCommunity Events\n\n4550 Wellington Road\nNanaimo, BC\nV9T 2H3\n\nPhone: 250-758-2467\nEmail: info@nanaimonewsnow.com\n\nWe strive to achieve the highest ethical standards in all that we do. Our newsroom abides by the RTDNA Code of Ethics and Professional Conduct and follows the Canadian Press Stylebook\n\nNanaimoNewsNOW, a division of\n\nCOPYRIGHT © 2024. ALL RIGHTS RESERVED.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
        "URL": "https://calgarysun.com/news/crime/supreme-court-to-hear-rough-sex-death-case-of-edmonton-prostitute/wcm/7b2b47b8-4464-4f88-a020-01d03f3e4954",
        "Title": "Supreme Court to hear 'rough-sex' death case of Edmonton 'prostitute' | Calgary Sun",
        "Body Text": "Skip to Content\nSpellTower, Flipart, Crosswords and more. Try PUZZMO puzzles today >>\nSections\nSearch\nSubscribe\nSign In\nNews\nOpinion\nSports\nEntertainment\nHoroscopes\nLife\nDriving\nRemembering\nReaders' Choice Awards\nePaper\nSUNShine Girls\nNewsletters\nPuzzmo\nMoney\nManage Print Subscription\nAdvertisement 1\nPrevious\nSuspected copper theft again cuts internet, phone service for thousands of Calgarians\nTRENDING\nLetters May 21, 2024: 'Justin just doesn't get it, we're tired of taxes.'\nTRENDING\nSUNshine Girl Danielle\nTRENDING\nMan in non-life-threatening condition after suffering multiple gunshot wounds\nTRENDING\nGuide to the NHL’s Final Four for Calgary Flames fans\nTRENDING\nNext\nBreadcrumb Trail Links\nCrimeCanada\nSupreme Court to hear 'rough-sex' death case of Edmonton 'prostitute'\n\nAuthor of the article:\n\nCanadian Press\nPublished Oct 08, 2018  •  3 minute read\nJoin the conversation\nCindy Gladue. Family Photo/Supplied\nArticle content\n\nOTTAWA — The case of an Ontario trucker acquitted in the death of an Alberta woman referred to at trial as a “Native” and a “prostitute” is to go before the Supreme Court this week in what could set a precedent in Canada’s sexual assault laws.\n\nAdvertisement 2\nSTORY CONTINUES BELOW\nArticle content\n\nBradley Barton says Cindy Gladue died after a night of consensual, rough sex in an Edmonton motel in June 2011. Her body was found in the bathtub after Barton called 911. She had an 11-centimetre cut in her vagina and had bled to death.\n\nA jury found Barton not guilty of first-degree murder and manslaughter. The Crown appealed following nationwide protests and the Alberta Court of Appeal ordered a new trial.\n\nArticle content\n\nThe Appeal Court ruled serious errors were made in the original trial and in the judge’s charge to the jury about Barton’s conduct and on sexual assault legislation as it pertains to consent.\n\nThe Supreme Court is to hear arguments Thursday on several procedural matters, including the role of interveners, but may also decide for the first time whether an “objective likelihood of harm” cancels out sexual consent.\n\nCalgary Sun Headline News\n\nGet the latest headlines, breaking news and columns.\n\nSign Up\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nArticle content\nAdvertisement 3\nSTORY CONTINUES BELOW\nArticle content\n\nThe Alberta Crown, as well as attorney generals in other provinces, including Ontario, is arguing for such an addition to the law.\n\nBarton’s lawyer, Dino Bottos, says it would be a big deal if the top court agrees. He plans to argue that the Crown brought up the consent versus harm argument on appeal — not at trial — and it shouldn’t affect his client’s case.\n\nIt would be akin to double jeopardy, Bottos says. “We’re just trying to hold the line.”\n\nLise Gotell is a gender studies professor at the University of Alberta and chairwoman of the Women’s Legal Education and Action Fund, or LEAF, one of 16 groups intervening in the Barton case. She points out the court has previously ruled that a person killed in a fist fight couldn’t have consented to bodily harm.\n\nAdvertisement 4\nSTORY CONTINUES BELOW\nArticle content\n\n“But the court has never made a ruling on whether or not this rule applies in a sexual context.”\n\nThe Barton case is complicated, says Gotell, who adds that LEAF won’t argue for the new consent provision because it believes Gladue didn’t agree at all.\n\nBarton has testified that he hired Gladue for two nights of sex that included putting his fist in her vagina. When he woke up after the second night, he said, he found her dead in the tub.\n\nA medical examiner testified that the wound to Gladue’s vaginal wall was likely to have been caused by a sharp object and, in a rare move, he used Gladue’s preserved vaginal tissue as an exhibit.\n\nThat was disrespectful and dehumanizing, says Gotell, as were the comments from lawyers who referred to Gladue more than two dozen times before the jury as a native prostitute.\n\nAdvertisement 5\nSTORY CONTINUES BELOW\nArticle content\n\nThe 36-year-old Metis woman was a mother of three girls. She struggled with addiction and poverty and deserved better, says a factum filed by lawyers with another intervener — the National Inquiry into Missing and Murdered Indigenous Women and Girls.\n\n“We recall her strength and dignity now, because the trial in relation to her death failed to do so,” it says.\n\nMuriel Stanley Venne, founder of the Institute for the Advancement of Aboriginal Women, a co-intervener with LEAF, says there’s never been a better time, in light of the #MeToo movement, for a case like this to be heard.\n\n“I believe this is the most important case in my lifetime,” says Venne, who is 80. “Our Cindy Gladue is the embodiment and the hero that we are looking for to change the conduct of the court.”\n\nArticle content\nShare this article in your social network\nStop Buying Lottery Tickets & Start Doing This Instead!\nYukon\n|\nSponsored\nClick Here\nSUNshine Girl Kassey\nCalgary Sun\nSUNshine Girl Nicole\nCalgary Sun\nSeniors Say Goodbye To Expensive Car Insurance If You Live In These Postal Codes\nAuto Insurance\n|\nSponsored\nEdmonton: $75,000 Disability Grant for You\nNational Disability Credit Alliance\n|\nSponsored\nApply Now\nCanadians Under Age 84 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nPeople Born 1944-1984 Could Apply For This Benefit\nSeniors Choice\n|\nSponsored\nRead More\nCOMMENTS\nYou must be logged in to join the discussion or read more comments.\nCreate an Account\nSign in\nJOIN THE CONVERSATION\nSeniors over 70 May Pay Next To Nothing For Life Insurance Because Of This\nCovered For Life\n|\nSponsored\nLearn More\nStop Buying Lottery Tickets & Start Doing This Instead\nYukon Casino\n|\nSponsored\nLearn More\nPut Baking Soda in the Toilet, Here's Why\nLifeHackGuru\n|\nSponsored\nAlberta Seniors Are Eligible For A Free Hearing Test (Here's how)\nConnect Hearing\n|\nSponsored\nForget Anti-Ageing Cream, Usе This Household Item To Fill In Wrinkles\nNeotonics\n|\nSponsored\nTry Now\nMOST POPULAR\nSUNshine Girl Brittany\nCalgary Sun\nMOST POPULAR\nSUNshine Girl Kimberly\nCalgary Sun\nOne Teaspoon Every Night Burns Body Fat Like Never Before, You Will Fit In Your Pants Again!\nBurn Belly Fat\n|\nSponsored\nTRENDING\nSuspected copper theft again cuts internet, phone service for thousands of Calgarians\nLetters May 21, 2024: 'Justin just doesn't get it, we're tired of taxes.'\nSUNshine Girl Danielle\nMan in non-life-threatening condition after suffering multiple gunshot wounds\nGuide to the NHL’s Final Four for Calgary Flames fans\nREAD NEXT\n \n \n \n \n \nLATEST NATIONAL STORIES\nTHIS WEEK IN FLYERS"
    },
    {
        "URL": "http://www.hilltimes.com/2018/02/12/trudeaus-cabinet-hosts-first-baby-shower-karina-gould/133851",
        "Title": "Trudeau’s female cabinet ministers host baby shower for Democratic Institutions Minister Gould - The Hill Times",
        "Body Text": "Menu\nSearch\nSearch\nNEWS\nOPINION\nARCHIVES\nPOLITICS\nFOREIGN POLICY\nLOBBYING\nLEGISLATION\nGET FREE NEWS UPDATES\nipuser2@ualberta.ca\nSUBSCRIBE\nYou currently have IP access to hilltimes.com through the University of Alberta 's subscription.\nPlease enter your institutional email below to start receiving our daily newsletter for in-depth coverage of Canadian Politics.\nSIGN UP\nTuesday, May 21, 2024\nCanada’s Politics and Government News Source Since 1989\nLatest Paper\n\nTRENDING:\n\nWildfires\nde Adder’s Take\nLiberal campaign co-chairs\nRose LeMay\nHeard on the Hill\nMichael Harris\nVoter data case\nHeard On The Hill\nTrudeau’s female cabinet ministers host baby shower for Democratic Institutions Minister Gould\nCanadian Press' Kristy Kirkup gives birth to a baby girl; former Defence minister Peter MacKay is going to have another baby; Democracy Watch challenges former lobbying commissioner's decision.\nDemocratic Institutions Minister Karina Gould and some of her cabinet colleagues hosted the first cabinet baby shower last week. Photograph courtesy of Twitter\nFEATURE | BY SHRUTI SHEKAR | February 12, 2018\n\nA handful of ministers in Prime Minister Justin Trudeau’s cabinet hosted what was the first ever baby shower for a cabinet minister, Democratic Institutions Minister Karina Gould, on Feb. 5.\n\n“Canadian history in the making. Tonight we celebrated @KarinaGould—who will be the first woman to give birth while in cabinet! From all of us—congratulations! #AddWomenChangePolitics,” Environment Minister Catherine McKenna enthusiastically tweeted on Feb. 5 along with a picture.\n\nPublic Services and Procurement Minister Carla Qualtrough, National Revenue Minister Diane Lebouthillier, Employment Minister Patty Hajdu, Indigenous Services Minister Jane Philpott, Justice Minister Jody Wilson-Raybould, and Small Business and Tourism Minister Bardish Chagger were all in attendance at the small evening gathering.\n\nMs. Gould previously told the media that she hoped being the first federal cabinet minister to give birth while in office will help set better rules for parental leave on Parliament Hill.\n\nCurrently, the House rules say MPs are allowed to take a 21-day absence from parliamentary sittings, after which their pay will be docked with exceptions relating to illness.\n\nBecome a Political Insider\nSign up for Today's Headlines newsletter now\nSIGN UP\n\nBy entering your email address you consent to receive email from The Hill Times containing news, analysis, updates and offers. You may unsubscribe at any time. See our privacy policy\n\nMs. Gould is due to give birth in March and plans to take about two months off from House duties. Treasury Board President Scott Brison will take over for Ms. Gould while she’s off.\n\nMorgan, Butts duke it out on Twitter and it’s frothy\n\nIt all started last week when Brit journalist Piers Morgan, former host of CNN’s Piers Morgan, wrote a column in The Daily Mail on Feb. 6, headlined, “How dare you kill off mankind, Mr. Trudeau, you spineless virtue-signalling excuse for a feminist.” Wow.\n\nThe column attacked Prime Minister Justin Trudeau‘s use of the word “peoplekind” in response to a question at a town hall. The column was posted on the popular Canadian news aggregator, National Newswatch, and then it took off from there.\n\nPiers Morgan and Gerald Butts got into a scrap on Twitter. Photograph courtesy of Wikipedia Commons and The Hill Times file photograph\n\nBut Mr. Trudeau later clarified that the remark was a “dumb joke” that appeared to have went over fine at the event but “didn’t play so well” out of context. It also sounded more like he was teasing the questioner who was telling Mr. Trudeau that she’d like to share the message of “God the Mother,” and said “maternal love is the love that’s going to change the future of mankind,” to which Mr. Trudeau said, “We’d like to say ‘peoplekind,’ not necessarily mankind, because it’s more inclusive.”\n\nGerald Butts, the PM’s principal secretary, tweeted at Ms. Morgan on Feb. 8: “You have joined a lovely international club,” copying a previous tweet he posted commenting on a video of the woman who heckled Mr. Trudeau at his town hall in Hamilton being interviewed by controversial alt-right activist Jack Posibiec.\n\nMr. Morgan, who has 6.4 million Twitter followers, didn’t take too kindly to being lumped in with the notorious alt-right, which is often conflated with white nationalism and the neo-Nazi movement, and accused Mr. Butts, who has 40,000 Twitter followers, of being, er, not the brightest lightbulb in the room.\n\n“The whole world laughed at your boss & his absurdly politically correct, virtue-signalling #peoplekind nonsense,” Mr. Morgan posted on Twitter.\n\n“If you choose to condemn everyone who did so as being a Nazi, then I politely suggest you’re a complete & utter halfwit.”\n\nMr. Morgan then tweeted: “Mr. Butts is what we Brits would call ‘one sandwich short of a full picnic.’ Incredible that someone so close to your prime minister is able to spout such dangerously inflammatory nonsense on his behalf.” This particular tweet was retweeted 834 times and was favourited by 1,826 people. “a) I’m not a Nazi. b) It wasn’t a joke. c) If you’re one of @JustinTrudeau’s chief advisers, no wonder he’s making so many gaffes.”\n\nIt wasn’t a good week for Mr. Trudeau. The Toronto Star ran a front-page column on Feb. 7 by entertainment columnist Vinay Menon headlined, “For the sake of peoplekind, Justin Trudeau needs to shut his mouth,” and The Washington Post’s Molly Roberts wrote a column on Feb. 7 headlined, “Forget ‘peoplekind.’ There’s a lot else wrong with Justin Trudeau,” criticizing not only Mr. Trudeau’s flat town hall performance, but his government’s $233-million deal to sell 16 combat helicopters to the Philippines.\n\nCP’s Kristy Kirkup welcomes baby Hazel, and she already missed her deadline by four days\nCanadian Press’ Kristy Kirkup has given birth to her daughter baby Hazel and she’s super cute. Photograph courtesy of Twitter\n\nCanadian Press’ Kristy Kirkup gave birth to a baby girl on Feb. 5.\n\n“Who run the world? Girls. Meet Hazel Grace. Seven lbs. of strength born Monday morning,” Ms. Kirkup tweeted on Feb. 6 along with a super cute photo of her newborn.\n\nToronto Star’s Tonda MacCharles tweeted that same day: “Welcome to the world Haze. Isn’t she arriving before deadline? Excellent start.”\n\nMs. Kirkup tweeted in response to Ms. MacCharles that Hazel was late: “She ended up missing her deadline by four days—a girl with her own schedule!”\n\nCongrats to you, Ms. Kirkup!\n\nPeter MacKay’s family is adding one more\nFormer defence minister Peter MacKay is adding one more to his family. Photograph courtesy of Twitter\n\nSpeaking of babies, congratulations are in order for former federal defence minister Peter MacKay, who tweeted that his wife, Nazanin Afshin-Jam, is pregnant again.\n\n“Thrilled to share the news that team MacKay will add a new player to be named to the roster. Kian, Valentia, Nazanin & I could not be happier to welcome this little fella to our lineup. Such a blessing, no greater feeling on earth,” Mr. MacKay tweeted on Feb. 6.\n\nThe veteran Conservative MP was first elected as a Progressive Conservative in 1997 for the riding of Pictou-Antigonish-Guysborough, N.S., and then as a Conservative representing the riding of Central Nova, N.S. from 2004 through to 2015.\n\nIn May 2015, Mr. MacKay announced he was leaving politics to focus on his family.\n\nHis first child, Kian, was born in 2013, and his daughter, Valentia, was born in 2015.\n\nHe served in former prime minister Stephen Harper’s cabinet as the foreign affairs minister from 2006 to 2007, the national defence minister from 2007 to 2013, and the justice minister and attorney general of Canada from 2013 to 2015. Ms. Afshin-Jam is an Iranian-Canadian public speaker and human rights activist, president and co-founder of Stop Child Executions and founder of the Nazanian Foundation.\n\nElizabeth McGuinty dies, mother of Ottawa’s illustrious McGuinty clan\nDavid McGuinty’s, left, and Dalton McGuinty’s mother Elizabeth has died. The Hill Times photograph by Andrew Meade and Hill Times file photograph\n\nElizabeth McGuinty, the mother of Ottawa’s illustrious McGuinty clan, including federal Liberal MP David McGuinty and former Liberal Ontario premier Dalton McGuinty, died on Feb. 3 at the age of 88.\n\nFor the majority of her life Ms. McGuinty was a nurse at the Civic, Wakefield, Riverside, National Defence Medical Centre, and Children’s Hospitals, in Ottawa, her obituary said.\n\nElizabeth and the late Dalton Sr., who was a former Ontario provincial politician who served in the Ontario Legislature from 1987-1990 representing Ottawa South, had 10 children. Her son David has been the federal MP for the riding of Ottawa South, Ont. for more than 13 years and was first elected in 2004. Dalton Jr., was first elected provincially in the same Ottawa South riding that his father represented in 1990 and was later elected as Ontario premier in 2003 serving for 10 years. Brendan McGuinty worked for former Ottawa mayor Bob Chiarelli.\n\nGerson and Ling launch a podcast\nJen Gerson and Justin Ling have joined forces to do a podcast produced by Canadaland. Photograph courtesy of LinkedIn and Twitter\n\nIt looks like former National Post’s Jen Gerson and former Vice’s Justin Ling have partnered together to host a podcast called OPPO.\n\nThe podcast is produced by Canadaland, and includes discussion and debate on all things politics.\n\n“This is episode 1 of mine and @jengerson’s inexplicably Soviet-theme podcast. Please forgive the rough audio, my vocal fry, Jen’s nihilism, and just @JesseBrown in general,” Mr. Ling tweeted Feb. 6.\n\nOn a side note, Mr. Ling is also writing for The Globe and Mail covering the alleged serial killer Bruce McArthur’s story in Toronto and freelancing for BuzzFeed News.\n\n“Congrats to @Justin_Ling on joining The Globe’s national desk for a short-term contract even though he totally ignored me in the 15th-floor kitchenette yesterday and then walked away muttering something about the lack of beards among his new co-workers,” Globe and Mail reporter Simon Houpt tweeted on Feb. 7.\n\nIn response, Mr. Ling jokingly tweeted that he was “actually muttering a great recipe for almond cheesecake, and you’ve totally missed it.”\n\nU.S. Congressman Pete Sessions, U.S. Ambassador Kelly Craft to speak at dinner event, Feb. 13\nU.S. Ambassador to Canada Kelly Craft will be a guest speaker at an upcoming event hosted by the Macdonald-Laurier Institute. The Hill Times photograph by Sam Garcia\n\nU.S. Congressman Pete Sessions and U.S. Ambassador to Canada Kelly Craft will be guest speakers at a dinner hosted by the Macdonald-Laurier Institute on Feb. 13 in Ottawa.\n\nThe event will be hosted at the Canadian War Museum and will begin at 5:30 p.m.\n\nThe panel discussion will focus on what a future path for Canada-U.S. relations will look like, and will “explore the issues facing the Trump and Trudeau governments,” the event invitation said.\n\nFormer Canadian ambassador to the U.S. Frank McKenna will moderate the discussion.\n\nIndividual tickets cost $250.\n\nGet your tickets to Samara’s Wonk Prom After-Party\nFormer chief justice Beverley McLachlin will be an honouree at the Public Policy Forum Testimonial Dinner in Toronto, and later might be a guest at Samara’s Wonk Prom after-party. The Hill Times photograph by Andrew Meade\n\nThe non-partisan civic engagement charity, Samara, has opened up ticket sales to its Wonk Prom After-Party event that will be hosted on April 12 in Toronto.\n\nThe after-party will be hosted right after the Public Policy Forum Testimonial Dinner, where more than 1,000 leaders from different sectors come together to pay tribute to the achievements of leaders who have made an outstanding contribution to public policy.\n\nThe dinner will be hosted that same day from 5 p.m. to 9 p.m. at the Metro Toronto Convention Centre, and afterwards guests can head on over to the Steam Whistle Brewing building on Bremner Boulevard in downtown Toronto, which is where the after party will be hosted.\n\nThis year’s Testimonial Dinner honourees include former chief justice Beverley McLachlin and Mark Carney, former Bank of Canada governor, and it’s possible that they will be at the after-party.\n\nAdvance tickets are $30, and $35 if you buy them at the door.\n\nDemocracy Watch challenges former lobbying commissioner on Aga Khan\nFormer lobbying commissioner Karen Shepherd’s decision on the Aga Kahn’s interactions with Justin Trudeau have drawn a legal challenge from Democracy Watch co-founder Duff Conacher. The Hill Times file photograph\n\nDuff Conacher, co-founder of Democracy Watch, launched a Federal Court challenge on Jan. 19 against former lobbying commissioner Karen Shepherd’s decision that the Aga Khan did not break lobbying rules.\n\nMs. Shepherd’s decision indicated that the Aga Khan did not break lobbying rules when he vacationed with Prime Minister Justin Trudeau in the Bahamas.\n\nThe CBC reported that Ms. Shepherd had determined that the Aga Khan was not paid by the foundation to lobby, meaning his interactions with Mr. Trudeau were not covered by the Lobbyists Code of Conduct.\n\n“After reviewing the information provided to me in the administrative review report, I have come to the conclusion that the Aga Khan receives no payment for his work on behalf of the Aga Khan Foundation Canada and, therefore, does not engage in activities requiring registration as a lobbyist,” Ms. Shepherd wrote in a letter obtained by the CBC.\n\nMr. Conacher, however, argued the ruling was “legally incorrect” and “violates the spirit and purpose of the Lobbyists’ Code of Conduct.\n\n“[It] opens up a huge loophole that big businesses and other organizations will exploit by having their unregistered board members or staff do favours for, and give gifts to, politicians and government officials they are lobbying as a way of unethically influencing their policy making decisions,” Mr. Conacher said in a statement.\n\nsshekar@hilltimes.com\n\n@shruti_shekar\n\n \nSee all stories BY SHRUTI SHEKAR\n \nMORE NEWS\nO’Regan names acting comms head, hires new issues manager\nFEATUREBY LAURA RYCKEWAERT\nLive, from Parliament Hill! It’s the cutest pets photo contest\nFEATUREBY MIKE LAPOINTE\nJoe Clark to mark 45th anniversary of his election as Canada’s 16th prime minister on May 22 in Ottawa\nComms staff on the move: new press secretaries for Champagne, Sudds\nFEATUREBY LAURA RYCKEWAERT\nTulips brighten dreary downtown day\nFEATUREBY ANDREW MEADE\n\nRELATED STORIES\n\nD’Arcy McGee’s former manager finds a new home on the farm\nFEATUREBY ALICE CHEN\nFormer CSIS intelligence officer seeking NDP nomination in Ottawa South, McGuinty stronghold\nFEATUREBY MIKE LAPOINTE\n‘A bit young to be a grandfather’: Indigenous Services Minister Marc Miller announces he’s a grandpa\nFEATUREBY PALAK MANGAT\nDefenestration talk: Scheer inadvertently helps some politicos learn a new word\nFEATUREBY PALAK MANGAT\nTassi, O’Regan exit their campaigns to tend to ill family members, Tassi’s mother dies on Oct. 12\nFEATUREBY NEIL MOSS\nIN-DEPTH FEATURES\nU.S. election preoccupies Canada’s top 50 foreign influencers as feds’ focus gets pulled from Asia strategy\nNEWSBY NEIL MOSS, STEPHEN JEFFERY, STUART BENSON, JONAH GRIGNON\nThe Hill Times’ 100 Best Books of 2023\nFEATUREBY KATE MALLOY\nHousing Minister Fraser a 2023 fan favourite on Parliament Hill: All Politics Poll\nFEATUREBY CHELSEA NASH\nTop 100 Lobbyists in 2023: green tech and economy boosting set for top advocacy priorities in 2023, say lobbyists\nNEWSBY JESSE CNOCKAERT, STEPHEN JEFFERY\nTop 100: the most influential people in government and politics in 2023\nLISTBY LAURA RYCKEWAERT, MIKE LAPOINTE, ABBAS RANA, NEIL MOSS, SAMANTHA WRIGHT ALLEN\nNEWS\nPolitics\nForeign Policy\nLobbying\nLegislation\nPolicy Briefings\nPolitics This Morning\nHill Climbers\nCivil Circles\nHeard On The Hill\nElection\nFinance and Budget\nPublic Service\nExclusive Lists\nParliamentary Calendar\nTop 100 Lists and Exclusive Features\nPodcasts\nThis Week's Paper\nSearch\nArchives\nDigital Newspaper Archives\nGet free news updates\nOPINION\nAndrew Caddell\nSheila Copps\nDavid Crane\nJim Creskey\nGwynne Dyer\nMichael Harris\nErica Ifill\nScott Taylor\nJoe Jordan\nRose LeMay\nAlex Marland\nGerry Nicholls\nGar Pardy\nTim Powers\nSusan Riley\nDouglas Roche\nKen Rubin\nBhagwant Sandhu\nLes Whittington\nSubmit a guest opinion article\nRESOURCES\nThe Wire Report\nHill Times Research Health\nThe Lobby Monitor\nParliament Now\nInside Ottawa Directory\nHill Times Careers\nThe Hill Times Store\nDigital Newspaper Archives\nADVERTISE\nMedia Kit\nSUBSCRIBE\nGroup subscriptions\nReuse and permissions\nGET HELP\nAbout us\nContact us\nPrivacy Policy\nReset Password\nAccount settings\n© The Hill Times 2023\n\nGET A FREE COPY\nof our guide on HESA's study on breast implant risks, \"Exposing the Risks of Breast Implants in Canada\" when you take a trial to \nHill Times Research.\n\nClick here to sign up\nNo thanks"
    },
    {
        "URL": "https://www.montereyherald.com/2023/05/04/event-in-seaside-to-raise-awareness-of-violence-but-also-celebrate-indigenous-women/",
        "Title": "Event in Seaside to raise awareness of violence, but also celebrate indigenous women – Monterey Herald",
        "Body Text": "Skip to content\nAll Sections\nSubscribe Now\nHome Page\nClose Menu\nNews\nNews\nLocal News\nNews Alerts\nCrime and Public Safety\nCourts\nBusiness\nMarijuana\nEducation\n2020 Election\nEnvironment\nHealth\nHousing\nTransportation\nCalifornia News\nSports\nSports\nLocal Sports\nHigh School Sports\nAT&T Pebble Beach Pro-Am\nCollege Sports\nOakland Athletics\nRaiders\nSan Francisco 49ers\nSan Francisco Giants\nSan Jose Sharks\nGolden State Warriors\nLifestyle\nLifestyle\nEntertainment\nMovies\nRestaurants Food and Drink\nHome & Garden\nComics\nPuzzles\nEvents\nObituaries\nObituaries\nNews Obituaries\nPlace an Obituary\nOpinion\nOpinion\nColumnists\nEditorials\nLetters to the Editor\nSpecial Sections\nAdvertising\nAdvertise with Us\nSponsored Content\nPublic Notices\nSubscribe\nLog in\nClose Menu\n\nSign up for email newsletters\n\nSign Up\nSubscribe\nLog in\n60°F\nTuesday, May 21st 2024\n\ne-Edition\n\nNews\nSports\nLifestyle\nObituaries\nOpinion\nAdvertise\nSpecial Sections\ne-Edition\n\nTRENDING:\n\nCharges in Zogg Fire dismissed\nWhere ex-Californians go\nBill targets high rent deposits\nCoastline will shrink by 2100\nTax would fund affordable housing\nBREAKING NEWS\nHigh School boys golf: Stevenson captures Northern California team title\nMay 21, 2024 at 12:00 pm\nLATEST HEADLINES\nEvent in Seaside to raise awareness of violence, but also celebrate indigenous women\nRed Dress Day, at the Oldemeyer Center in Seaside on Saturday, is sponsored by the Arts Council of Monterey County, Cal-Am Water Company, the Native California Research Institute, the city of Sand City, and the city of Seaside. (Forest Dempsey)\nBy JAMES HERRERA | jherrera@montereyherald.com | Monterey Herald\nPUBLISHED: May 4, 2023 at 2:16 p.m. | UPDATED: May 4, 2023 at 2:25 p.m.\n\nSEASIDE – An event to bring awareness to violence against Indigenous Women will feature music and discussion about the topic as the national day in May honors Missing and Murdered Indigenous Women, Girls, and Two-Spirit People.\n\n“Red Dress Day” at the Oldemeyer Center in Seaside will take place Saturday from 11 a.m.-6 p.m. at 986 Hilby Ave. to spotlight, educate and build awareness while honoring th . . .\n\nHeart Surgeon Shares 3 Min Routine For Daily Bowel Movements\nGundry MD\n|\nSponsored\nLearn More\nEmpty Alaska Cruise Cabins For Sale Now (See Prices)\nSearchTopics\n|\nSponsored\nSeniors in Alberta Eligible For Hearing Aids In April\nConnect Hearing\n|\nSponsored\nSeniors in Alberta Eligible For A Free Hearing Check\nConnect Hearing\n|\nSponsored\nCanadians Aged 40-80 Could Apply For This Benefit\nSeniors Choice\n|\nSponsored\nRead More\nBank Owned Properties For Sale In Alberta (See Prices)\nBrightLifeDaily.com\n|\nSponsored\nLearn More\nForget Anti-Ageing Cream, Usе This Household Item To Fill In Wrinkles\nNeotonics\n|\nSponsored\nTry Now\nEdmonton: Instant Approval Credit Cards For Bad Credit\nCredit Card\n|\nSponsored\nSeniors over 70 May Pay Next To Nothing For Life Insurance Because Of This\nCanadians are taking advantage of big life insurance changes\nCovered For Life\n|\nSponsored\nLearn More\nOrthopedic Experts Amazed: This Shoe Helps with Pain Like No Other\nBarefoot Vitality\n|\nSponsored\nNurses Amazed: This Shoe Helps with Pain Like No Other\nBarefoot Vitality\n|\nSponsored\nWhat Are the Best-Looking SUVs Of The Year? Take A Look\n(See The New Models)\nBestSearches | Search Ads\n|\nSponsored\nLearn More\nTo Fill In Wrinkles Use This Household Item, Fоrget Anti-Ageing Cream\nmedblogeu\n|\nSponsored\nTry Now\nMost Popular\nRECOMMENDED FOR YOU\nWhat are the betting odds for first Donald Trump-Joe Biden debate?\nBarbara Intermill, On Nutrition: Do calories really count?\nMonterey symposium shines light on human trafficking crisis\nExploring African American history in Seaside; research paper posted for public comment\nFerrari Racing Days: Seeing red at Laguna Seca\nTop 10 baseball rankings\n6 do’s and don’ts when using CDs for retirement\nAiyuk and others absent, Bosa present as 49ers start OTA practices\nWe checked in with Hollywood writers a year after the strike. They’re not OK\nDonald Trump won’t testify at hush money trial as defense rests its case\n\nMORE IN UNCATEGORIZED\nTuesday’s primaries include presidential races and the prosecutor in Trump’s Georgia election case\nSUBSCRIBER ONLY\nMonterey City Council to vote on cannabis, hear from Cal Am\nSUBSCRIBER ONLY\nSeaside City Manager a no-show for public hearing he requested\nSUBSCRIBER ONLY\nHousing Authority warns of fake Monterey County ‘affordable housing programs’ ads\n2023\nMay\n4\nSUBSCRIBE\ne-Edition\nSign Up For Newsletters\nCONTACT US\nBuy Photos\nWork With Us\nSpecial Sections\nABOUT US\nSubmit an Obituary\nPrivacy Policy\nAccessibility\nSitemap\nADVERTISE WITH US\nToday’s Ads\nMediaNews Group Advertising\nCLASSIFIEDS\nLocal Guide\nJobs\nOpen House Directory\nLegal Notices\nSUBSCRIBE NOW\nTerms of Use\nCookie Policy\nCalifornia Notice at Collection\nNotice of Financial Incentive\nDo Not Sell/Share My Personal Information\nArbitration\nPowered by WordPress.com VIP\n\nCopyright © 2024 MediaNews Group\n\n \nDISABLE INCOGNITO OR SUBSCRIBE TO CONTINUE\n﻿Log in\nMEMORIAL DAY SALE\n$3for 1 YEAR\n\nSAVE NOW﻿\nNO COMMITMENT, CANCEL ANYTIME\nSUBSCRIPTION INCLUDES:\n\n\nWebsite\n\nE-edition\n\nMobile App\n\n\n\nINTERESTED IN PRINT?\n\nView Options\nReturn to Homepage\nAlready a Print subscriber? \nActivate your access"
    },
    {
        "URL": "https://globalnews.ca/news/9573238/shared-health-backup-plan-sexual-assault-program-replacement-nurses-train/",
        "Title": "Shared Health to put backup plan in place for sexual assault program while replacement nurses train - Winnipeg | Globalnews.ca",
        "Body Text": "SKIP TO MAIN CONTENT\nSUBSCRIBE\nRADIO\nLIVE\nSite theme toggle. Switch between light or dark mode\nLIGHT\nDARK\nGlobalNews home\nWatch\nWorld\nCanada\nLocal\nPolitics\nMoney\nHealth\nEntertainment\nLifestyle\nPerspectives\nSports\nCommentary\nContests\nPodcasts\nU.S. News\nShopping\nFull Menu\nSearch Menu\nHEALTH\nShared Health to put backup plan in place for sexual assault program while replacement nurses train\nBy Sam Thompson  Global News\nPosted March 23, 2023 11:01 am\n 2 min read\nView image in full screen\nHealth Sciences Centre in Winnipeg. Global News / File\nLEAVE A COMMENT\nSHARE THIS ITEM ON FACEBOOK\nSHARE THIS ITEM ON TWITTER\nSEND THIS PAGE TO SOMEONE VIA EMAIL\nSEE MORE SHARING OPTIONS\nDESCREASE ARTICLE FONT SIZE\nINCREASE ARTICLE FONT SIZE\n\nWinnipeg’s Health Sciences Centre has a backup plan to maintain coverage in its Sexual Assault Nurse Examiner (SANE) program.\n\nThe program has been under fire recently, as seven of 13 nurses resigned from the program earlier this week. Among other duties, SANE nurses collect evidence after sexual and domestic assaults.\n\nJennifer Cumpsty, Shared Health’s executive director for acute care, said at a news conference Wednesday that a group of physicians and nurse practictioners have come forward to — for the time being — cover the program’s gaps so the hospital can continue to provide care for survivors.\n\n“We’re putting in place today the process if there is not a trained nurse on duty, what the steps will be to activate the backup plan to come in and see those patients,” Cumpsty said.\n\nSTORY CONTINUES BELOW ADVERTISEMENT\n\n“There’s a team working on how we will notify someone who’s the backup.\n\n“So if there’s a SANE nurse on duty, they would be notified as soon as that patient was medically cleared and ready for the exam, and the process that the team is working on right now is how we will notify the physicians that are going to be the backup.”\n\n1:22\nMore nurses quit Manitoba service for sexual assault victims amid ongoing staffing issues\n\nLast spring, Manitoba Health Minister Audrey Gordon announced $640,000 in provincial funding to hire five full-time forensic nurse examiners for the program, including a provincial co-ordinator.\n\nThe latest health and medical news emailed to you every Sunday.\n\nShared Health says six new permanent positions have been filled, but due to the intensive training needed, they won’t start working until June.\n\nEarlier this year, Global News learned from Shared Health that 14 victims had been turned away from HSC within a nine-month period.\n\nSTORY CONTINUES BELOW ADVERTISEMENT\n\nThey were told not to shower and to come back later when a nurse was available to examine them.\n\nThe Manitoba Nurses Union has been vocal in its concerns over staffing woes and the impact the lack of support can have on both workers and their patients. The province’s Opposition NDP has called for Gordon’s resignation over the crisis.\n\nOn Thursday, the Assembly of Manitoba Chiefs expressed what it said is “deep concern” over the resignations, calling on government to return the program to its full capacity as soon as possible.\n\nSTORY CONTINUES BELOW ADVERTISEMENT\n\nAMC pointed out the focus on victims of interpersonal violence in the final report of the National Inquiry Into Missing and Murdered Indigenous Women and Girls, and that First Nations individuals continue to be disproportionately targeted for this type of violence.\n\n“It is incredibly disheartening to know that an essential program that is supposed to be a safe, supportive, and an affirming option for those victims who has experienced unimaginable trauma, has now become a source of frustration, disappointment and re-victimization,” Grand Chief Cathy Merrick said in a statement.\n\n“It is clear that the province must intervene immediately to re-examine the ailing health care system, starting with re-assessing the sexual assault nurse examiner program so that those who need it, can confidently be treated with care and compassion and know their assessments will be done efficiently and without inflicting further trauma.”\n\n0:18\nManitoba Nurses Union demands support for sexual assault examiner units\nJOURNALISTIC STANDARDS\nCOMMENT\nREPORT AN ERROR\n© 2023 Global News, a division of Corus Entertainment Inc.\nSponsored content\nMore to Explore\nWHAT IS OUTBRAIN\nMORE FROM GLOBAL NEWS\nER visits among seniors rose after cannabis legalization, study finds\nWildfires and air quality: How to check the reading in your area\nADVERTISEMENT\nThe News on CJOB\n3:00 PM - 6:00 PM\nCJOB\nTrending\nSerial killer Robert Pickton attacked in Quebec prison\n24,559\nREAD\nHere’s how to prevent tick bites and safely remove them\n21,741\nREAD\nInflation continues to cool. So is the Bank of Canada ready for rate cuts?\n20,021\nREAD\nSingapore Airlines: 1 dead, 30 injured after ‘severe turbulence’ rocks Boeing 777\n17,290\nREAD\n3 people dead, 5 injured after serious boat collision north of Kingston, Ont.\n11,518\nREAD\nTop Videos\nSerial killer Robert Pickton attacked in Quebec prison\nTicks are ‘better, stronger, faster’: National Veterinary Association\nBusiness Matters: Alternative grocery options see boost during Loblaw boycott\n1 dead, at least 30 injured after Singapore Airlines flight faces severe turbulence\nDeadly boat collision near Kingston, Ont., leaves 3 dead, 5 injured over long weekend\nMORE VIDEOS\nStay in the loop\n\nThe latest health and medical news emailed to you every Sunday.\n\nSIGN UP FOR HEALTH IQ NEWSLETTER\nSIGN UP\nADVERTISEMENT\n AdChoices\nGlobal News Facebook Pages\nGlobal News Twitter Accounts\nGlobal News Youtube Channel\nGlobal News on Instagram\nGlobal News on LinkedIn\nGlobal News on TikTok\nGlobal News on Telegram\nAbout\nPrinciples & Practices\nBranded Content\nContact us\nRSS\nNewsletters\nNotifications\nSmart home\nAdvertisers Election Registry\nGlobal News Licensing Requests\n©2024 GLOBAL NEWS, A DIVISION OF CORUS ENTERTAINMENT INC. CORUS NEWS. ALL RIGHTS RESERVED.\nPRIVACY POLICY\nCOPYRIGHT\nTERMS OF USE\nADVERTISE\nADVERTISING STANDARDS TERMS\nCORUS ENTERTAINMENT\nACCESSIBILITY"
    },
    {
        "URL": "https://fftimes.com/news/local-news/mayor-thanks-rrfn-for-their-annual-fish-fry-generosity/",
        "Title": "Mayor thanks RRFN for their annual fish fry generosity - Fort Frances Times",
        "Body Text": "Skip to content\nFeatured\n#Ukraine\n#findajob\n#COVID-19\n#Get-The-Times!\nTuesday, May 21, 2024\nMy Profile\nFort Frances Times\n\nLocal News From Across The Rainy River District\n\nNews\nFeatures\nJobs & Classifieds\nSpecial Sections\nAbout Us\nContact the Times\nSubscribe Today!\nDigital Editions\nHome\nNews\nLocal News\nMayor thanks RRFN for their annual fish fry generosity\nDaily Headlines\nLocal News\nMayor thanks RRFN for their annual fish fry generosity\n 25 May 2023\nBy Ken Kellar\nStaff writer\nkkellar@fortfrances.com\n\nIn and amongst a busy few weeks, the mayor of Fort Frances found time to help cook a feast of fish for community friends.\n\nDuring his regular address to council and the public during last night’s meeting of town council, Fort Frances mayor Andrew Hallikas shared that he and deputy mayor Mike Behan were invited out to the Rainy River First Nations fish fry that took place on Friday, May 19, 2023, at their powwow grounds. Hallikas said both of them felt that in order to convey their thanks for the invites, they would in turn help out with the cooking beforehand.\n\n“We arrived shortly before noon and spent the next three-and-a-half-hours over a deep fryer cooking potatoes,” Hallikas said.\n\n“And I do have to say those potatoes were delicious. But what I really wanted to comment on was this was the 51st annual fish fry put on by Rainy River First Nations. Rainy River First Nations for 51 years gave been feeding friends and neighbours, and the feast was amazing. To me, one of the most generous things anyone can do is to share what they have with others, particularly their food. I’m so deeply grateful to Chief Horton and Council and all the members of Rainy River First Nations for their generous and gracious gesture of friendship to their friends and neighbours. What an example they’re setting for all of us for the past 51 years.”\n\nJoin our Newsletter\n\n\n\n\nSIGN-UP\n\nWhile the mayor did not choose to read his entire report to council aloud, his written report also noted that he has been taking part in many meetings and other community events.\n\nThe mayor attended the Walk for Missing and Murdered Indigenous Women and Girls held in Rainy River First Nations on May 5, which he said had an impressive turnout as the group made its way from the band office to the powwow grounds.\n\nSenior Games\n\nIn other community events, the mayor also made a showing at some of the Ontario Senior Games that were held here throughout the month of May.\n\n“I was impressed with the number and variety of the games that the seniors could compete in,” Hallikas wrote.\n\n“For a modest entry fee, seniors could take part in any number of events. Winners, should they choose, can move up and represent Fort Frances at the All‐Ontario Senior Games. The games wound up with a banquet on Thursday evening. I would like to compliment and thank the organizers and volunteers for putting on a much needed, exciting, and excellent set of games. Our community has an aging demographic and programming and opportunities such as the senior games provide a much needed and healthy social opportunity for seniors.”\n\nThe mayor noted that he had attended regular meetings of Fort Frances Power Corporation (FFPC), Rainy River District Municipal Association (RRDMA) and Rainy River District Social Services Administration Board (RRDSSAB) since his last update.\n\nPower Corp\n\nAt the FFPC meeting, the mayor said they were given a presentation on transitioning from a local distribution company to a distribution system operator, as well as a detailed financial analysis on the benefits of hiring a billing and finance analyst for the organization.\n\nTourism\n\nThe RRDMA general meeting, held on May 17, was attended by the mayor along with councillors Mike Behan and Wendy Brunetta and featured two guest speakers with talks aimed at life in the region.\n\n“Gord Knowles from NOTA spoke of district and regional tourism,” Hallikas wrote.\n\n“Of note is the fact the NOTA will provide financial assistance. This could be used to leverage our MAT money. John Van Der Broek, a ministry biologist, spoke on Elk and Agricultural damage. Councillor Brunetta asked him about the deer problem in Fort Frances and he indicated that the ministry deer expert is in Thunder Bay and would be happy to weigh in on the problem if asked.”\n\nParamedics Week\n\nFinally, the mayor attended the monthly DSSAB meeting, where he said that among other matters, a presentation was given on understanding end of mortgage and changing regulations.\n\n“The Board reviewed policies on: Computer use, Email use, Internet Use, and Mobile Device use. The Board also reviewed a Naloxone Kit Policy. The Board received the results of its audit; a clean and unqualified report was given by the auditors. DSSAB will be celebrating Paramedics week from May 23 to May 25. The public is invited to visit the ambulance bases on various days for a barbecue. The Fort Frances Paramedic base will be hosting the public on May 26.”\n\nKen Kellar\n\nKen Kellar is a reporter who was born and raised in Fort Frances. After spending several years in various parts of the country for school and work, Ken returned home to join the Fort Frances Times in 2019. He has an Advanced Diploma in Print & Broadcast Journalism from Humber College in Toronto, Ontario, and has contributed to the Humber Etcetera, Humber Daily News and CityNews Toronto (formerly 680News).\n\nJoin our Newsletter\n\n\n\n\nSIGN-UP\n\nPosted in Daily Headlines, Local News\nSearch\nSearch\nPoll - May 15, 2024\nFort Frances town councillor David Kircher resigned amid controversy this week. Municipal Clerk Gabrielle Lecuyer will be bringing options to council to fill the vacant seat. How do you think Kircher should be replaced? *\nBy-election\nAppointment by council\nOther (write-in)\nVote\nNews\nLocal News\nLocal Sports\nDistrict News\nPhoto Gallery\n Features\nColumnists\nEditorials\nLetters\nObituaries\nBirths\nAround Town\nPodcast\n Jobs & Classifieds\nJobs & Tenders\nLocal Classifieds\nLocal Ads\nPublic Notices\nPlace a Classified\nAdvertise With Us\nBecome a Carrier!\n Special Sections\nNWOntario Tourist Map\nTV Listings\nWho’s Online\nRainy River Record\n100 years, 100 stories\nArchives\n About Us\nOur Story\nTimes Printing\nTimes Web Design\nWhere to Buy the Times\nCreating the Times\nPrivacy Policy\n Contact the Times\nAdvertise With Us\nSubmit a News Tip\nSubmit a Letter to the Editor\nCheers & Jeers\nBecome a Carrier!\nStaff Directory\nWhere to Find Us\nPost an Event\nJobs @ The Times\n Subscribe Today!\nDigital Subscriptions\nPrint Subscriptions\nDaily Headlines Newsletter\nSubscriber Login\nMy Profile\n Digital Editions\nCopyright 2024 Fort Frances Times Ltd. All rights reserved. | 116 First St. E. | Fort Frances, ON P9A 1K2 | (807) 274-5373 | (800) 465-8508 | ISSN 1911-3862\nx\n2\nPosts Remaining\nSubscribe today for full access\nCurrent subscriber? Login here"
    },
    {
        "URL": "https://www.ottawaxpress.ca/people-still-waiting-for-the-mmiwg-cases-to-be-looked-into-by-the-task-forc/",
        "Title": "People still waiting for the MMIWG cases to be looked into by the task forc : Ottawa Express",
        "Body Text": "Skip to content\nHomepage\nBest Online Casino Games\nPayments in Online Casinos\nBest of Ottawa\nPEOPLE STILL WAITING FOR THE MMIWG CASES TO BE LOOKED INTO BY THE TASK FORC\n\nThe MMIWG report said that a national team should look at “unresolved” cases, but that hasn’t happened yet\n\nVal Charlette wonders if an Indigenous-led task force would have thought her daughter’s death was strange if they had been called in to look into it.\n\nRelated Posts:\nA lawyer from Saskatchewan is glad that a group from Guatemala wants to help…\nSmall galleries showing MMIWG stories are an attempt to bring people together…\nMétis lawyer says that Manitoba's political parties aren't doing enough to check…\n\nAngela Lavallee wonders if a task force would have found out who killed her granddaughter when she was a baby.\n\nDestiny Paupanakis wonders if her sister’s death would have been looked into again as a murder instead of being ruled a suicide.\n\nThey won’t get a chance to find out. Not yet, anyway.\n\nThe truth about my daughter needed to be heard.– Val Charlette\n\nThat’s because the federal government hasn’t set up a national task force to look into all unsolved cases of missing and murdered Indigenous women and girls, even though this was one of the most important calls for justice in the MMIWG inquiry’s 2019 final report.\n\nAngela Lavallee says, “There’s almost this story… of ‘Don’t tell me how to do my job.’ That needs to stop.” “Police, policing, and medical examiners need to listen.”\n\nThe call for a national task force was one of 231 calls for justice in the National Inquiry into Missing and Murdered Indigenous Women and Girls’ final report, which came out in June 2019. The calls, which the report calls “legal imperatives,” are instructions that governments and institutions were told to follow to stop violence against Indigenous women, girls, and two-spirit people.\n\nThe inquiry report said that the national task force should “review and, if necessary, reinvestigate each case of all unresolved files of missing and murdered Indigenous women, girls, and 2SLGBTQQIA people from across Canada.”\n\nA CBC analysis shows, however, that it is one of more than half of the calls for justice that have not been started as of July 2023. The federal government says that to make it happen, it would need the support of many governments, police departments, and Indigenous leaders. \n\nSo far, that hasn’t been the case.\n\nIn a written statement to the CBC, a federal government spokesperson said, “The Government of Canada remains steadfast in its commitment to working closely with all partners on this critical, ongoing priority to address the root causes of violence against Indigenous women, girls, and 2SLGBTQI+ people, and to end the ongoing national crisis of MMIWG2S+.”\n\nFamilies of people who have died live with unsolved cases that might never be looked into again.\n\nIn 2015, Zaylynn Emerald Rain, Angela Lavallee’s granddaughter, died when she was only nine months old. Even though Lavallee thought that someone they knew had killed her, her worries were not taken seriously, she says.\n\n“There was never a full investigation. “Her death was ruled to have no clear cause,” Lavallee says. “I was called ‘paranoid’ grandmother.”\n\nNo one seems to care about us.– Destiny Paupanakis\n\nVal Charlette also has to deal with the pain of a case that hasn’t been solved. She thinks she knows what needs to be done to fix it.\n\nTristan Jobb’s body was found on a golf course in Creighton, Saskatchewan, in October 2022. The course was out of the way and a few kilometers from where Tristan was last seen. Her face was cut and bruised, and her hair was tangled and full of dirt. \n\nThe coroner’s office said there was nothing strange about her death. Charlette came to a different conclusion, though, when she took part in a traditional cultural ceremony.\n\n“At that ceremony, I was told that someone had given her a drug with a needle… They gave her too much medicine by accident, and they had to take her body somewhere. “And I know it’s not science,” says Charlette.\n\nThe justice system won’t accept her daughter’s truth, which is what she called it.\n\n“According to science, I have to see it to believe it. In our culture, it was important that my daughter’s truth be heard.”\n\nCharlette says that a national task force with Indigenous people on it would listen to that truth.\n\nCharlotte says, “They know how to look at a scene, they carry sacred bundles to be a part of it, and they can see things we can’t really see.” “So that the only thing local police would have to do is make sure the scene is safe.”\n\nDestiny Paupanakis says straight out that Call for Justice 9.9 hasn’t moved forward.\n\n“No one seems to care about us. There’s no justice,” she says.\n\nPaupanakis wonders if an Indigenous-led team of investigators would believe her suspicions that her sister Angel Blue Sky did not kill herself.\n\n“Like she always said, ‘I’d never kill myself, so if anything ever happens to me, just know that I didn’t kill myself,'” Paupanakis says.\n\nShe says that a justice system run by Indigenous people could stop investigations that are based on racism.\n\n“Justice would mean telling the truth and having our own police force,” he said.\n\nAnyone affected by the details of these cases can get help. If you need help, you can call Medicine Bear Counselling, Support, and Elder Services at 204-594-6500, ext. 102 or 104, in Winnipeg, or 1-888-953-5264 outside of Winnipeg.\n\nThe Missing and Murdered Indigenous Women and Girls Liaison Unit of Manitoba Keewatinowi Okimakanak can also help. They can be reached at 1-800-442-0488 or 204-677-1648.\n\n \n\nPREV\nNEXT\n\nWe covers local, national and international news and offers columns and commentary from a variety of sources.\n\nKnow More\nSince 2019, 14 whales and 1 dolphin have died at Marineland, according to documents from the ministry\nHow motion-activated cameras may reveal the secrets of a healthy herd of caribou in Manitob\nFan Expo Canada is back, and it’s more important than ever that it’s led by women\n2024 Ottawa Express"
    },
    {
        "URL": "https://www.tricitynews.com/national-news/city-should-permanently-close-landfill-where-women-were-found-first-nations-leader-6812226",
        "Title": "City should permanently close landfill where women were found: First Nations leader - Tri-City News",
        "Body Text": "Skip to content\nSupport Us Sign in or register for your free account  \nHomeNews\nOpinion\nArts & Life\nFeatures\nClassifieds\nObituaries\nConnect\nPublic Notices\n8.8888855 °C\nHOME NATIONAL NEWS\nCity should permanently close landfill where women were found: First Nations leader\nWINNIPEG — The leader of a First Nations advocacy group wants to see the Winnipeg landfill where the remains of two Indigenous women were found permanently shut down. \"I think given the circumstance, that it should be.\nBrittany Hobson, The Canadian Press\nApr 5, 2023 5:12 PM\n\t\n\t\n\t\n\t\n\t\n\t\nKirstin Witwicki, right, cousin of Morgan Harris, listens in as Cathy Merrick, Grand Chief of the Assembly of Manitoba Chiefs, speaks to media in Winnipeg, Manitoba, Friday, Feb. 10, 2023. Merrick would like to see the Winnipeg landfill where two women's remains have been found in less than a year permanently shut down. THE CANADIAN PRESS/John Woods\n\nWINNIPEG — The leader of a First Nations advocacy group wants to see the Winnipeg landfill where the remains of two Indigenous women were found permanently shut down.\n\n\"I think given the circumstance, that it should be. It's not an isolated issue,\" Grand Chief Cathy Merrick of the Assembly of Manitoba Chiefs said in a phone interview Wednesday.\n\n\"I know there are lots of (Indigenous women) that have been missing throughout time, and I'm pretty sure that some of those women are in the Brady landfill.\"\n\nThe Winnipeg homicide unit started an investigation after staff at the Brady Road landfill south of the city found the body of 33-year-old Linda Mary Beardy on Monday.\n\nThe cause and time of her death have not been released.\n\nThe landfill has been closed as police investigate. The city said contingency plans for garbage and recycling are in place.\n\nMerrick said the city should look at opening a new landfill that would include measures to help with police investigations when situations like this occur. \n\n\"I know it's not going to happen today, but that's something that they need to look at as well.\"\n\nThe assembly has called for the incorporation of new technologies at landfills, including screening and scanning of trucks with serial numbers, dates and times that coincide with the dumping of loads. It said landfills must also track routes and timelines.\n\n\"It's shameful. We have to come out looking in landfills for our women,\" Merrick said. \n\nGarbage collection vehicles are equipped with GPS devices that allow for the tracking of specific loads and where materials are being deposited within the landfill, the city said. Staff are also trained to report any suspicious materials to the police. \n\nThe City of Winnipeg said in a statement Wednesday night that it is not considering the permanent closure of the Brady Road landfill. It said it is the only municipally-owned and operated landfill in the capital region. It also noted it is the largest in the area.\n\n City Coun. Markus Chambers said the discoveries point to the \"upstream work\" the city needs to do to support Indigenous communities.\n\n\"They're ending up at landfills. They're not happening at landfills,\" Chambers said. \"We've got to be able to prevent them or find a way to mitigate against these occurrences happening where they're ending up in the landfill.\"\n\nChambers added there needs to be more support for women and girls who come to the city from Indigenous communities, including educating people about the challenges of living in an urban setting. \n\nBeardy was a mother and a member of Lake St. Martin First Nation but lived in Winnipeg at the time of her death. Merrick was told no one had heard from the young mother for about a week before her remains were found. \n\nPolice have said they do not believe her case is linked to the killing of Rebecca Contois, whose remains were found in the same landfill last year, or the killings of three other women.\n\nPolice have said they believe the remains of Morgan Harris and Marcedes Myran are in the privately run Prairie Green landfill north of Winnipeg, but their bodies have not been found.\n\nJeremy Skibicki has been charged with first-degree murder in the deaths of Contois, Harris and Myran — all First Nations women, as well as an unidentified woman Indigenous leaders have named Mashkode Bizhiki'ikwe, or Buffalo Woman. Police have also not located her remains.\n\nPrime Minister Justin Trudeau offered his condolences Wednesday to Beardy's family and the larger Indigenous community. He said the federal government needs to do more to end the epidemic of violence that Indigenous women and girls face.\n\nTrudeau said it's heartbreaking that discoveries like these continue to happen. \n\n\"My heart goes out to the community in Winnipeg and to the families of the woman who was … left in this way,\" Trudeau said.\n\n\"We will continue to be there with the community as it grieves, but we will also continue to be there to put an end to this unconscionable violence.\"\n\nThe prime minister added his Liberal government has made significant strides in countering gender-based violence, but there's more it could be doing. \n\nFederal NDP Leader Jagmeet Singh said the discovery highlights the need to implement the 231 calls for justice from the National Inquiry into Missing and Murdered Indigenous Women and Girls. \n\n\"Women are dying, lives are being taken and we have to take it seriously,\" Singh said. \n\nCrown-Indigenous Relations Minister Marc Miller has praised workers at the Brady landfill for their \"heightened vigilance\" in finding Beardy's remains. \n\nMiller also said a study into the feasibility of searching the Prairie Green landfill for the remains of Harris and Myran should be completed in the coming weeks. The federal government put up $500,000 in February for the study.\n\nAn Indigenous-led committee headed by the Assembly of Manitoba Chiefs said it is confident the study will \"deem these search and recovery efforts feasible.\"\n\nThis report by The Canadian Press was first published April 5, 2023.\n\n— With files from Steve Lambert in Winnipeg and Mickey Djuric in Ottawa\n\nBrittany Hobson, The Canadian Press\n\nGet your daily Coquitlam news briefing\nEmail\nSign Up\nHave a story idea?\nLetter to the editor\nReport a mistake\nMore National News\n\tSystem failing growing number of seniors who are homeless, need more support: report\n\t'Happy tears' of victim's sister after prison attack on serial killer Robert Pickton\n\tTrudeau making 'Team Canada' charm offensive in visit to Philadelphia\n\nCOMMUNITY POLL\nParticipate in our next community poll.\nWhat is your go-to mode of transportation around the Tri-Cities?\nview related story\n Bus\n SkyTrain\n Bicycle\n Personal vehicle\n Scooter\n Rollerblades\n Hoverboard\n I prefer to walk.\n Other (comment below)\n\nVote Results > Archives >\n\nTRENDING TODAY\n351\t\nPhotos: Colour and music fills Coquitlam's Town Centre Park \n\n348\t\nThis cookie sensation that's conquering North America is coming to Port Coquitlam\n\n186\t\nHe wanted to write about parenthood. Port Moody won his heart \n\n158\t\nHere's why I check my bag on a flight, even though it complicates my trip\n\n119\t\nGreat Blue Heron returns to the wild after rehabilitation\n  \nNews\nLocal News\nOpioid Crisis\nCOVID-19\nIn the Community\nBC News\nNational News\nIndigenous News\nWorld News\nReal Estate\nBusiness Wire\nLocal Sports\nNational Sports\nCannabis News\nAnimal Stories\nDigital Edition\nOpinion\nOpinion\nSend us a letter\nArts & Life\nLocal Arts\nLiving\nPhotos and Videos\nAutomotive\nConsumer Technology\nHealth\nFood\nThe Mix\nEvents Calendar\nMore Lifestyles\nFeatures\nWeatherhood\nMothers Day Giveaways\nDriving\nGas Prices\nGuidedBy\nSpecial Print Features\nLocal Pros\nSponsored Content\nSpotlight\nClassifieds\nView Classified Ads\nPlace a Classified Ad\nObituaries\nView Obituaries\nPlace an Obituary\nConnect\nContact Us\nDaily Headlines Email\nSupport Local News\nPublic Notices\nCoquitlam\nPort Coquitlam\nVillage of Belcarra\nAbout\nContact\nAbout\nAdvertise\nPrivacy Policy\nTerms and Conditions\nPolitical Ads Registry\nVisit our network of sites:\nBowen Island Undercurrent\nBurnaby Now\nBusiness in Vancouver\nCastanet\nCoast Reporter\nDelta Optimist\nLethbridge Herald\nMedicine Hat News\nMoose Jaw Today\nNew West Record\nNorth Shore News\nPique Newsmagazine\nPowell River Peak\nPrince George Citizen\nREW.ca\nRichmond News\nSaskToday.ca\nSquamish Chief\nThe Orca\nTimes Colonist\nTriCity News\nVancouver is Awesome\nWestern Investor\nAirdrie Today\nAlberta Prime Times\nCochrane Today\nLakeland Today\nMountain View Today\nOkotoks Today\nRocky Mountain Outlook\nSt. Albert Gazette\nTown and Country Today\n\n© 2024 Tri-City News"
    },
    {
        "URL": "https://vocm.com/2020/01/15/qalipu-mmiwg/",
        "Title": "Qalipu First Nation Designing Space to Honour Missing and Murdered Indigenous Women and Girls | VOCM",
        "Body Text": "Skip to Content\nON AIR NOW\n5:30 PM - 7:00 PM\nEvenings with Greg Smith\n \nSign In\nNEWS\nLocal News\nWeather\nQUESTION OF THE DAY\nSHOWS\nOn Air Schedule\nWeekdays on VOCM\nWeekends on VOCM\nCOMMUNITY\nEvents & Concerts\nSchool Information\nNetwork Stations\nLost & Found\nSubmit Your PSA\nMEMBERS\nCONTACT US\nAdvertise With Us\nStingray Media Solutions\nVOCM App\nVOCM Logos\nContest Rules and Regulations\nCAREERS\nLocal News\nQalipu First Nation Designing Space to Honour Missing and Murdered Indigenous Women and Girls\nJan 15, 2020 | 5:39 PM\n\nA space in Corner Brook is being designed to honour Missing and Murdered Indigenous Women and Girls.\n\nThe space outside the Qalipu First Nation office in Corner Brook on Church Street is going to be designed in hopes to offer healing and cultural principles.\n\nWith help from the Department of Women and Gender Equality and the City of Corner Brook, the project came together to bring cultural and ceremonial gatherings to one assigned space.\n\nThe design of the healing space will focus on incorporating elements of the medicine wheel.\n\nBand Chief Brendan Mitchell says they have received letters of support from surrounding towns to host public consultations on their project. The public consultation will take place on January 27 at 7 p.m. in the Qalipu Community Room.\n\nRecent Stories\nNLC Recalls Nütrl Tumblers Due to Manufacturing Defect\nThe Newfoundland and Labrador Liquo...\nRNC Issues 400+ Tickets During Road Safety Week\nRNC were out in full force over the...\n30 Years In: East Coast Trail Faces Maintenance Needs\nOne of the most popular hiking trai...\nWakeham Accepts Apology From PC Candidate Following Comments on Recruiting Health Care Workers\nThe leader of the PC Party has acce...\nEngagement Session Wednesday on City's Housing Strategy\nOne of the final opportunities to s...\nMost Read Stories (last 7 days)\nSIRT-NL Seeking Help Piecing Together Crash Involving RCMP SUV\nThe province's serious incident res...\nNLers at Blue Jays Game Catch Attention From Broadcasters\nA group of passionate Blue Jays fan...\nFuel Prices Down Province-Wide in Latest Adjustment by PUB\nPrices for all types of fuels are d...\nGrave Injustice: PCs Say Province Failing Family After Cemetery Crash\nThe MHA for Terra Nova says a griev...\nRCMP Issue Arrest Warrant for Wanted Red Harbour Man\nAn arrest warrant has been issued f...\nWEATHER\nMay 21 2024, 5:30 pm • St. John’s\n15°\nLOW 7°\nWED\n16°\nTHU\n7°\nFRI\n8°\nForecast\nVOCM Fuels Your Summer!\nWin Free Gas From North Atlantic!\nHow You Can Help The People Of Ukraine\nVOCM Fuels Your Summer!\nWin Free Gas From North Atlantic!\nSee Feature 0\nSee Feature 1\nCONCERTS & EVENTS\nMAY 15 - MAY 25\nAn American Hymnal\nThe Majestic Theatre, Duckworth Street, St. John's, NL, Canada\nJUN 28 - JUL 04\nHarbour Voices International Festival of Collective Voices\nSt. John's, NL, CA\nSee All Concerts & Events\nPrivacy PolicyTerms Of Service\n\nWe are a Stingray® radio station.\n\n© 2024 Stingray Group Inc. All rights reserved. STINGRAY® and the related logo are trademarks of Stingray Group in Canada, the United States of America and/or other territories.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
        "URL": "https://www.cloverdalereporter.com/news/prime-minister-calls-discovery-of-indigenous-woman-in-winnipeg-landfill-heartbreaking-2449571",
        "Title": "Prime minister calls discovery of Indigenous woman in Winnipeg landfill heartbreaking - Cloverdale Reporter",
        "Body Text": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\n10.7 °C\nHome News\nPrime minister calls discovery of Indigenous woman in Winnipeg landfill heartbreaking\nPolice do not believe case linked to woman whose remains were found in the same landfill last year\nThe Canadian Press\nApr 5, 2023 1:30 PM\n\t\n\t\n\t\n\t\n\t\n\t\nMarc Miller, Minister of Crown-Indigenous Relations, is during an announcement in Ottawa, Tuesday, Feb. 28, 2023. The federal minister responsible for Crown-Indigenous relations is praising workers at a Winnipeg landfill for their “heightened vigilance” after the remains of an Indigenous woman were discovered there on Monday. THE CANADIAN PRESS/Sean Kilpatrick\n\nPrime Minister Justin Trudeau says the federal government needs to do more to end the epidemic of violence that Indigenous women and girls face after police found the body of another Indigenous woman in a landfill this week.\n\nTrudeau says it’s heartbreaking that discoveries like these continue to happen.\n\nThe Winnipeg homicide unit says it started an investigation after staff at the Brady Road landfill south of the city found the body of 33-year-old Linda Mary Beardy on Monday.\n\nPolice say they do not believe the case is linked to the killing of Rebecca Contois, whose remains were found in the same landfill last year, or the killings of three other women.\n\nPolice have said they believe the remains of Morgan Harris and Marcedes Myran are in a different, privately run Prairie Green landfill north of Winnipeg, but they have not been found.\n\nThe prime minister says his Liberal government has made significant strides in countering gender-based violence, but there’s more it can be doing.\n\n“My heart goes out to the community in Winnipeg and to the families of the woman who was … left in this way,” Trudeau told reporters Wednesday.\n\n“We will continue to be there with the community as it grieves, but we will also continue to be there to put an end to this unconscionable violence.”\n\nFederal NDP Leader Jagmeet Singh said the discovery highlights the need to implement the 231 calls for justice from the National Inquiry into Missing and Murdered Indigenous Women and Girls.\n\n“Women are dying, lives are being taken and we have to take it seriously,” Singh said.\n\nThe federal Crown-Indigenous Relations minister has praised workers at the city-run Brady landfill for their “heightened vigilance” in finding Beardy’s remains.\n\nMarc Miller also said a study into the feasibility of searching the Prairie Green landfill for the remains of Harris and Myran should be completed in the coming weeks.\n\nThe federal government put up $500,000 in February for the study into a potential search landfill.\n\nAn Indigenous-led committee headed by the Assembly of Manitoba Chiefs said Tuesday the study is expected to be completed in four to six weeks. The organization added it is confident the study will “deem these search and recovery efforts feasible.”\n\nJeremy Skibicki has been charged with first-degree murder in the deaths of Contois, Harris and Myran — all First Nations women, as well as an unidentified woman Indigenous leaders have named Mashkode Bizhiki’ikwe, or Buffalo Woman. Police have also not located her remains.\n\nThe Brady landfill is to remain indefinitely closed. The city said contingency plans for garbage and recycling are in place, and workers are trying to maintain these services without disruption during the closure.\n\nREAD MORE: Winnipeg police defend decision to not search landfill for Indigenous women’s remains\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending in News\n\t\tHomicide detectives: What happened at Surrey house where 2 men were found dead?\n\t\tHuman rights complaint dismissed after B.C. customer allegedly told to ‘speak English’\n\t\tChilliwack man speaks up for seniors as mobile-home park eyed for redevelopment\n\t\tSuspect in B.C. triple murder case still sought by police, 27 years on\n\t\tEvacuated Kelowna apartment now deemed unsafe to enter\nFacebook Comments (0) \nJazz and Blues Festival returning to White Rock’s music scene\nBlack Press Media\nStrong wind could push intense wildfire into B.C.’s Fort Nelson today\nBlack Press Media\nCanadians Born 1944 - 1983 Could Get This Benefit\nSeniors Choice\n|\nSponsored\nBest SPC Software For Manufacturing In Mexico\nSPC Software\n|\nSponsored\nIf you have a mouse, you have to play this game.\nNo Installation, play for free.\nPlanet Capture\n|\nSponsored\nSurrey florist grows fundraiser for North Van shop destroyed by car\nBlack Press Media\nMother, daughter sued by Chilliwack society for misappropriating $1.4M\nBlack Press Media\nCapsule Filling Machine 2024 (See Prices)\nCapsule Filling Machine\n|\nSponsored\nSearch Now\nAir Compressors In Mexico Are Almost Being Given Away!\nAir Compressors\n|\nSponsored\nSearch Now\nEasy Screen Time Management for Kids\nParenting Made Easy\nQustudio\n|\nSponsored\nRead More\nSUNDAY MORNING AT RODEO: Pancake breakfast and Cowboy Church\nBlack Press Media\nCrosswalk improvements coming to three ‘key’ Delta intersections\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWill you be cheering for Edmonton Oilers, now Canada’s only team in the playoffs?\n Yes, go Oilers!\n No, never.\n I'm cheering for a different team.\n I'm not a hockey fan.\n\nVote Results > Archives >\n\nTODAY IN B.C.\nOrphan orca’s extended family spotted off northeast side of Vancouver Island\nSnowfall and hazardous driving forecast for B.C. Interior highways\n15-year ban for B.C. teacher caught kissing student on graduation night\nEvacuated Kelowna apartment now deemed unsafe to enter\nB.C.’s inflation rate remains higher than Canada’s, but relief on horizon\nMore from Today in B.C. >\n  \nCloverdale Reporter\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nSurrey Now Leader\nMaple Ridge-Pitt Meadows News\nPeace Arch News\nLangley Advance Times\nNorth Delta Reporter\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Cloverdale Reporter and Black Press Media Publications Contact"
    },
    {
        "URL": "https://www.cloverdalereporter.com/news/prime-minister-calls-discovery-of-indigenous-woman-in-winnipeg-landfill-heartbreaking-2449571",
        "Title": "Prime minister calls discovery of Indigenous woman in Winnipeg landfill heartbreaking - Cloverdale Reporter",
        "Body Text": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\n10.7 °C\nHome News\nPrime minister calls discovery of Indigenous woman in Winnipeg landfill heartbreaking\nPolice do not believe case linked to woman whose remains were found in the same landfill last year\nThe Canadian Press\nApr 5, 2023 1:30 PM\n\t\n\t\n\t\n\t\n\t\n\t\nMarc Miller, Minister of Crown-Indigenous Relations, is during an announcement in Ottawa, Tuesday, Feb. 28, 2023. The federal minister responsible for Crown-Indigenous relations is praising workers at a Winnipeg landfill for their “heightened vigilance” after the remains of an Indigenous woman were discovered there on Monday. THE CANADIAN PRESS/Sean Kilpatrick\n\nPrime Minister Justin Trudeau says the federal government needs to do more to end the epidemic of violence that Indigenous women and girls face after police found the body of another Indigenous woman in a landfill this week.\n\nTrudeau says it’s heartbreaking that discoveries like these continue to happen.\n\nThe Winnipeg homicide unit says it started an investigation after staff at the Brady Road landfill south of the city found the body of 33-year-old Linda Mary Beardy on Monday.\n\nPolice say they do not believe the case is linked to the killing of Rebecca Contois, whose remains were found in the same landfill last year, or the killings of three other women.\n\nPolice have said they believe the remains of Morgan Harris and Marcedes Myran are in a different, privately run Prairie Green landfill north of Winnipeg, but they have not been found.\n\nThe prime minister says his Liberal government has made significant strides in countering gender-based violence, but there’s more it can be doing.\n\n“My heart goes out to the community in Winnipeg and to the families of the woman who was … left in this way,” Trudeau told reporters Wednesday.\n\n“We will continue to be there with the community as it grieves, but we will also continue to be there to put an end to this unconscionable violence.”\n\nFederal NDP Leader Jagmeet Singh said the discovery highlights the need to implement the 231 calls for justice from the National Inquiry into Missing and Murdered Indigenous Women and Girls.\n\n“Women are dying, lives are being taken and we have to take it seriously,” Singh said.\n\nThe federal Crown-Indigenous Relations minister has praised workers at the city-run Brady landfill for their “heightened vigilance” in finding Beardy’s remains.\n\nMarc Miller also said a study into the feasibility of searching the Prairie Green landfill for the remains of Harris and Myran should be completed in the coming weeks.\n\nThe federal government put up $500,000 in February for the study into a potential search landfill.\n\nAn Indigenous-led committee headed by the Assembly of Manitoba Chiefs said Tuesday the study is expected to be completed in four to six weeks. The organization added it is confident the study will “deem these search and recovery efforts feasible.”\n\nJeremy Skibicki has been charged with first-degree murder in the deaths of Contois, Harris and Myran — all First Nations women, as well as an unidentified woman Indigenous leaders have named Mashkode Bizhiki’ikwe, or Buffalo Woman. Police have also not located her remains.\n\nThe Brady landfill is to remain indefinitely closed. The city said contingency plans for garbage and recycling are in place, and workers are trying to maintain these services without disruption during the closure.\n\nREAD MORE: Winnipeg police defend decision to not search landfill for Indigenous women’s remains\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending in News\n\t\tHomicide detectives: What happened at Surrey house where 2 men were found dead?\n\t\tHuman rights complaint dismissed after B.C. customer allegedly told to ‘speak English’\n\t\tChilliwack man speaks up for seniors as mobile-home park eyed for redevelopment\n\t\tSuspect in B.C. triple murder case still sought by police, 27 years on\n\t\tEvacuated Kelowna apartment now deemed unsafe to enter\nFacebook Comments (0) \nB.C. wildfire project tells communities how to protect and prepare\nBlack Press Media\nSurrey council eyeing another $10M contract to further improve 80 Avenue\nBlack Press Media\nCanadians Born 1944 - 1983 Could Get This Benefit\nSeniors Choice\n|\nSponsored\nIf you have a mouse, you have to play this game.\nNo Installation, play for free.\nPlanet Capture\n|\nSponsored\nPlay this game for 1 minute and see why everyone is addicted.\nIf you have a mouse, you will never turn off your PC again. Play for free. No Installation.\nNavy Quest Game\n|\nSponsored\nPHOTOS: With love, kids make Mother’s Day shortbread at Surrey kitchen class\nBlack Press Media\nUPDATE: Bear Creek wildfire north of Harrison ‘being held’ at 8.2 hectares\nBlack Press Media\nGoodbye Cell Phone, Hello VoIP (Find Out Why Many Are Switching To VoIP)\nVoip | Search Ad\n|\nSponsored\nSearch Now\nWe believe every sport should be Epic\nBet365 - Join Now\nBet365\n|\nSponsored\nPlay Now\nEasy Screen Time Management for Kids\nParenting Made Easy\nQustudio\n|\nSponsored\nRead More\nSurrey wants to use sewers to make heat\nBlack Press Media\nWhen a badminton player collapsed, 3 Surrey lifeguards helped save his life\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWill you be cheering for Edmonton Oilers, now Canada’s only team in the playoffs?\n Yes, go Oilers!\n No, never.\n I'm cheering for a different team.\n I'm not a hockey fan.\n\nVote Results > Archives >\n\nTODAY IN B.C.\nOrphan orca’s extended family spotted off northeast side of Vancouver Island\nSnowfall and hazardous driving forecast for B.C. Interior highways\n15-year ban for B.C. teacher caught kissing student on graduation night\nEvacuated Kelowna apartment now deemed unsafe to enter\nB.C.’s inflation rate remains higher than Canada’s, but relief on horizon\nMore from Today in B.C. >\n  \nCloverdale Reporter\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nSurrey Now Leader\nMaple Ridge-Pitt Meadows News\nPeace Arch News\nLangley Advance Times\nNorth Delta Reporter\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Cloverdale Reporter and Black Press Media Publications Contact"
    },
    {
        "URL": "https://www.kulr8.com/news/rescue-k--s-and-suspicious-vehicle-now-involved-in/article_b966064a-30d7-11ea-9b2f-9f53298b275a.html",
        "Title": "Rescue K-9s and suspicious vehicle now involved in search for missing teen | Billings News | kulr8.com",
        "Body Text": "Skip to main content\nWelcome, Guest\nSign UpLog In\nHome\nWatch\nNews\nWeather\nElections\nSWX Sports\nFeatures\nContests\nBest of Montana\nCalendar\nReport It\nAbout Us\nSite search\nSearch\nMENU\n60°\nNEWS\nWEATHER\nSWX SPORTS\nWHAT'S ON TV\nWEATHER ALERT\nRain and heavy mountain snow on the way in Montana and Wyoming\n PREV\nPrevious\nPREVIOUS\n\t\nYellowstone Valley Animal Shelter needs people to adopt pets\n\nBILLINGS, Mont. - Have you ever dreamed on fostering a pet o…\n\n NEXT\nNext Up\nNEXT UP\n\t\nStudy warns nightmares may be early sign of potentially dead…\n\nAn increase in nightmares and hallucinations – or ‘daymares’…\n\nRescue K-9s and suspicious vehicle now involved in search for missing teen\nAudrey Mayer Jan 6, 2020 \nFacebook\nTwitter\nEmail\n\nMultiple people have come forward saying they saw a suspicious green station wagon with older-style Wyoming plates at the rest stop the day of Selina's disappearance.\n\nFacebook\nTwitter\nEmail\nPrint\nCopy article link\nSave\n\nBIG HORN COUNTY, Mont. -- Monday, January 6th is the sixth day of searching for missing teen, Selina Shelley Faye Not Afraid.  The 16-year-old Native American female was last seen at a closed rest stop in between Billings and Hardin on New Year's Day.  The FBI, Crow Tribe Agency, Northern Cheyenne, Yellowstone County Sheriff's Office, Billings Police Department, Sheridan County, and the Missing and Murdered Indigenous Women's Task Force are all involved in the search. \n\nSelina's relatives say a girl that was in the car with Selina that afternoon was found a few miles away in a ditch with scrapes on her bare feet.\n\n\"We're doing follow-up interviews again with the individuals that were in the vehicle with her,\" say Big Horn County Sheriff Lawrence Big Hair, \"some of the people that were at the house at the party that night...  And detectives are going to canvas that whole area at that address in Billings.\"\n\nSheriff Big Hair says they do have a vehicle in question.  Multiple people have come forward saying they saw a suspicious green station wagon with older-style Wyoming plates at the rest stop the day of Selina's disappearance.\n\n\"So we're following up on that, that's what we're searching for.  That vehicle,\" he says.\n\nSheriff Big Hair also says a private agency from North Dakota is bringing in certified search and rescue K-9s to assist.  He says the search has expanded all the way to the Wyoming state line.\n\nMore from this section\nFirst Responders receive support from Laurel EMS Mill Levy\nMagic City Jet Rally returns to Billings this weekend\nYellowstone Valley Animal Shelter needs people to adopt pets\nAround the Web\nCanadians Born 1944-1984 Could Be Eligible for This Benefit\nDollarGuardian\nEdmonton's Method Will Rid Your Body of Parasites Forever!\nParasiteRelief\nWrinkles on the Neck? Try \"Filling In\" Wrinkles With This Household Item\nNeotonics\n1 Simple Trick Removes Wrinkles in Seconds!\ninfomedsolution\nAnyone With High Cholesterol Should Watch This (Big Pharma Companies Hate This!)\nThe Daily Survivor\nDoctors Stunned: One Simple Move Ends Years of Arthritis Pain!\nHealthier Living Tips\n15 Foods You Should Never Eat for Breakfast\nHealth Natural\nHave an Enlarged Prostate? Urologist Reveals: Do This Immediately (Watch)\nHealthier Living Tips\n1/2 Cup of This (Before Bed) Melts Your Belly Fat Like Never Before!\nHealth News\nFacebook\nTwitter\nEmail\nPrint\nCopy article link\nSave\nTags\nVehicle Big Hair Sheriff Police Transports Motor Vehicle Selina Shelley Faye Rescue K-9s Lawrence Big Horn County\nAudrey Mayer\n\nKULR-8 Reporter\n\n Follow Audrey Mayer\nLocal Weather\n\nCurrently in Billings\n\n60° \nMostly Cloudy\n60° / 41°\n3 PM\n62°\n4 PM\n62°\n5 PM\n61°\n6 PM\n61°\n7 PM\n61°\nMost Popular\n ARTICLES\nA small plane crashes in Montana, killing the pilot and a passenger\nBig Horn Co. Sheriffs looking for missing 40-year-old man\nBillings police investigating crash between pedestrian and car Saturday night\nBillings man shot by 82-year-old man Monday morning\nPrimrose Court assisted living home shuts down\nWoman dies in head-on crash in Billings Friday\nAlive After 5 is back for 2024 concert series and looking for volunteers\nMinor traffic delays to be expected on North 27th Street in Billings 4-5 p.m.\nRain and heavy mountain snow seen through Tuesday\nMDT holds Open House to provide updates on Billings Bypass Project\nSign Up For Newsletters\nBreaking News from Nonstop Local Billings\n\nGet breaking news in your email inbox as soon as it happens.\n\nLocal Sports from NonStop Local SWX Billings\n\nGet the latest headlines on local sports! From UM, MSU, High School sports and more.\n\nNonStop Local Daily Briefing\n\nWould you like to receive daily news updates from NonStop Local Billings? Sign up today!\n\n\t\nSign up\nManage your lists\nMore Video From This Section\nYellowstone Valley Animal Shelter is looking for foster parents\nUpdated 2 hrs ago\nNightmares and daydreams could be links to serious health concerns\nUpdated 2 hrs ago\nMan shoots neighbor following clash in Billings\n7 hrs ago\nCrews clean up rims in Billings\n7 hrs ago\nRibbon cutting for artwork along Billings' first neighborhood bikeway\n15 hrs ago\nMagic City Jet Rally returns to Billings\nUpdated 3 hrs ago\nWoman wins Gold Star Award for May 2024\nUpdated 3 hrs ago\nFirst Responders receive support from Laurel EMS Mill Levy\nMay 20, 2024\nLoad more\nAlso of Interest\nNative American NewsNational SportsCollege Sports\n\nKULR8.com\n2045 Overland Ave\nBillings, MT 59102 \nPhone: (406) 656-8000\nFax: (406) 655-2687\nEmail: news@kulr.com\n\nFacebook\n \nTwitter\n \nInstagram\n \nEmail\n \nLive stream\nSections\nHome\nNewsElectionsSportsWatch LiveConnectionsOnline Features\nServices\nAdvertiseCalendarEmail AlertsSearchWeatherEEO ReportsFCC Public FileNewsroom EthicsCareers at NonStop Local\n© Copyright 2024 NonStop Local Billings 2045 Overland Ave, Billings, MT  | Terms of Use  | Privacy Policy\nPowered by BLOX Content Management System from BLOX Digital."
    },
    {
        "URL": "https://www.boisestatepublicradio.org/news/2023-08-22/canadian-protestors-call-for-search-for-missing-indigenous-women",
        "Title": "Canadian protestors call for search for missing Indigenous women | Boise State Public Radio",
        "Body Text": "NPR in Idaho\nShow Search\nSearch Query\nDonate\nBSPR News On-Air\nFresh Air\nNEXT UP:\n3:00 PM\nAll Things Considered\nFresh Air\nBSPR News On-Air\nAll Streams\nNEWS\nMUSIC\nPODCASTS\nSHOWS\nCONNECT\nNEWSLETTERS\nSUPPORT\nCOMMUNITY CALENDAR\nSCHEDULES\nKLCZ in Lewiston experiencing intermittent outages due to electrical work\nNews\nMountain West News Bureau\nA regional collaboration of public media stations that serve the Rocky Mountain States of Colorado, Idaho, Nevada, New Mexico, Utah and Wyoming.\nCanadian protestors call for search for missing Indigenous women\nNational Native News | By Antonia Gonzales\nPublished August 22, 2023 at 2:59 PM MDT\nFacebook\nTwitter\nLinkedIn\nEmail\nAntonia Gonzales\n/\nNational Native News\n\nWINNIPEG, Manitoba – Next to the Canadian Museum For Human Rights is a small encampment with a handful of tents and a camp kitchen. Signs are posted all around – some read “we are not garbage” and “search the landfills.”\n\nIt’s an effort by Indigenous people to raise concerns and call on officials to search landfills for their missing and murdered relatives. Among the women they want found and brought home are Morgan Harris, 39, and Marcedes Myran, 26.\n\nPolice believe the women are victims of an alleged serial killer and that their remains could be in a landfill. Two camps have been set up to keep pressure on officials and draw awareness to Missing and Murdered Indigenous Women and Girls, Two Spirit, and Gender-Diverse People.\n\nThe issue of missing and murdered people is important to tribal communities on both sides of the U.S.-Canada border. It has been the topic of news reports, podcasts, documentaries – and protests.\n\nOn a recent morning, Shining Gold Star spoke about Camp Marcedes, named after Myran. He’s been there since the camp was set up in July.\n\n“It’s to honor the missing and murdered, especially the landfill, its focus is on: Search the landfill,” Gold Star said.\n\nRed handprints are drawn on sidewalks and benches along walking paths near a river and park. A number of empty red dresses also are displayed, symbolizing the missing and murdered.\n\nAntonia Gonzales\n/\nNational Native News\n\nMore than 30 minutes away is the city-operated Brady landfill, where distress flags fly at Camp Morgan, named after Harris.\n\nRed dresses are positioned around another camp with tents, a wigwam and teepees. Some protestors say they’ve been in the area since December. Others, like Ida Manuelof British Columbia, felt compelled to come this summer.\n\n“My heart, going out to the families affected and I just had to answer that call. … How could you be human any other way,” Manuel said.\n\nRemains of Rebecca Contois, 24, were found at the Brady landfill last year.\n\nA blockade at the road leading up to the landfill had been set up, but was dismantled. Now, dumping continues.\n\nAntonia Gonzales\n/\nNational Native News\n\n“For us to stand and say we are not trash and still not be heard. You know, it really needs to be connected – Canada’s lack of respect … with [what] colonialism set out to do to Indigenous [people],” Manuel said.\n\nAnother landfill, Prairie Green, is privately operated outside Winnipeg. The Manitoba government cites costs, as well as health and safety concerns, for not conducting a search at the landfill for Harris and Myran.\n\nAdvocates say they’re prepared to camp through the winter. They also hope new provincial leadership will be elected this fall to offer assistance.\n\nLast year, Jeremy Skibicki was charged for the murder of the three women and a fourth unidentified woman.\n\nTags\nNews Missing and Murdered Indigenous WomenIndigenousMWNB\nFacebook\nTwitter\nLinkedIn\nEmail\nThe Latest From Boise State Public Radio\nWildfire weather, fueled by climate change, is increasing across the Mountain West, study finds\n53 minutes ago\nA new poll says young Latino voters could be a force in the 2024 election\n1 hour ago\nSix Idaho dairy farms have the avian flu. Here’s what you need to know\n22 hours ago\nYou make stories like this possible.\n\nThe biggest portion of Boise State Public Radio's funding comes from readers like you who value fact-based journalism and trustworthy information.\n\nYour donation today helps make our local reporting free for our entire community.\n\n Donate\nStay Connected\ninstagram\nyoutube\nfacebook\nlinkedin\n© 2024 Boise State Public Radio\nAbout Boise State Public Radio\n \nHistory\n \nOur Team\n \nCommunity Advisory Board\n \nCommunity Representation Statement\n \nContact Us\n \nEmployment Opportunities\n \nTerms of Use\n \nRegulatory Information\n \nRadio Frequencies & Coverage Maps\n \nA Community Service of Boise State University"
    },
    {
        "URL": "https://steinbachonline.com/articles/manitoba-ups-funding-for-missing-persons-response",
        "Title": "Manitoba ups funding for missing persons response - SteinbachOnline.com - Local news, Weather, Sports, Free Classifieds and Job Listings for Steinbach, Manitoba",
        "Body Text": "17°\nDOWNLOAD THE APP\nADVERTISE WITH US\nSUBMIT NEWS\nNEWS\nLocal Sports\nAg News\nFuneral Announcements\nCommunity\nNational News\nSponsored\nLocal News\nWeather\nWeather Radar\nLISTEN\nFEATURES\nEvents\nLocalJobShop\nHelloGoodBuy Classifieds\nGarage Sales\nAM1250 Program Guide\nLive Webcam\nRoad Reports and Cancellations\nCONTESTS\nShow Us Your Summer\nMIX 96 Contests\nCountry 107 Contests\nFeel Good Fridays\nCONNECT\nContact Us\nSubmit News\nMeet the Team\nApp\nFacebook\nInstagram\nX\nYouTube\nStreaming\nRSS\nAdvertise With Us\nCareers\nContest Rules\nAccessibility Feedback\nAccessibility Plan\nTerms Of Use Agreement\nPrivacy Policy\nJournalistic Standards\n17°\nNEWS\nWEATHER\nEVENTS\n LISTEN\nCity Summer Day Camps – Still Time to Register!\n\n6 great camp options to choose from for kids age 6-12. Click for Details\n\nNext\nLOCAL NEWS\nManitoba ups funding for missing persons response\nWritten by Shannon Dueck Tuesday, Jul 18 2023, 2:51 PM\nShare:\nCopied!\nSteinbach MLA and Justice Minister Kelvin Goertzen\nArticle continues below advertisement ↴\n\nThe Manitoba government is increasing its investment in dedicated police resources for the Manitoba Integrated Missing Persons Response.\n\nManitoba Justice Minister and Steinbach MLA Kelvin Goertzen announced Tuesday an additional $3.1 million. The $5.2 million commitment will prioritize the well-being of chronic missing people and provide a coordinated inter-agency response across Manitoba.\n\n\"The safety of Manitobans is our top priority, and this increased investment demonstrates our commitment to addressing the issue of missing people in our province,\" says Goertzen. \"By strengthening our police services and enhancing inter-agency collaboration, we aim to leverage all our collective strengths against the threat of violence and improve public safety in Manitoba.\"\n\nThe Manitoba Integrated Missing Persons Response was announced in March with an initial $2.1 million commitment from the Violent Crime Strategy. The $3.1 million in new funding will support the operational plan established by Winnipeg Police Service (WPS) and the RCMP, providing a consistent and streamlined reporting, tracking and investigation approach to missing people from rural communities, municipalities and First Nations across the province.\n\nThe Integrated Missing Persons Response aligns directly with several recommendations outlined in the final report of the National Inquiry into Missing and Murdered Indigenous Women and Girls. The need for better-supported, community-based first response and more responsive, transparent and accountable policing are central elements addressed by this initiative.\n\n\"The Manitoba First Nations Police Service embraces this opportunity to work together with the RCMP, WPS and other agencies on this most critical issue. Anytime there is a person missing, whose whereabouts are unknown, there is a concern for their safety and well-being,\" says Chief Doug Palson, Manitoba First Nations Police Service. \"Regardless of the reason for the disappearance, the trauma experienced by family and friends can be tremendous. The draft protocol for missing persons investigations represents a commitment to cooperation between police services to reduce jurisdictional barriers and promote timely and community-responsive approaches, keeping families involved, and treated with compassion and respect.\"\n\nThe Integrated Missing Persons Response unit will provide a consistent intake process for missing person reports across the province and prioritize investigations into suspicious missing persons cases.\n\nRecent statistics provided by the Government of Canada's Missing Persons Fast Fact Sheet highlight the urgency of this issue. In 2021 alone, there were 2,124 missing adults in Manitoba, with 37 per cent classified as runaways or chronic missing people. Manitoba had the second-highest number of missing adults per capita, with 152 reports per 100,000 people, trailing only British Columbia. Additionally, 5,390 missing children were reported in Manitoba in 2021, with 63 per cent of them being runaway girls. Manitoba also had the highest number of missing children per capita, with 375 reports per 100,000 people.\n\nThe minister notes the anticipated outcomes of this increased investment include a decreased number of missing people, timely and adequate investigations of suspicious missing person cases, an increased number of referrals for chronic missing youth/adults to well-being-centred supports and programs, and a decreased demand on police resources to respond to chronic missing person's reports.\n\nGoertzen says the Manitoba government remains committed to providing significant support to police services to collectively address missing people in Manitoba through targeted investments in supporting expanded police resources.\n\nChief Doug Palson (Manitoba First Nations Police Service), Insp. Tim Arsenault (Major Crimes Services, Manitoba RCMP), Chief Danny Smyth (Winnipeg Police Service), Justice Minister Kelvin Goertzen, Insp. Paul Peddle (Central Plains RCMP), Portage la Prairie Mayor Sharilyn Knox, MLA for Portage Ian Wishart\n\n \n\nRELATED STORIES\nManitoba government announces new unit for managing missing persons reports\nNEXT STORY\n \nStill Speaking Episode 10 - Hair Wreath\nLATEST IN LOCAL NEWS\nCity of Steinbach discusses densification while drafting Official Community Plan\nGas prices climb in Steinbach\nCountry and Rock headliners announced for Summer in the City\nTravelling during spring break? What you need to know\nLATEST STORIES ON STEINBACHONLINE\nJob seekers can meet employers at job fair in Steinbach\nSave your sanity and money on supper with the Steinbach Online Auction\nSimon's class wrote a funny book about winning Classroom Of The Month\nSports Update - Wednesday, March 20th\nEvents\nMini Creators\nTue, May 21, 5:00 PM\nGrief Seminar - Miscarriage & Stillborn\nTue, May 21, 7:00 PM\nMitchell Ball Hockey\nTue, May 21, 7:00 PM\nAlcoholics Anonymous, Auto City AA Group\nTue, May 21, 8:00 PM\nAdult Basketball\nTue, May 21, 8:15 PM\nView more \nJobs\nPowered by\nTruck or Trailer Mechanic - Evening Shift Supervisor\nFull-time, Permanent, Skilled Trades\nFeatured\n24-039 Term Middle & Senior Years Teacher for Ridgeville Colony School\nPart-time, Salary, Term, Education\nPhysiotherapist - Join our team of health care providers working in our unique multidisciplinary clinic in southeast Manitoba. Build your caseload fast with the growing demand of our clinic and guaranteed weekly assessments. Stop in to say hi, we promise once you step in our doors you will want to be part of our team!\nFull-time, Healthcare\nEmployment Facilitator (Full-time/Permanent)\nFull-time, Permanent, Administrative, Communications/Media, Education, Entry-Level, Finance, Healthcare, Hospitality, Human Resources, Professionals, Retail, Sales, Skilled Trades, Technology, Transport\nJob Coach (Summer Term)\nFull-time, Seasonal, Term, Education, Entry-Level, Healthcare, Hospitality, Human Resources, Professionals, Retail, Transport\nView more \nBuy & Sell\nPowered by\n98 Breezy Bend, Steinbach\n$599900\nFeatured\n2018 GMC Sierra 3500 SLE Deck Truck Duramax Diesel\n$0\nFeatured\nAffordable Attached Home in Blumenort!\n$249900\nStud service\n$1234\n2013 Toyota Highlander\n$23995\nView more \nAM 1250\nMIX 96\nCountry 107\nPodcasts\nGet the App\nNEWS\nLocal Sports\nAg News\nFuneral Announcements\nCommunity\nNational News\nSponsored\nLocal News\nWeather\nFEATURES\nEvents\nLocalJobShop\nHelloGoodBuy Classifieds\nGarage Sales\nAM1250 Program Guide\nLive Webcam\nRoad Reports and Cancellations\nCONTESTS\nShow Us Your Summer\nMIX 96 Contests\nCountry 107 Contests\nFeel Good Fridays\nCONNECT\nContact Us\nSubmit News\nMeet the Team\nFacebook\nInstagram\nX\nYouTube\nStreaming\nRSS\nAdvertise With Us\nCareers\nContest Rules\nAccessibility Feedback\nAccessibility Plan\nTerms Of Use Agreement\nPrivacy Policy\nJournalistic Standards"
    },
    {
        "URL": "https://www.dailymirror.lk/breaking_news/Canada-has-no-right-here-NPF/108-264124",
        "Title": "Canada has no right here – NPF - Breaking News | Daily Mirror",
        "Body Text": "Last Updated : 2024-05-21 23:24:00\n\nApps\nAdvertising\nHome Delivery\nWNL Home\nFeedback\nE-paper\nLogin\nSubscribe\n\n\nMENU\n\nWed, 22 May 2024 Today's Paper\n\n     \nHOME BREAKING NEWS CANADA HAS NO RIGHT HERE – NPF\nCanada has no right here – NPF\n\n28 July 2023 01:02 pm\n - 12      - 2786\n\nA A A\n\nCanada which was declared guilty of genocide four years ago in the National Inquiry into Missing and Murdered Indigenous Women and Girls has no right to call Sri Lanka’s war incidents as genocide, the New People’s Front (NPF) has said in a letter handed over to Canadian High Commission on Wednesday.\n\n“Even the UN has ruled out the war here as being one aimed at genocide” the NPF has said in the letter addressed to Canadian High Commissioner in Colombo, Eric Walsh.\n\nReminding the Indian accusation that Canada is hosting Khalistan rebels, the NPF alleged that Canada of promoting separatism in both India and Sri Lanka. The party also criticized the Canadian high commissioner’s recent interventions in the internal affairs of Sri Lanka and stated in the letter that it wondered whether High Commissioner Walsh intended to contest Sri Lanka’s presidential election due next year.\n\nThis is a modal window.\n\nNo compatible source was found for this media.\n  Comments - 12\n\nRuwan Friday, 28 July 2023 01:16 PM\n\nWell quite nornal and to be expected of the NPF a good for nothing bunch of guys.\n\nReply\n\nMartin Friday, 28 July 2023 01:28 PM\n\nWell, RW didn’t fully solved the debt crisis yet. Country is just going on by not paying the interest on debt and so one day people will be back on street again when the creditors squeeze us for their capital or interest or for both.\n\nReply\n\nSri Lankan in Canada Friday, 28 July 2023 01:44 PM\n\nYou NPF, your letter would have gone into the Canadian dustbin.\n\nReply\n\nDiabolical Friday, 28 July 2023 02:13 PM\n\nWell said, genocide of aboriginals\n\nReply\n\nPunchi Friday, 28 July 2023 02:40 PM\n\nThe NPF view is a reflection of poor thinking. The Canadians have conceded there was some sort of inaction with reference to missing indigenous people but the Canadian government didn’t orchestrate or participate in actioning the disappearance. There may have been neglect in applying resources to investigate. Whereas in our paradise all sections of the majoritarian people including government, security establishment and peoples participated in negative actions against our fellow citizens. Also it is immaterial the NPP perspective on this. The Canadians can do more harm to us in international forums etc than we can do to them.\n\nReply\n\nKumara Friday, 28 July 2023 02:45 PM\n\nBut Sri Lanka was not declared guilty or no guilty yet! So we need creditable international independent investigation to clear naming a country as Guilty. So allow and protest for it. No point in pointing a finger at others, clear your name first!\n\nReply\n\nFirst of all, how can you say this is your country? Friday, 28 July 2023 02:58 PM\n\nWe talk for our SELF. We don't care for world opinion. Our(we) people think that we are correct\n\nReply\n\nMandayan Friday, 28 July 2023 04:08 PM\n\nThen we should ask Canada to send back all Lankan diaspora!!\n\nReply\n\nRavi Friday, 28 July 2023 05:02 PM\n\nIt is the VOTE, stupid! Why do you think Gary is now a cabinet minister? Politics is politics!!\n\nReply\n\nOpen eyes Friday, 28 July 2023 06:02 PM\n\n@Ravi,then don't blame Rajapakshas!\n\nReply\n\nRP Friday, 28 July 2023 10:18 PM\n\nWell, NPF should change it's name to Non-potent force. Had NPF raised valiant points, then the embassy would have forwarded the letter to the appropriate Canadian government agency. They are accusing Canada of promoting separatism and questioning whether the high Commissioner intend to run in the Presidential elections? In my opinion, the letter would have been ripped prior to NPF left the Canadian H.C's gate. Also, readers still commenting negatively about Gary Anandasangaree. Obviously, not aware of his accomplishments and his service to his constituents. Just Google his name or check him in Linked-in to find out his credentials and awards. Cheers!\n\nReply\n\nJeanne Saturday, 29 July 2023 07:42 AM\n\nThe difference is: Canada acknowledged their wrongdoing and was declared guilty of genocide. And that was the end of that. And they have moved on and are making amends by changing their laws etc. Sri Lanka on the other hand are in a 40-year state of shameful denial and justification of their shocking atrocities. So, let's change NPF's call to: Canada has EVERY right here.\n\nReply\n\nAdd comment\nComments will be edited (grammar, spelling and slang) and authorized at the discretion of Daily Mirror online. The website also has the right not to publish selected comments.\nPost a new comment :\nFull Name:\nEmail Address:\nSend\nVIEW MORE COMMENTS\nRECOMMENDED\nProposed wage hike Estate workers appreciated or trapped in election promise?\n‘Spike in blast fishing’ poses renewed threats to Sri Lanka’s marine ecosystems\nUDA owned land in Thalawathugoda; UDA Minister Prasanna Ranatunga under the spotlight for forceful occupation of reserved land\nLoss-making SMIB faces political pressure in recovering loans\n\nThe state-run loss-making State Mortgage & Investment Bank (SMIB) has reveale\n\nBaltimore Bridge Collapse: MV Dali, SL authorities anchored in mystery?\n\nUS authorities are currently reviewing the manifest of every cargo aboard MV\n\nHas Sri Lanka become a potential hub for the illegal wildlife trade?\n\nOn March 26, a couple arriving from Thailand was arrested with 88 live animal\n\nSpotlight on Moragahakanda Development Project Moragolla villagers lose livelihoods and down to one meal a day\n\nAccording to villagers from Naula-Moragolla out of 105 families 80 can afford\n\nMost Viewed in News\n\n1\n\nSajith bars Daily Mirror over liquor controversy\n\n2\n\nRupee expected to dip to Rs.310-320 range later this year: FCR\n\n3\n\nRanil meets Elon Musk\n\n4\n\nForeigner injured after falling from Lotus tower\n\n5\n\nElon Musk to visit Sri Lanka this year to launch Starlink\n\n6\n\nSri Lanka cricketer to retire after World Cup & migrate to Melbourne\n\nMIRROR CRICKET\nStarc stars as Kolkata thrash Hyderabad to reach IPL final\n\n2 hours ago\n - 0      - 106\n\nAll teams retained and pre-signed maximum players ahead of LPL auction\n\n21 May 2024\n - 0      - 860\n\nKusal Mendis secures visa to USA after delay\n\n21 May 2024\n - 5      - 1508\n\nFormer West Indies star joins Papua New Guinea coaching setup for T20 World Cup\n\n20 May 2024\n - 0      - 193\n\nMore\n\nTODAY'S HEADLINES\nFloods: Met. Department Office in Puttalam not spared\n\n21 May 2024\n\nWoman found dead in Kumbukkan Oya after possible stoning attack\n\n21 May 2024\n\nMahanayakes request Presidential pardon for Gnanasara Thera\n\n21 May 2024\n\nCourt prevents Wijeyadasa from functioning as SLFP Chairman\n\n21 May 2024\n\nStarc stars as Kolkata thrash Hyderabad to reach IPL final\n\n2 hours ago\n\nDulan shatters world record at Para Meet\n\n3 hours ago\n\nLPL auction: Matheesha Pathirana breaks record as most expensive player\n\n21 May 2024\n\nAll teams retained and pre-signed maximum players ahead of LPL auction\n\n21 May 2024\n\nMore\n\nGroup Sites\nLankadeepa\nAda\nSunday Times\nDaily FT\nTamil Mirror\nDeshaya\nMiddleast Lankadeepa\nMirror Edu\nLife Online\nHi Online\nLW\nKelimandala\nWijeya\nWedo\nwnow\nE-papers\nlankadeepa\nSunday Lankadeepa\nSunday Times\nDaily FT\nAda\nTamil Mirror\nClassified\nHitad\nTimesjobs\nServices\nE-Paper\nHome delivery\nAdvertise with us\nMobile Apps\nfeedback\nArchive\nContact us\n\nEditorial :\n\n +94 0112 479 356\n\n dmonlinelk@gmail.com\n\nTechnical :\n\n +94 011 538 3437\n\n helpdesk@wijeya.lk\n\n webadsupport@wijeya.lk\n\nMarketing :\n\n +94 011 247 9540\n\n +94 011 247 9873\n\nWeb Advertising Inquiry :\n\n Dilan : +94 77 372 7288\n\nPrint Advertising :\n\nChameen Dayarathne,\n\nManager - Marketing,\n\n : 0719 488 227 / 0769 285 885\n\nHOMEHOME DELIVERYWNL HOMEARCHIVESFEEDBACKADVERTISING\n\nAll the content on this website is copyright protected and can be reproduced only by giving the due courtesy to 'dailymirror.lk' Copyright © 2004 Wijeya Newspapers Ltd."
    }
]