{"url": "http://www.caledoniacourier.com/news/justice-rally-walk-to-end-violence-against-women/", "title": "Justice rally, walk to end violence against women - Caledonia Courier", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\n14.8 °C\nHome News\nJustice rally, walk to end violence against women\nSurvivors, supporters, local RCMP detachment and members of the community joined together in a Walk to End Violence on Friday June 9. The walk started and ended at Chief Kwah Memorial hall with a mid point stop at Spirit Square. At all three points; the start, the middle and the end people shared a few words, speaking up against violence experienced by women, especially indigenous and marginalised women of minority groups.\nFiona Maureen\nJun 21, 2017 1:30 AM\n\t\n\t\n\t\n\t\n\t\n\t\nParticipants walked from Kwah Hall to Spirit Square where a few people spoke against domestice violence. Photo Fiona Maureen\n\nSurvivors, supporters, local RCMP detachment and members of the community joined together in a Walk to End Violence on Friday June 9. The walk started and ended at Chief Kwah Memorial hall with a mid point stop at Spirit Square. At all three points; the start, the middle and the end people shared a few words, speaking up against violence experienced by women, especially indigenous and marginalised women of minority groups.\n\n“The National Inquiry into Missing and Murdered Indigenous Women and Girls is coming up [to Prince George] and people should be getting their communities ready. Women who have experienced violence can still apply to be a witness at the Inquiry. It is reported that they are going to need an extension. Communities need to get their services ready to support survivors,” said Marion Erickson of the Northern Women’s Centre.\n\n“Community leaders need to get their indigenous healers, mental health services, and transportation ready. They will need to fundraise for transportation to get to the inquiry because that is not going to be covered by the inquiry. Go to the inquiry website [www.mmiwg-ffada.ca] and speak to some of the family and see if they need some emotional and spiritual support. One of the tough things which is going on right now is that a lot of people on reserve don’t have internet. They need to stay informed as much as they can. It’s going to be a hard time for our communities people should be ready and people shouldn’t be speaking against it [the Inquiry],” said Marion Erickson.\n\nMarion openly shares that she is a survivor of domestic violence. For the past few years Marion has been working towards her undergraduate degree in Public Administration and Community Development. Recently, she was elected by the student body of to Senate where she sits on various senate committees. Marion was also recently awarded the Student Mentorship opportunity by the Prince George City Council and attended the 2017 Federation of Canadian Municipalities meeting in Ottawa last week. She will graduate from her Bachelors degree in 2019.\n\nWhen asked about this walk and how it came about, the organiser, Youth Justice coordinator, Maddison Sam explained, “Originally it began with a young women’s group. I wanted to educate them about healthy living, healthy lifestyle, drug awareness, living with an addict and then it came about, talking about violence against women and how it gets pushed to the side a lot.”\n\n“One quote that really spoke to me”, says Maddison, “The honour of our people lies in the moccasin tracks of the women and its true our community wouldn’t be where it is if it wasn’t for the women. And all our women are slowly being marginalised. You see it with drug addictions, sexual violence, domestic violence, collateral violence [experienced by children in families where there is abuse], and our women are becoming silent. I just want everyone know that they are not alone. It happens too often and I believe it is getting worse and pushed under the table. Our women are scared to speak out, they are intimidated. And this is something Nak’azdli should be talking about. We are a strong community, we have so many assets in our community. But violence in our community is not something that’s really discussed. “Violence against women is not something that is not discussed. It is not reported. There are not a lot of reported incidences. That is the issue. You hear it in women talking about it, they open up to you, lots of them come to me share situations that they are in.”\n\nMaddison Sam grew up in Fort St. James. She just recently graduated with a Diploma in Criminology from the College of New Caledonia. She is the Youth Justice Coordinator for the Nak’azdli Alternate Justice Centre. She is running programs over the summer and engaging with youth in a way that promotes healthy lifestyles while focusing on awareness and prevention activities.\n\nMaddison explains how she started the ‘Ts’ekezoo’ Young Women’s Group in the beginning of May. “The intent behind this group is to promote healthy, independent lifestyles within the young women. From this idea, I had thoughts about having a ‘Violence Against Women Awareness’ walk. After discussing some ideas with my coworkers and community members, it was evident that an initiative to spread awareness was needed in our community.\n\n“Violence against women is more common than people may think. The Canadian Women’s Foundation website states that half of all women in Canada have experienced at least one incident of physical or sexual violence since the age of 16. Not to mention, Aboriginal women are being killed at six times the rate of Non-Aboriginal Women. These facts are very concerning.\n\n“This march was a great opportunity for not only the Nak’azdli Whut’en, but the whole community to demonstrate that we do not condone or tolerate this type of behaviour. Also, this was a way to show possible victims of violence that they are not alone. Violence affects everyone and comes in many forms. Whether it be physical, sexual, emotional, psychological, or verbal abuse, it is not okay. Too often, women are afraid to speak out because of intimidation or fear of backlash. By the community gathering together, we are breaking this silence,” says Maddison.\n\nParticipants walked from Kwah Hall to Spirit Square where a few people spoke against domestice violence. Photo Fiona Maureen\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tFort St. James teacher to scale Mt. Everest equivalent to fundraise for Gaza children\n\t\tRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\n\t\tSearchers scan aerial video for clues about missing B.C. climbers\n\t\tCan Kootenay factory-built homes help solve B.C.'s housing crisis?\n\t\tThis new EV gets you to the Okanagan and back for $35\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nSearchers scan aerial video for clues about missing B.C. climbers\nUniversities warn of foreign influence registry’s ‘chilling effect’\nEdmonton Oilers look to regroup after ‘encouraging’ loss in Stanley Cup opener\nMore from Today in B.C. >\n \nCaledonia Courier\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nTerrace Standard\nThe Northern View\nSmithers Interior News\nKitimat Northern Sentinel\nHaida Gwaii Observer\nBurns Lake Lakes District News\nHouston Today\nVanderhoof Omineca Express\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Caledonia Courier and Black Press Media Publications Contact"}
{"url": "https://www.terracestandard.com/news/indigenous-voices-finally-heard-with-final-mmiwg-report-says-northwest-b-c-advocate/", "title": "Indigenous voices finally heard with final MMIWG report, says Northwest B.C. advocate - Terrace Standard", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\n10.9 °C\nHome News\nIndigenous voices finally heard with final MMIWG report, says Northwest B.C. advocate\nThe report contains more than 200 recommendations to multiple levels of government\nBrittany Gervais\nJun 4, 2019 1:00 PM\nJun 4, 2019 4:35 PM\n\t\n\t\n\t\n\t\n\t\n\t\nGladys Radek calls for accountability and action by government in last leg of national inquiry in April 2018. (Ashley Wadhwani photo)\n\nNorthwest B.C. long-time advocate for missing and murdered Indigenous women Gladys Radek says the National Inquiry’s report on the genocide of thousands of Indigenous women and girls finally validates what families have been saying for years.\n\nRadek worked closely with the National Inquiry as part of the National Family Advisory Circle, who brought the families stories forward and advised the commission on “virtually all the recommendations.” Her family still has no answers for what happened to their niece, Tamara Chipman, who disappeared while hitchhiking in Prince Rupert in 2005.\n\n“It’s been a long road,” Radek says. “I’m just glad I was able to give the families their voice — It’s not my voice I want them to hear, it’s the families, all of the families. And I think they were very loud and clear today.”\n\nThe 1,200-page report, titled ‘Reclaiming Power and Place,’ calls the violence against First Nations, Metis and Inuit women and girls a form of “genocide” and a crisis “centuries in the making.”\n\nThe National Inquiry into Missing and Murdered Indigenous Women and Girls was first launched in 2016 after calls for action came from Indigenous families and organizations to examine and report on the systematic causes of violence faced in Canada against Indigenous women and girls.\n\n“These abuses and violations have resulted in the denial of safety, security, and human dignity,” the final report says.\n\nREAD MORE: Extend MMIW inquiry for two years: advocate\n\nOver the years, Radek has spoken with thousands of families who have experienced unimaginable grief and heartache over the loss of their loved ones as part of her work with the inquiry. While they were forced to work under a shortened timeframe, the more than 200 recommendations listed in the report accurately represent the wishes of thousands of families, she says.\n\n“Our families always knew what was needed, and we just want Canada to hear the atrocities we’ve been facing. If [people] are in tears, you know they’re listening.”\n\nThe report also has calls for action in areas including justice and health, including that health-service providers develop programs that could help young people recognize the signs of being targeted for exploitation.\n\nThe recommendations — framed in the report as “calls for justice” — include developing an effective response to human trafficking cases and sexual exploitation and violence, including in the sex industry. They are not optional, but constitute legal imperatives, the report says.\n\nAdditional calls include the need to establish a national Indigenous and human rights ombudsperson and a national Indigenous and human rights tribunal.\n\nIt also recommends the development of a national action plan to ensure equitable access to employment, housing, education, safety, and health care, as well as long-term funding for education programs and awareness campaigns related to violence prevention.\n\nThe report also strongly focuses on the need for actors in the justice system and in police services to acknowledge that the historical and current relationship with Indigenous women, girls, and two-spirit people has been largely defined by “colonialism, racism, bias, discrimination, and fundamental cultural and societal differences.”\n\nMissing and murdered Indigenous women are believed to number in the thousands in Canada, but the report says that despite the commission’s best efforts to quantify the extent of the tragedy, ”no one knows an exact number.”\n\n“People should be outraged knowing the real truth about this genocide against our people,” Radek says. “This is exactly what the families have been saying for years. Now it’s officially on record that Canada should be held accountable for genocide.”\n\nREAD MORE: All Canadians have a role to play in ending ‘genocide,’ report says\n\nMoving forward, Radek says she wants to see the federal government’s promised comprehensive action plan responding to the recommendations outlined in the report regardless of the upcoming election this fall.\n\n“I would like to see the [action plan] sooner than later,” Radek says, noting Trudeau’s recent actions with his cabinet’s previous justice minister Jody Wilson-Raybould could fare poorly for the Liberals this election cycle.\n\n“When they change prime ministers you always have to start reeducating them, then you have to go to them and say it’s up to Canada to do this.”\n\nGovernments recognizing the crisis as genocide was an important step, and while the report is a good start, there needs to be assurances that meaningful changes will come from all levels of government, Radek says.\n\n“There’s no excuse for a certain population to be living in poverty. The resources are needed for our health healing and wellness programs, the resources are needed for housing, economic stability. [Governments] need to resource them, they need to fund these organizations not just part-time, we need permanent measures.”\n\nThe inquiry was first launched in 2016 after calls for action came from Indigenous families and organizations to examine and report on the systematic causes of violence faced in Canada against Indigenous women and girls.\n\nIn 2005, the Native Women’s Association of Canada created a database, tracking cases and produced a 2010 report documenting 582 missing and murdered Indigenous women.\n\nIn 2014, the RCMP released a national overview and pegged the number of cases between 1980 and 2012 at nearly 1,200. Other unverified estimates are far higher.\n\n—with files from The Canadian Press\n\n \n\n\nbrittany@terracestandard.com\nLike us on Facebook and follow us on Twitter\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tTerrace fire dept. down to no volunteers due to increased training requirements\n\t\tSecond weapons seizure at homeless camp in Terrace\n\t\tCity orders clean up of Greig Ave. property\n\t\tTerrace launches program for RCMP access to private properties\n\t\tNew B.C. crime novel paints dark portrait of small-city life\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nSearchers scan aerial video for clues about missing B.C. climbers\nUniversities warn of foreign influence registry’s ‘chilling effect’\nEdmonton Oilers look to regroup after ‘encouraging’ loss in Stanley Cup opener\nMore from Today In BC >\n  \nTerrace Standard\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nThe Northern View\nSmithers Interior News\nKitimat Northern Sentinel\nHaida Gwaii Observer\nBurns Lake Lakes District News\nHouston Today\nVanderhoof Omineca Express\nCaledonia Courier\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Terrace Standard and Black Press Media Publications Contact"}
{"url": "https://www.reddeeradvocate.com/news/troubled-inquiry-into-missing-murdered-indigenous-women-seeks-two-more-years/", "title": "Troubled inquiry into missing, murdered Indigenous women seeks two more years - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nTroubled inquiry into missing, murdered Indigenous women seeks two more years\nOTTAWA — The national inquiry looking into the saga of missing and murdered Indigenous women and girls in Canada is formally asking for two more years to finish its work.\nThe Canadian Press\nMar 6, 2018 1:10 PM\n\t\n\t\n\t\n\t\n\t\n\t\nThe national inquiry looking into missing and murdered Indigenous women and girls in Canada is asking for two more years to finish its work. (Photo by THE CANADIAN PRESS)\n\nOTTAWA — The national inquiry looking into the saga of missing and murdered Indigenous women and girls in Canada is formally asking for two more years to finish its work.\n\nThe inquiry was originally scheduled to wrap up at the end of this year, but chief commissioner Marion Buller has long warned more time would be necessary.\n\n“The commissioners and I firmly believe that an additional two years is required to do justice to our critically important mandate for the safety and security of Indigenous women, girls, and 2SLGBTQ (LGBTQ and two-spirit) people,” chief commissioner Marion Buller said in a statement released Tuesday.\n\n“The response from families, survivors and Indigenous communities has been overwhelming, and we have a sacred responsibility to them to continue moving forward.”\n\nThe office of Indigenous Relations Minister Carolyn Bennett confirmed it had received the inquiry’s request and that the minister would speak with families, Indigenous partners, provincial and territorial officials and her cabinet colleagues over the coming weeks about the possibility of an extension.\n\n“The families of these women and girls need answers to the systemic and institutional failures that lead to the murder of so many Indigenous women,” Bennett said in a statement.\n\n“We are committed to getting them the concrete recommendations they have been waiting for, and putting an end to this ongoing tragedy.”\n\nThe federal government established the inquiry in late 2015 to examine the evidence behind a disproportionately high number of missing and murdered Indigenous women and girls in Canada, and to give family members a chance to have their stories heard.\n\nAn additional two years would extend the inquiry’s mandate to the end of 2020.\n\nThe commission has so far heard from more than 760 witnesses during nearly 250 public, in-camera and community hearings held across the country.\n\nBut the process has been fraught with controversy and delays, including the high-profile departures of key personnel and public complaints about long delays and a lack of communication with stakeholders.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nInnisfail RCMP vehicle rammed at Pine Lake traffic stop\nBlack Press Media\nParkade expansion progressing at Red Deer hospital\nBlack Press Media\nThe most realistic game 2024. If you own a mouse, play it for 1 minute.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nCurrently the best free game. \nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians Under Age 80 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nCentral Alberta RCMP search for suspects in an armed home invasion\nBlack Press Media\nTornado watch issued for Wetaskiwin\nBlack Press Media\nPlay this game for 1 minute and see why everyone is addicted.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nIf you have a mouse, you have to play this game. \nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians In Alberta With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nRed Deer man, Oilers fan sets up oil derrick in pickup truck\nBlack Press Media\nThunderstorm spawns five tornadoes in Central Alberta\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "http://www.bbc.co.uk/news/world-us-canada-40063783", "title": "Public hearings begin in missing and murdered indigenous women inquiry - BBC News", "body": "BBC Homepage\nSkip to content\nAccessibility Help\nSign in\nHome\nNews\nSport\nEarth\nReel\nWorklife\nTravel\nMore menu\nSearch BBC\nBBC News\nHome\nIsrael-Gaza war\nWar in Ukraine\nIndia Election 2024\nClimate\nVideo\nWorld\nUS & Canada\nUK\nBusiness\nMore\nUS & Canada\nPublic hearings begin in missing and murdered indigenous women inquiry\nPublished\n31 May 2017\nShare\nIMAGE SOURCE,\nGETTY IMAGES\nImage caption,\n\nJoe and Thelma Favel's niece, Tina Fontaine, was murdered in 2014\n\nCanada's inquiry into missing and murdered indigenous women is hearing from its first witnesses.\n\nSome 40 participants are registered for three days of public hearings in Whitehorse in Canada's Yukon territory.\n\nThe inquiry is focusing on the systemic causes of violence against indigenous women as well as on prevention.\n\nA number of families have come out in recent weeks expressing concerns over the inquiry's delays and lack of transparency.\n\nChief commissioner Marion Buller said the inquiry is listening for both details from families about lost loved ones as well as any patterns or trends that emerge from all the stories.\n\nOn Tuesday, the inquiry heard the first of many harrowing and tearful testimonies from families who have lost relatives to violence.\n\nRed River Women\n\nMs Buller said she hopes the families \"gain some closure\" by sharing their stories. The community hearings are open to the public unless relatives or other witnesses request privacy.\n\nThe federal government has said that some 1,200 aboriginal women have been murdered or gone missing in Canada since 1980, though some estimates put that number as high as 4,000.\n\nMichèle Audette, another of the inquiry's five commissioners, said that \"the eyes of the country and the world are watching. History will remember this moment\".\n\nLast week, Assembly of First Nations National Chief Perry Bellegarde raised issues with the lack of communication with families and First Nations in general by the inquiry.\n\nFamilies, especially in remote communities, have complained it is difficult to get in contact with the inquiry.\n\nBill Wilson, a hereditary First Nations chief in British Columbia and the father of federal Justice Minister Jody Wilson-Raybould, called the inquiry a \"bloody farce\" in a Facebook post and said it had \"failed miserably\" even before public hearings began.\n\nInquiry commissioners have said they are aware of the concerns and are working on improving communications and re-evaluating the inquiry's timelines.\n\n\"I'm interested always in constructive criticism, of ways of doing our work better,\" Ms Buller said.\n\nThe inquiry will last at least two years and cost up to $53.8m (US$40m/£30.8m).\n\nLaunching a national inquiry was a key pledge by Prime Minister Justin Trudeau, following a growing call from some families, First Nations groups and international organisations like the United Nations.\n\nJustin Trudeau asks Pope for apology\n\nFive independent commissioners will provide recommendations to deal with violence against the country's indigenous women. They are expected to table an interim report in November.\n\nThe Whitehorse hearings will be the only public ones for a while. Commissioners will only begin hearing public testimony again this fall.\n\nMore on this story\n\nCanada launches indigenous women inquiry\n\nPublished\n3 August 2016\n\nCanada unsure of number of missing women\n\nPublished\n17 February 2016\nTop Stories\nLIVE\n. \n\nNow harder to have own home under Conservatives, Sunak says in BBC interview\n\nTory manifesto will include tax cuts, says PM\n\nPublished\n1 hour ago\n\nLib Dems pledge £8bn NHS and care package in manifesto\n\nPublished\n2 hours ago\nFeatures\n\nWho can I vote for in the general election?\n\n'I owe him so very much': Your tributes to Michael Mosley\n\nIt is what it is - boys, 12, on Snapchat after murder\n\nHow Gaza hostage raid ended with Israel striking crowded streets\n\nThousands of Swifties made 'unbelievable impact' on Edinburgh\n\nFar right makes gains in EU election but it could struggle to unite\n\nUK weather: Where is summer?\n\nBillie Eilish: 'I was ghosted. It was insane'\n\nWidow of IS leader reveals details of their life together\n\nElsewhere on the BBC\n\nThe life and legacy of a trailblazing comedy icon\n\nWriter Max Kinnings pays tribute to comedian Rik Mayall, featuring unheard recordings\n\nYour first glimpse at the highly-anticipated series\n\nBased on Holly Jackson’s hit novels, A Good Girl’s Guide to Murder is coming soon to iPlayer\n\nMartin Freeman launches readings from an Orwell classic\n\nAlso featuring special readings from Tom Hollander, Juliet Stevenson and more\n\nBringing history alive through powerful, rare recordings\n\nThis is the story of D-Day, told by those who were there\n\nMost Read\n1\nMichael Mosley died of natural causes, police say\n2\nGiovanni Pernice will not return to Strictly Come Dancing\n3\nBoys, 12, found guilty of machete murder\n4\nIt is what it is - boys, 12, Snapchat after murder\n5\nCriticism after football club drops women's team\n6\nMacron snap election leaves rivals stunned after EU vote\n7\nGenetic testing firm 23andMe investigated over hack\n8\nAircraft carrying Malawi vice-president goes missing\n9\nLabour drops plan to reintroduce pension saving cap\n10\nTory manifesto will include tax cuts, says PM\nBBC News Services\nOn your mobile\nOn smart speakers\nGet news alerts\nContact BBC News\nHome\nNews\nSport\nEarth\nReel\nWorklife\nTravel\nCulture\nFuture\nMusic\nTV\nWeather\nSounds\nTerms of Use\nAbout the BBC\nPrivacy Policy\nCookies\nAccessibility Help\nParental Guidance\nContact the BBC\nGet Personalised Newsletters\nWhy you can trust the BBC\nAdvertise with us\nDo not share or sell my info\n\n© 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."}
{"url": "http://www.reddeeradvocate.com/news/more-shakeup-at-inquiry-into-murdered-and-missing-indigenous-women/", "title": "More shakeup at inquiry into murdered and missing Indigenous women - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nMore shakeup at inquiry into murdered and missing Indigenous women\nVANCOUVER — The troubled inquiry into Missing and Murdered Indigenous Women and Girls continues to face shakeup.\nThe Canadian Press\nOct 8, 2017 7:30 AM\n\t\n\t\n\t\n\t\n\t\n\t\n\nVANCOUVER — The troubled inquiry into Missing and Murdered Indigenous Women and Girls continues to face shakeup.\n\nChief commissioner Marion Buller announced Saturday that the inquiry’s director of research is leaving next month and the commission’s lead counsel has also resigned.\n\nThe announcement came a day after the inquiry named a new executive director.\n\nBuller announced late Friday that former Assembly of First Nations adviser Debbie Reid has taken the job.\n\nReid is from the Skownan First Nation in Manitoba.\n\nShe was a special adviser to Assembly of First Nations National Chief Phil Fontaine when he held the job and she’s also worked for the federal government.\n\nThe inquiry has run into troubled waters in recent months with criticism that victims’ families weren’t being adequately consulted about the shape of the inquiry.\n\nOne of the inquiry’s commissioners and the previous executive director resigned in the wake of the criticism.\n\nThere were subsequent calls for a more profound shakeup with one prominent Manitoba First Nations chief even calling for Buller to leave.\n\nThe federal government gave the inquiry a budget of about $53.8 million and set a deadline for its work to be done by the end of next year.\n\nThe Canadian Press\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://www.bbc.co.uk/news/world-us-canada-66317924", "title": "Winnipeg: A daughter's quest to find her mother's remains - BBC News", "body": "BBC Homepage\nSkip to content\nAccessibility Help\nSign in\nHome\nNews\nSport\nEarth\nReel\nWorklife\nTravel\nMore menu\nSearch BBC\nBBC News\nHome\nIsrael-Gaza war\nWar in Ukraine\nIndia Election 2024\nClimate\nVideo\nWorld\nUS & Canada\nUK\nBusiness\nMore\nUS & Canada\nWinnipeg: A daughter's quest to find her mother's remains\nPublished\n28 July 2023\nShare\nIMAGE SOURCE,\nBRANDI MORIN\nImage caption,\n\nCambria has been leading the search for her mother's remains at the landfill\n\nPolice believe the remains of four indigenous women murdered by a serial killer were dumped in a landfill. But officials have yet to recover their bodies, leaving it up to the victims' family members to keep the search alive, reports Brandi Morin.\n\nA makeshift barricade of tyres and scraps of white-painted fence lays across a paved road leading to the Brady Landfill on the outskirts of the Canadian city of Winnipeg.\n\nMohawk warrior flags, which feature the face of an indigenous man superimposed on a yellow sunburst on a red background, wave in the wind. Indigenous blockaders dressed in camouflage gear stand guard nearby, keeping people from entering.\n\nThey have been standing sentry for weeks, in protest, after police announced they believe the bodies of indigenous women murdered by a serial killer may be buried there.\n\nBehind their barrier is 22-year-old Cambria Harris. And she will stop at nothing to find her mother's body.\n\nLast December, Winnipeg police told Cambria and other family members that her mother Morgan Harris, 39, of Long Plain First Nation had allegedly been murdered by a man they accuse of being a serial killer.\n\nPolice claim Jeremy Skibicki killed four women, including Harris, and dumped their bodies in two different landfills over a three-month span in the spring of 2022.\n\nAll the women were indigenous. None of their bodies have been recovered.\n\nHe is charged with first degree murder in the deaths of Harris; Marcedes Myran, 26, also of Long Plain First Nation; Rebecca Contois, 24, of O-Chi-Chak-Ko-Sipi First Nation; and an unknown woman who was given the ceremonial name of Buffalo Woman by indigenous elders.\n\nIn the months before hearing the devastating news of her mother's death, Cambria was on another desperate search - looking for her missing mother on the streets, homeless shelters and other places where Morgan would hang out.\n\nThe moment she learned of her mother's fate on a December day at police headquarters, was \"heartbreaking\", she said.\n\nHer mother's cousin Kirstin Witwicki grew up with Morgan Harris on the north side of Winnipeg but the cousins drifted apart when Morgan became addicted to drugs.\n\n\"Addictions are just people trying to turn off the pain,\" she told the BBC. But still, Harris was \"fearless, someone who spoke her mind\".\n\n\"She was tiny but tough. And I think whatever this man did to her, she must have fought. She did not go down without a fight. I know that in my soul. But that's the hard part, I try not to think about what she was thinking.\"\n\nThat toughness has been passed onto Cambria, who has been fighting to have her mother's body and the bodies of other victims recovered from the landfills where they were buried.\n\nIMAGE SOURCE,\nBRANDI MORIN\nImage caption,\n\nCambria Harris holds a beaded red dress someone made for her. Red dresses have come to symbolize the crisis of missing and murdered indigenous women and girls\n\nWhen police told Cambria that they had no plans to search the Prairie Green Landfill where the remains of her and Marcedes Myran are believed to be, Cambria said she \"screamed right at the homicide investigators\", she told the BBC from her home in Winnipeg in May.\n\n\"What if your mother or your loved one ended up in a landfill and you were told that they would not search for your loved one and that they're going to be there for time immemorial? There's a chance that my mother's bones are still there,\" she said.\n\nPolice told her too much time had passed and a search was \"unfeasible\".\n\nAfter police initially declined to search the landfill, and under pressure from the families and their supporters, the federal government funded a study to determine if a search would indeed be possible. It concluded that a search could take up to three years, cost up to C$184 million ($134m, £109m), and workers would be exposed to hazardous chemicals.\n\nEarlier this month, the premier of the province of Manitoba, Heather Stefanson, met with relatives of the victims, including Cambria, and told them the province wouldn't support a landfill search.\n\nIt would put workers in danger with no assurances of a result, she said.\n\nThe decision was met with anger by the families, supporters and indigenous leaders.\n\n\"Why aren't we looking and what does it come down to? To a price tag and not the price of indigenous women's lives being stolen,\" Cambria said.\n\nIMAGE SOURCE,\nBRANDI MORIN\nImage caption,\n\nThe deaths of these four women echo the 2014 murder of indigenous teenager Tina Fontaine\n\nBeyond the pain felt by the families of the murdered women, the issue has touched a raw nerve in the city and beyond.\n\nCanada has long faced a crisis of missing and murdered indigenous women and girls. According to the RCMP, indigenous women make up 10% of the population of missing women in Canada\n, external\n, and 16% of female homicides. Indigenous women make up about 4% of the female population in Canada.\n\nWhile the issue is nationwide, it has touched Winnipeg - a city of some one million in the heart of the Canadian prairies - deeply.\n\nThe city gets its name from the Cree words \"Win,\" (muddy) and \"nipee,\" water, and the Red River winds its way through it.\n\nIn 2014, the body of 15-year-old Tina Fontaine, of Sagkeeng First Nation, was pulled from the river near the Alexander Docks adjacent to the city's centre.\n\nOn the trail of the murdered and the missing\n\nGiving a voice to missing and murdered women\n\nThe murder of the young teenager was a tipping point in Canada, leading to calls that eventually helped launch a national inquiry into violence against indigenous women and girls.\n\nCambria was one of thousands who took to the streets in protest. She was 14 at the time.\n\nIn 2019, the national inquiry concluded these women were victims of a \"Canadian genocide\" driven by \"state actions and inactions rooted in colonialism and colonial ideologies\".\n\nNahanni Fontaine, of Sagkeeng First Nation, and a provincial politician with the left-leaning New Democratic Party, says the killings of the four women and the fight over the search for their bodies is another cultural turning point.\n\n\"In a perfect world, they would've started immediately and just gave it their all,\" said Fontaine, who is not related to Tina Fontaine.\n\nIMAGE SOURCE,\nBRANDI MORIN\nImage caption,\n\nCambria says generational trauma contributed to her mother's addiction\n\nCambria was born and raised in Winnipeg where she lived with her mother - who was \"always there\" and three younger siblings, \"always being surrounded by family\", until she was six.\n\nThen, one weekend, her world dramatically shifted.\n\nShe came home from a sleepover and found it surrounded by police, with her belongings, and those of one of her sisters, in garbage bags.\n\nThe siblings were taken away by child services.\n\nCambria doesn't know why they were taken, she was never given a specific reason, but thinks it was most likely due to her mother's growing drug addiction. She was scared that day and not allowed to see her mother.\n\n\"You're being told to stay in the car and that you're going for a long sleepover, which ends up being 10 plus years and lasting all the way until you're 18.\"\n\nCambria was placed in the care of her maternal aunt, Crystal, along with her sister. Cambria and her siblings kept in regular contact with their mother until she ended up on the streets.\n\nLike many indigenous families, Cambria says the pain that afflicted her family took hold generations ago.\n\nHer great-grandparents left the Long Plain First Nation in the late 1800s due to insufficient food rations provided by the federal authorities and ended up living in the Macgregor landfill north of Winnipeg in a rundown shack.\n\nNow, her own mother's body lies somewhere in another landfill.\n\nHer grandmother was sent to a residential school - institutions where many suffered physical, emotional and sexual abuse and children were often housed in poorly built, poorly heated, and unsanitary facilities.\n\nThe family trauma was handed down through generations, says Cambria, including to her mother.\n\nIn her teenage years, Cambria herself struggled.\n\n\"I was really angry for a long time, I won't lie, I wasn't the greatest kid either,\" she said. \"But I got sick of running away from my problems and I started facing them head on.\"\n\nAt 18 Cambria gave birth to her daughter Willow, now three, and went on to graduate high school.\n\nNow, she has turned her attention to finding justice for her mother and the other three women, and bringing them home.\n\n\"I turned my grief and my anger into something beautiful,\" she said.\n\nFind out more\n\n\"We are not trash!\" A daughter's fight to bury her mother - listen now on BBC Outlook\n\nThe fight is not over.\n\nThe federal government told the BBC that they are still considering whether they will fund a search.\n\nA blockade erected in support of a search outside one city landfill was torn down 18 July, after a court granted Winnipeg an injunction to remove the barricade over safety concerns.\n\nAnother camp has since gone up outside the Canadian Museum for Human Rights in Winnipeg.\n\nFor Cambria, there is no question about keeping pressure on authorities to search for her mother's and the other victims' remains.\n\n\"They're telling me that my mother's dead, but where? Well, if she has been murdered, she needs to be retrieved,\" she said.\n\n\"And so does Marcedes Myran because this landfill is essentially a giant burial site, an unmarked grave at that.\"\n\nRelated Topics\nFemicide\nWinnipeg\nIndigenous Canadians\nCanada\nMore on this story\n\nMurdered schoolgirl 'failed by the system'\n\nPublished\n12 March 2019\n\nThe $135m cost of finding an alleged killer’s victims\n\nPublished\n13 May 2023\n\nMurdered women's families demand landfill search\n\nPublished\n12 December 2022\n\nCanada city can halt indigenous murders blockade\n\nPublished\n14 July 2023\n\nCanadian cleared of Red River murder\n\nPublished\n23 February 2018\nBBC News Services\nOn your mobile\nOn smart speakers\nGet news alerts\nContact BBC News\nHome\nNews\nSport\nEarth\nReel\nWorklife\nTravel\nCulture\nFuture\nMusic\nTV\nWeather\nSounds\nTerms of Use\nAbout the BBC\nPrivacy Policy\nCookies\nAccessibility Help\nParental Guidance\nContact the BBC\nGet Personalised Newsletters\nWhy you can trust the BBC\nAdvertise with us\nDo not share or sell my info\n\n© 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."}
{"url": "http://www.reddeeradvocate.com/national-news/mmiw-inquiry-hears-slain-womans-family-angry-over-sex-trade-label/", "title": "MMIW inquiry hears slain woman’s family angry over sex-trade label - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome National News\nMMIW inquiry hears slain woman’s family angry over sex-trade label\nSASKATOON — Family members of a slain Indigenous woman say they’re angry that she’s been labelled a sex-trade worker rather than a mother, a daughter and a sister whose death deserves justice.\nThe Canadian Press\nNov 21, 2017 8:30 PM\n\t\n\t\n\t\n\t\n\t\n\t\nPhoto by THE CANADIAN PRESS Lance Stone, right, passes a microphone and eagle feather to his brother Evert Stone, both are the children of Silvia Stone who was murdered in 1981, speaks during the National Inquiry into Missing and Murdered Indigenous Women and Girls Saskatchewan Community Hearing Schedule Truth Gathering Process in Saskatoon, Tuesday.\n\nSASKATOON — Family members of a slain Indigenous woman say they’re angry that she’s been labelled a sex-trade worker rather than a mother, a daughter and a sister whose death deserves justice.\n\nMonica Burns’s body was found on a snowmobile trail near Prince Albert, Sask., in January 2015.\n\nHer brother, Pernell Ballantyne, told the inquiry into murdered and missing Indigenous women on Tuesday that he’s frustrated with the way the media has described Burns and other Indigenous women.\n\n“Maybe if they would have thought about it and come up with a different word, maybe our women wouldn’t be so targeted,” he told the hearing in Saskatoon.\n\nBallantyne wore a T-shirt with a picture of Burns on the front and said the shirt has drawn comments from people on the street who recall that Burns was a sex-trade worker. That’s been hurtful to Burns’s young daughter, who will never have the chance to bond with her mother, he said.\n\n“That really gets me mad because my niece has to deal with that, has to hear that.”\n\nBallantyne also took issue with Burns’s killer being allowed to plead guilty to manslaughter after being charged with second-degree murder. He was sentenced to 13 years in prison with three years of credit for time served.\n\n“It was like the justice system … rushed through just to get it over and done with.”\n\nThe aunt of Nadine Machiskinic, who was found dead at the bottom of a hotel laundry chute, told the inquiry families are being repeatedly traumatized as they push for accountability in the justice system.\n\n“I don’t think any family should ever have to be put in that position to continually have to go before the media and be retraumatized over and over and over … to have people listen and take accountability and acknowledge the mistakes that were made and acknowledge the things that were happening,” Delores Stevenson said Tuesday.\n\nMachiskinic was 29 when she was found at the bottom of the laundry chute at Regina’s Delta Hotel in January 2015.\n\nAn autopsy report said the mother of four died of blunt force trauma to the head, neck and trunk consistent with a fall. Blood tests also showed Machiskinic had alcohol and a mix of methadone and three other drugs in her system, as well as high levels of sleeping medication.\n\nThe coroner’s initial report deemed the cause of death undetermined, but the final report ruled the death accidental with no evidence of foul play and no evidence of suicidal intent.\n\n“I had approached the coroner’s office on many occasions and asked them how they had come to the conclusion, given the very little evidence they had, given the lack of investigation that was done,” Stevenson said.\n\n“How did they come to the conclusion that they were going to rule it an accident?”\n\nIt took police more than a year before they started looking for two men shown on surveillance video getting onto an elevator with someone who appeared to be Machiskinic.\n\nMachiskinic’s family has also questioned how she fit through the opening of the laundry chute, which was only 53 centimetres wide, and why it took police 60 hours to launch an investigation.\n\n“Where is the justice in that?” Stevenson asked.\n\nThe jury at the coroner’s inquest changed the finding again and said it could not determine the cause of her death.\n\n“The trauma and the nightmare that my family had to go through to go from undetermined and, 2 1/2 years later, it’s back at undetermined. I don’t get it,” said Stevenson.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://www.theglobeandmail.com/politics/article-trudeau-vows-action-on-mmiwg-stops-short-of-calling-deaths-a-genocide/", "title": "Trudeau vows action on MMIWG but declines to endorse inquiry’s genocide finding - The Globe and Mail", "body": "Skip to main content\nSEARCH\nNEWSLETTERS\nWATCHLIST\nLOG IN\nSUBSCRIBE\nFROM $1.99/WEEK\nHOME\nFOR YOU\nCANADA\nWORLD\nBUSINESS\nINVESTING\nPERSONAL FINANCE\nOPINION\nPOLITICS\nSPORTS\nLIFE\nARTS\nDRIVE\nREAL ESTATE\nTrudeau vows action on MMIWG but declines to endorse inquiry’s genocide finding\nGLORIA GALLOWAY\nPARLIAMENTARY REPORTER\nWENDY STUECK\nENVIRONMENT REPORTER\nOTTAWA AND VANCOUVER\nPUBLISHED JUNE 3, 2019\nUPDATED JUNE 4, 2019\n\nThis article was published more than 5 years ago. Some information may no longer be current.\n\nReport an editorial error\n\nReport a technical issue\n\nEditorial code of conduct\n\nMore from Politics\nOPINION\nWhat you can learn about politics from Arnold Viersen’s trip to Pierre Poilievre’s woodshed\nSHANNON PROUDFOOT\nCanada can’t allow allegations of collusion with foreign powers to hang over Ottawa, former CSIS director says\nCollusion allegations must go to foreign interference inquiry, Opposition parties say\nMcLachlin to retire from seat on Hong Kong’s highest appellate court when term ends\nCaregivers from abroad to be given permanent residence on arrival under new pilot programs\nThree in four Canadians support work-in-office rules for federal public servants: poll\nTrending\nSo what if inflation is falling? The damage to our finances is done\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nLoss of historic St. Anne’s Anglican Church in Toronto ‘catastrophe for Canadian architecture’\nTax collectors claim $300-million owed in alleged fraud related to First Nations gas stations\nWith so much technology in cars, why can’t the screen show me what the check engine light means?\nMore for you\nFreeland says broad strokes of capital-gains tax hike haven’t changed, details coming Monday\nCalgary mayor Jyoti Gondek apologizes for communication gaps as city works to repair water main\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nFar right’s election gains rattle EU’s traditional powers, Macron calls snap polls\nFollow related authors and topics\nWENDY STUECK\nFOLLOW\n\nAuthors and topics you follow will be added to your personal news feed in Following.\n\nInteract with The Globe\nPERSONAL FINANCE COURSE\nMoneySmart Bootcamp\nA five-week newsletter course focused on teaching basic and foundational personal finance skills\nSIGN UP\nGLOBE EVENTS\nFixing the Broken Rung\nFREE VIRTUAL EVENT | Tuesday, May 18, 2024 @ 12:30 P.M. ET | Join The Globe's Déjà Leonard and experts for a discussion on promotion and talent development.\nREGISTER NOW\nTHE GLOBE WOMEN'S COLLECTIVE\nBringing women at all career stages together\nFocused reporting aimed at moving the needle toward gender equity in the workplace\nEXPLORE NOW\nLATELY PODCAST\nHigh salary, high expectations, hightail it out of there\nOur guest Carrie Sun, author of the new memoir Private Equity, describes her disillusioning journey working at a billion-dollar Wall Street hedge fund\nLISTEN NOW"}
{"url": "https://canadiandimension.com/articles/view/tracing-the-geography-of-canadas-racist-liquor-control-policies", "title": "Tracing the geography of Canada’s racist liquor control policies – Canadian Dimension", "body": "  \nCANADIAN POLITICS\n \nECONOMIC CRISIS\n \nENVIRONMENT\n \nEUROPE\n \nHOUSING\n \nINDIGENOUS POLITICS\n \nLABOUR\n \nMIDDLE EAST\n \nMEDIA\n \nMORE\n\nADVERTISEMENT\n\nTracing the geography of Canada’s racist liquor control policies\nAlcohol control measures have evolved over time to maintain the oppression and exploitation of Indigenous people\n\nJames Wilt / August 10, 2020 / 42 min read\n\nCANADIAN POLITICSINDIGENOUS POLITICS\n\nToronto Police arresting a man for illegal possession of alcohol, September 16, 1916. Photo courtesy of Library and Archives Canada.\n\nOn a Saturday afternoon in mid-January, Winnipeg musician John K. Samson witnessed several plainclothes “loss prevention officers” violently handcuffing three Indigenous girls for alleged theft from a liquor store.\n\n“As I arrived at the scene, I saw one officer lean on a prone girl’s back to apply handcuffs, and another push one of the children face-first into the window of the store,” wrote Samson in a letter to Manitoba Liquor & Lotteries Corporation a few days later. “The officers then forced the girls to sit in an uncomfortable and humiliating position on a hard floor, handcuffed and visible to the public, and spoke to the girls in a demeaning manner while waiting for police to arrive.”\n\nSamson’s complaints about the handling of the situation were ridiculed by officers at the scene. As he sat with the girls, passerbys insulted the youth as “low-lifes” and “criminals.” Once police arrived, Samson asked to accompany the girls to the car to ensure they weren’t further harmed—and was threatened with arrest by one of the cops.\n\n“The fact that these three young Indigenous women were assaulted by officers and jeered at by members of the public at the historical site of a displaced Métis community should make us all doubly and deeply ashamed,” Samson wrote in his complaint, referencing the Rooster Town settlement that was bulldozed in the 1950s to build the mall where the liquor store is.\n\n“The recent heightened security protocols MLLC has introduced are directly to blame and should be suspended immediately.”\n\nSamson never received a response from the provincial Crown corporation to his complaint.\n\nLess than three months after the incident Samson witnessed, 16-year-old Eishia Hudson was shot to death by Winnipeg Police officers. Hudson, who was Indigenous, had allegedly participated in the theft of alcohol from a liquor store. Cops were called and engaged in a pursuit of the allegedly stolen vehicle she was driving. If the store had not summoned police to defend its property via a high-speed chase that greatly escalated the situation, there is a very high likelihood that Hudson would still be alive today.\n\nThe arrests and humiliation of the three Indigenous girls in mid-January and the police killing of Eishia Hudson in early April are only two of the countless examples of anti-Indigenous violence triggered by the moral panic about liquor store thefts in early 2019. A severe and deadly ratcheting up in carceral infrastructure has been introduced in its wake, including the introduction of secure entrances, the hiring of police officers and “loss prevention officers,” and the assigning of a special Crown prosecutor to expedite the conviction of alleged thieves. Several of these policies have been called for and supported by the Manitoba NDP and Manitoba Government and General Employees’ Union (MGEU).\n\nThe Crown corporation that runs Manitoba’s liquor stores now keeps an active list of people charged—not convicted—for theft on its website. The stories that have emerged about the people caught up in this fallout are disturbing. In one instance, an Indigenous man who had survived childhood abuse and whose own child was killed by a drunk off-duty police officer was sentenced to over three months in jail for liquor theft.\n\nThrough these policies, consumption or alleged consumption of alcohol by Indigenous people is more visibly leveraged by the settler state to justify everything from police violence, to gentrification and displacement, to the trivialization of Indigenous death. The brutal consequences resulting from the organized abandonment by the state is increasingly excused by pathologizing Indigenous people for consuming alcohol. That’s despite the fact that survey data indicates that over 42 percent of First Nations adults report not having consumed alcohol in the previous 12 months, compared to 22 percent of Canada’s general population.\n\nAt the same time, excessive and often dangerous drinking by white people is encouraged and enabled by the state for the profits of major alcohol-producing corporations at downtown sporting events, craft breweries, patio culture, and in gentrifying neighbourhoods. Off-duty cops are regularly found to be drunk driving while facing no punishment, even when they hit and kill bystanders.\n\n“Alcohol consumption is weaponized to keep Indigenous people down by shame and blame, and those who are consumers are often dismissed entirely by society and seen as disposable,” says Nickita Longman, a freelance writer, community organizer, and Saulteaux member of George Gordon First Nation in Treaty 4 Territory, in an interview with Canadian Dimension. “White folks are elevated with a vast variety of ‘classy’ options, and are invited into a lifestyle that celebrates their consumption.”\n\nThis hypocritical approach by the state to alcohol consumption is far from a new trend. The racist history of liquor control traces back to the genesis of colonial occupation of what is now known as Canada, evolving and reconstituting itself over the decades in new forms to justify the theft of land and resources, and to quash efforts towards self-determination. The policing of Indigenous alcohol usage has become much more visible recently—but it has been building for centuries.\n\n“There’s definitely been a shift in the last year,” says Adele Perry, historian and co-author of Structures of Indifference: An Indigenous Life and Death in a Canadian City. “But it’s a shift that’s premised on long history. Which is of course why it’s been able to happen. If it was just a shift that came from nowhere it wouldn’t have flown.”\n\nPolicing the crisis\n\nIt is important to clearly position oneself in this kind of work. I came to research and write about this topic as a white cis male settler who has only lived in Winnipeg for a few years. The cultural politics of alcohol consumption is something that I’ve been interested in both personally and professionally for a long while. I have written for Vice Canada about my own struggles with drinking, and reported for the Globe and Mail about how alcohol industry lobbying resulted in the removal of health stickers from bottles during a landmark scientific study.\n\nI had also made several somewhat serious attempts to quit drinking alcohol due to concerns about overreliance and potential health impacts (interviewing health experts about alcohol use will tend to do that, given the ever-growing body of scientific literature showing the extremely negative impacts of drinking—including cirrhosis, cancers, cardiovascular diseases, traumatic injury, violence, depression, and anxiety—and lack of political will to reduce harms). A close high school friend of mine died in a drunk driving crash, and other loved ones have been subjected to serious injuries and other very negative outcomes as a result of drinking.\n\nMy own alcohol use was not extreme, but it was regular, and I felt increasing shame and worry about it. This current effort to quit has been my most “successful” yet, with the end of July marking my one-year anniversary. I have experienced many positive outcomes from sobriety and had a desire to share these takeaways with others.\n\nBut this last year has also been an incredibly brutal one for alcohol policy in Winnipeg, with fear-mongering about a surge in alleged thefts from liquor stores and other retailers leading to exceptionally draconian policy responses. Several alleged thefts were covered by media for days after the fact, including the police killing of Eishia Hudson and a robbery and assault by a 15-year-old First Nations boy and two others that resulted in a Liquor Mart employee being knocked unconscious and suffering a concussion and repeated seizures since.\n\nThe carceral response to alleged liquor thefts—which accounted for a miniscule 0.2 percent of total sales in 2018, up from 0.13 percent the year prior, and fully factored into shrinkage calculations—predictably spilled over to other sites including supermarkets and retail stores. Anti-Indigenous racial profiling and white vigiliantism is continually on the rise, aided and abeted by state institutions.\n\nWithin this context of state crackdowns on Indigenous people for alleged theft of alcohol, it felt deeply inadequate to preach a gospel of sobriety from my position. Rather than contribute to the mountain of existing literature by white people talking about their drinking habits, I decided to collect research about how liquor control has been enforced against Indigenous people over time to undermine individual and collective self-determination. I wanted to better understand the ways that alcohol use had been weaponized by white people against Indigenous communities.\n\nTo help frame this research, I turned to the classic 1978 work Policing the Crisis by Stuart Hall and his co-authors at the Birmingham School of Cultural Studies, which sought to explain why the spectre of “mugging” had received such extreme amounts of public attention from media, politicians, and the courts by using the analytical tool of a “moral panic.”\n\nThey wrote:\n\nWhen the official reaction to a person, groups of persons or series of events is out of all proportion to the actual threat offered, when ‘experts,’ in the form of police chiefs, the judiciary, politicians and editors perceive the threat in all but identical terms, and appear to talk ‘with one voice’ of rates, diagnoses, prognoses and solutions, when the media representations universally stress ‘sudden and dramatic’ increases (in numbers involved or events) and ‘novelty,’ above and beyond that which a sober, realistic appraisal could sustain, then we believe it is appropriate to speak of the beginnings of a moral panic.\n\n\nQuite critically, Hall and his colleagues did not deny that mugging and street crime was not happening; they readily acknowledged that people had been robbed and assaulted, often resulting in significant physical and emotional trauma for the victims. They wanted to understand how everything from police statistics, to the social production of news, to conservative and liberal theories of “crime” had actively produced “mugging” (a description imported from the United States that combined several existing crimes) as a deviant act warranting immediate responses to manage the problem. The authors helpfully argued that institutions of social control “played an active role, not only in the control of anti-social behaviour but in how that behaviour was labelled, defined and publicly understood.”\n\nI am not bold enough to claim that I can do the same for liquor store thefts as Hall and his co-authors did for “mugging” in Policing the Crisis. However, through a brief inquiry into the history and contemporary manifestations of racist liquor control, I hope to help expand the scope of how we think about these acts of supposed “deviance” and the ways that carceral responses from police, media, and politicians functions to in fact produce deviance, legitimize draconian measures, and entrench colonial discourses that oppress and exploit Indigenous people.\n\nThere is no use pretending that liquor thefts or harmful alcohol use is not happening at all: my argument is that history repeatedly demonstrates that liquor control measures are used in explicitly racist and damaging ways—and that to think about reducing alcohol-related harms outside that context will reproduce the same devastating legacies.\n\n“Our communities are still in healing processes and creating communities of care and support are so crucial that our lives depend on it,” Longman says. “This discussion and growth must take place within our own communities. The settler state will not aid in this discourse because helping us would mean dismantling one of their most powerful weapons of oppression since contact.”\n\nAlcohol and ‘civilization’\n\nThe first prohibitions against alcohol consumption by Indigenous people were introduced due to concerns about disrupted commerce. European colonizers had often used hard liquor as the “lubricant” in trade negotiations with Indigenous peoples, intentionally watering down the alcohol to increase profits. Indigenous people reportedly spat the alcohol onto fire to test its quality, which is where the racist and debunked myth about a supposed genetic disposition to alcoholism got its name.\n\nA draft letter sent in 1893 concerning alleged liquor consumption by three Indigenous men living near Riding Mountain in southwest Manitoba. The letter describes resistance by the men to the Indian agent’s attempts to prohibit drinking, writing that they “do all they possibly can to defeat him in endeavouring to suppress the evil of intoxication among the Indians.” Photo courtesy of Library and Archives Canada.\n\nIn 1777, the British governor of Quebec introduced an ordinance that banned the selling or distribution of alcohol to Indigenous people because “many mischiefs may be occasioned by the practice of selling rum and other strong liquors to Indians.” Historian Robert Campbell, who specializes in the social history of alcohol, wrote in a 2008 journal article this ordinance may have been introduced due to concerns that liquor consumption would disrupt the fur trade, which remained foundational to the Quebec economy at the time.\n\nCampbell explained that colonial control over Indigenous people formally transitioned from military to civilian officials in 1830. This was marked by two transformations: the adoption of a “policy of civilization” that resulted in the creation of reserves and attempts to convert people to Christianity; and the downloading of “responsibility” for Indigenous peoples from Britain to Canada, which seized the opportunity to prohibit alcohol sales to Indigenous people.\n\nBans on alcohol sales escalated through the mid-19th century. Unsurprisingly, these policies emerged alongside white supremacist conceptions of race and citizenship. Campbell noted in his article that the Gradual Civilization Act of 1857 sought to assimilate Indigenous people into “civilization” if an Indigenous person could demonstrate “good moral character, which assumed sobriety,” alongside literacy and being debt-free. The “reward” for attaining citizenship was 50 acres of reserve land, representative of the colonial infatuation with rendering land “productive” through agriculture. Yet as historian Sarah Carter meticulously documented in her book Lost Harvests, the state systematically undermined and sabotaged efforts by Indigenous peoples to actually succeed at this, which in turn was used to justify further dispossession.\n\n“The sense of how white people belong to this place is built on ‘we deserve this because we tilled the land and we turned it into valuable things,’” says Leslie Sabiston—who is Manitoba Métis and a PhD candidate at Columbia University researching Indigenous and non-Indigenous relations in the health, criminal justice, and child welfare systems of Canada—in an interview with Canadian Dimension.\n\n“There’s so much of that historical resonance.”\n\nA National Policy of genocide\n\nThe racist policy of the Gradual Civilization Act tied Indigenity to blood—specifically male blood—and was further advanced with an amendment to the notorious Indian Act in 1884, which implemented a total ban on the selling of alcohol to “any Indian or non-treaty Indian, or to any person male or female who is reputed to belong to a particular band, or who follows the Indian mode of life, or any child of such person.”\n\nViolating the prohibition would result in a punishment of between one and six months in jail. The amendment also banned Indigenous people from licensed establishments, including Indigenous veterans from legions. The only way that Indigenous people could drink legally was through enfranchisement, the assimilative process terminating Indian status that was triggered by serving in the military, acquiring a university education, or an Indigenous woman marrying a non-status man.\n\nInterior of Molson’s Newfoundland brewery in St. John’s, 1910. Photo courtesy of Library and Archives Canada/Flickr.\n\nAt the same time, intoxicated colonizers were murdering Indigenous people. The Cypress Hills Massacre of 1873, when at least 20 Assiniboine people were killed by drunken American traders and wolfers, resulted in the deployment of the North-West Mounted Police (NWMP) in their “March West” to supposedly protect Indigenous people from whiskey traders (it had much more to do with colonial sovereignty than any kind of humanitarian goal). The massacre was triggered by alleged theft of horses from the traders, a reality with unsettling parallels to the killing of Eishia Hudson by Winnipeg Police for alleged theft of an SUV.\n\nA 1992 master’s thesis written by Nicholas Simons—oddly enough, now an MLA for the BC NDP—made the case that liquor control legislation emerged alongside the creation of the NWMP as tools “to establish Canadian sovereignty over the west, and to ensure that the Native population would not deter large-scale immigration to the Canadian west and thus impede the goals of the National Policy.” The National Policy was John A. Macdonald’s signature policy to build the Canadian Pacific Railway and increase immigration by white settlers in Western Canada, alongside other legislation such as the *Dominion Lands Act.\n\nSimons argued that due to the cost and impracticality of a full-scale military occupation throughout the West, policies of social control and coercion were required to subjugate Indigenous people: “Liquor control laws contributed to this erosion of Native autonomy, it provided a justification for the establishment of a police force, which in turn facilitated westward agricultural expansion,” he wrote.\n\nThe numbered treaties also started to be signed throughout this time, and included the banning of alcohol on reserve lands. This policy was not unilaterally imposed; as Harold R. Johnson writes in his 2016 book Firewater, Cree negotiators of Treaty 6—signed in 1876 and covering much of what is now central Saskatchewan and Alberta—explicitly requested a ban on alcohol. Johnson cited the Cree Council, who said: “When we see it we want to drink it, and it destroys us; when we do not see it we do not think about it.”\n\nRigid racial hierarchies\n\nWhile these policies were negotiated by Indigenous leaders for the betterment of their people, the colonial state approached the question in a deeply paternalistic and managerial way. Craig Heron wrote in Booze: A Distilled History that Indigenous inebriation was seen as representative of racial inferiority and through this legal process that “turned Native people into the equivalent of children under the law and closed off the indigenous peoples’ legal access to alcohol, they were constructing rigid racial hierarchies.”\n\nThroughout the early 20th century, prohibition of alcohol in the United States was exploited by white supremacist forces to terrorize Black and immigrant communities. Historian Lisa McGirr has explained that membership in the second Ku Klux Klan skyrocketed after the implementation of the Volstead Act, which banned “intoxicating beverages,” in 1920: “This issue was used instrumentally as a mandate to target those groups they already saw as enemies of white Protestant nationalism: immigrants, Catholics, and African Americans,” McGirr said in a 2015 interview with Slate. “And Prohibition provided a means for them to justify what became in a way kind of an enforcement activity.”\n\nThis policy of racial profiling alcohol consumption didn’t eliminate drinking by Indigenous people, despite heavy sentences for offenders. Heron reported that bootleg liquor continued to make its ways onto reserves, and was sometimes produced there. Another history describes Indigenous people “purchasing liquor from black market dealers and consuming it rapidly in back alleys and bushes.” As decades of academic research has demonstrated, prohibition rarely works as its architects intend it to and can instead lead to dangerously efficient consumption to avoid getting spotted by authorities.\n\nBans on consumption of alcohol by Indigenous peoples in Canada was also administered in highly discretionary ways. Sociologist Renisa Mawani wrote in a 2000 article that the existence of mixed-race people—such as the children of Indigenous women and white men—in 19th century British Columbia posed a significant threat to the white supremacist doctrines being leveraged to justify theft of land, as they were seen to represent “false claims” to citizenship.\n\nWhiteness, Mawani writes, was continually constituted in opposition to racialized others; these fluid yet rigid boundaries were challenged by mixed-race people. As a result, liquor prohibitions were “integral to maintaining racial and spatial boundaries and to keeping mixed-race people in their place, or, in other words, out of place.” Rather than reconstituting mixed-race people as status Indians, which would have required allocation of more reserve lands at the expense of colonial claims, the state used provincial liquor controls and segments of the Indian Act relating to intoxication to incarcerate and displace them from reserves.\n\nThis arbitrary and malleable enforcement also played out at the level of beer parlours themselves. In his 2001 book, Sit Down and Drink Your Beer: Regulating Vancouver’s Beer Parlours, 1925-1954, historian Robert Campbell stressed that racist discrimination against Indigenous people (as well as Black and Asian patrons) were frequently a “constructed assessment based on appearance and behaviour.” Campbell wrote of situations when a woman who was not Indigenous was prohibited from drinking because “her facial characteristics are such as to place a waiter in a beer parlour on his guard,” while a waiter who had illegally served a status Indian alcohol was absolved in court because “the Indian in question dresses in a very highly respectable manner” and he was thus justified in being unsure.\n\n“A First Nations person could pass as white or, just as important, be accepted as one if his behaviour and appearance were appropriate,” wrote Robert Campbell. “A banned mixed-race couple was a man of colour with a white woman. If the same man returned with an Aboriginal woman, the mixed couple ceased to exist.”\n\nIndigenous people were constituted through the law as uniquely vulnerable to the effects of alcohol. For example, the Liquor Control Board of Ontario (LCBO) produced an expansive “interdiction list” that barred “drunkards” from buying alcohol. Because of the complete ban on alcohol sales to Indigenous people, this list was erroneously referred to as the “Indian list.” Criminologist and sociologist Mariana Valverde described this as “cultural slippage between the identity of someone unable to govern her or his drinking and the identity of the Canadian Indian.”\n\nReplacing formal bans with informal segregation\n\nPressure for changes to racist prohibition measures increased following the Second World War and the ongoing inability for Indigenous veterans to drink at legions.\n\nInterviews conducted in the early 1950s of Indigenous people in British Columbia found “a deep sense of injustice because they are fined and sent to provincial prison for drinking, a pleasure which white persons enjoy with impunity” and that “drinking has become associated with political consciousness and has grown into a symbol of native solidarity.” Campbell cited one of these interview subjects, who said: “When I get drunk I keep thinking about all the crooked things the white people have done to us, and I keep getting madder and madder—and pretty soon I am ready to fight.”\n\nLiquor Commission storefront in Fort Garry, Manitoba, November 11, 1957. Photo courtesy of the Winnipeg Tribune Photo Collection/University of Manitoba.\n\nThe Indian Act was amended in 1951 to permit alcohol consumption in licensed establishments. These changes were part of an ongoing assimilative campaign; a 1955 report prepared about Manitoba’s liquor policies quoted an Indian Health Services official who viewed easing liquor controls as part of the process of the “complete assimilation of the Indian.” These broader colonial ambitions continued throughout the 1960s, including the Sixties Scoop and Pierre Elliot Trudeau’s 1969 White Paper that proposed the abolishing of the Indian Act and treaties for the purposes of full assimilation of Indigenous peoples—which triggered a new wave of resistance, including Harold Cardinal’s Red Paper of 1970.\n\nThe provinces were now responsible for liquor policy, and maintained a deeply paternalistic framework that treated Indigenous people as morally incapable of consuming liquor responsibly. Indigenous people continued to be prohibited from government liquor stores and private clubs.\n\nPerry says the notion of “respectable access” to alcohol was increasingly used as a means of social control, which amounted to a continuation of “de facto segregation” (even though the Indian Act no longer barred the sale of alcohol to Indigenous peoples). For example, a history of The Pas in Northern Manitoba by Owen Toews notes that in the 1960s: “The Legion in town didn’t acknowledge Cree Second World War veterans. The Gateway Hotel lifted its ban on serving Cree people but segregated the barroom.”\n\nThe northward expansion of the colonial state and extractive capital exposed already oppressed communities to the harmful effects of alcohol use. Manitoba Hydro’s construction of the Grand Rapids Dam “transformed life virtually overnight and a powerful mix of alcohol abuse and racism fed tensions between the now outnumbered locals and the newcomers.”\n\nHarold Johnson wrote about the fallout from the opening of the Anglo-Rouyn Copper Mine near Lac La Ronge, Saskatchewan. Elders from a community in the territory, he wrote, “had no teachings, nothing to look back upon, no cultural stories to help people who were asking them what to do about increased violence caused by alcohol.”\n\nAlthough status Indians were legally allowed to consume alcohol after 1951, they couldn’t become intoxicated off their reserve. This racist double-standard was challenged in the Supreme Court of Canada by Joseph Drybones, who was fined for becoming intoxicated at a Yellowknife bar in 1967, and resulted in his acquittal and eventual repeal of the relevant Indian Act section in 1971. In 1985, the federal government completely repealed the legislation’s sections pertaining to liquor through the passage of Bill C-31, which more famously removed the sexist “marrying out” rule (in which women who married a non-Indigenous man would lose their Indian status).\n\nBand councils were allocated responsibility for determining policy about the sale and possession of liquor, resulting in the creation of “dry reserves.” Johnson, writing in his book Firewater, argued that these self-administered bans have not been successful: “The death rate continues. It seems that those communities that have banned alcohol are the ones that suffer the most.”\n\nModernizing oppression\n\nOver several decades, the colonial state rescinded its direct control of alcohol consumption by Indigenous people and downloaded regulatory powers onto individual communities.\n\nBut that didn’t mean that Indigenous people stopped being policed for alcohol use: far from it. Many legal and cultural prohibitions emerged in the place of formal Indian Act restrictions that maintained its racist legacy in more covert ways, increasingly framing interventions within the discourses of public health and safety. Racist tropes about Indigenous alcohol consumption continue to manifest in very visceral ways, despite supposed legality of the action of drinking.\n\n“If I’m at a fancy event at the Fairmont in Winnipeg and everybody is handing out free wine, you’ll never guess who feels really anxious about it and likely is not going to drink anything because of that possible perception,” says Michael Redhead Champagne, a Winnipeg community activist and member of Shamattawa First Nation, in an interview with Canadian Dimension.\n\n“I recognize that as a visible leader in the community, even me consuming one glass of wine at a gathering where 99 percent of the rest of the room is also consuming free wine to me is reinforcing those tropes,” he explains. “I feel like there is a disproportionate weight and burden that Indigenous leaders are carrying when it comes to health, when it comes to harm reduction, and when it comes to living in community at large. Non-Indigenous people are allowed to drink alcohol as much as they want.”\n\nThis racist perception of Indigenous drinking remains deeply ingrained in society. Three tightly interlinked and overlapping aspects of this systemic oppression will be examined: family separation and pathologization of Indigenous drinking, particularly by youth; alcohol-related bail conditions and the ongoing remand crisis; and gentrification and the physical destruction of Indigenous drinking spaces.\n\nCombined, these help show how the discourse of Indigenous alcohol consumption—and alleged theft from liquor stores—has taken on such power and in turn justified brutal carceral responses, including the police murder of 16-year-old Eishia Hudson. To paraphrase an argument from Policing the Crisis: “Once you perceive ‘liquor theft’ not as a fact but as a relation—the relation between crime and the reaction to crime—the conventional wisdoms about ‘liquor theft’ fall apart in your hands.”\n\n‘There’s always been a fear of future Indigenous generations’\n\nLeslie Sabiston used to work with young Indigenous men, caught up in the justice system during Winnipeg’s notorious auto theft spree.\n\nThroughout the mid-2000s, Winnipeg had the highest rates of motor vehicle theft in North America. In response, the Winnipeg Auto Theft Suppression Strategy was created, bringing together the Winnipeg Police, Manitoba Public Insurance, and Manitoba Justice to create a draconian crackdown including offenders being outfitted with ankle monitors, house arrest, and curfew checks every three hours.\n\nSabiston recalls that many people in the field of social services couldn’t figure out why the youth he was working with—some of the top car thieves in Winnipeg—were stealing cars and, in some cases, ramming cop cars while trying to get away. Fetal alcohol spectrum disorders (FASD) filled that gap.\n\n“FASD came to fill in a lot of blanks and very quickly became a compelling explanatory tool for many people,” Sabiston explains. He says it was “pernicious in how it quickly came to conflate criminological concepts with popular psychological and behavioural ideas and understandings, all at the expense of more sociological and political explanations, such as mass inequality and systemic racism, that are more empirically verifiable and robust.”\n\nSabiston says much of this discourse first emerged out of foster and adopted homes, tracing back to the Sixties Scoop, which has been concisely described as the “mass removal of Aboriginal children from their families into the child welfare system, in most cases without the consent of their families or bands.” Sabiston says there was no formal “Sixties Scoop” policy, but the large-scale apprehension of Indigenous children filled a policy vacuum after residential schools began to be shut down and social workers started replacing the roles played by Indian agents.\n\nWhite parents largely combined their own desire for having a family with “a sense of altruistic discourse of saving or rescuing Indigenous children from poverty and depravity,” he says. While the process was ultimately a failed effort of assimilation, Sabiston stresses that it played out along complex lines of individual desire and feelings, and circumscribed concepts of “family,” “love,” and “care” that Indigenous children couldn’t be “fit” into.\n\nAn estimated 80 to 90 percent of Sixties Scoop placements ended in “breakdown” in which the child left the home or was put into foster care. Sabiston says that FASD emerged as a prognosis for why Indigenous youth weren’t integrating into white families.\n\n“It became this overriding explanation,” he says. “That’s where it became very racialized and criminalized. “Because these kids are having such a hard time, and it’s such a major sociological phenomenon that you have all these Indigenous children that have been taken from their families, uprooted, families destroyed and then placed into this other very different environment: socioeconomically, racially, religiously,” he adds.\n\n“They just thought it was going to be fine. Of course, it wasn’t. And then 20 years later it’s like ‘oh my god, what do we do with these kids?’ There’s these massive unforeseen outcomes that happen from things like the Sixties Scoop.”\n\nFASD is notoriously difficult to diagnose. It’s also not a specifically Indigenous disorder, as popularly assumed. Sabiston says discussion of an individual’s supposed condition almost always relies on popular wisdom without scientific backing: “Oh yeah, he probably has it” or “he looks like he has it” or “he acts like he has it.” Even seemingly progressive interpretations of the condition that acknowledge the role of colonialism and intergenerational trauma can end up pathologizing the person as irreversibly damaged, justifying “wrap-around care” from social services that lead to even more surveillance and securitization.\n\n“Ultimately it’s still an incarceration issue: how do we manage them?” Sabiston says of that discourse. “How do we get these kids off the street?” He adds that child welfare and youth incarceration are “very continuous with one another” in this way, working to “house the epidemic of uprooted and displaced Indigenous children created by generations of violent colonial policy.”\n\n“That translates into other cultural motifs of these dangerous, ‘out of control little Indians,’” Sabiston says. “There’s always been a fear of future Indigenous generations.”\n\nA poster produced by the Ontario Ministry of Health in 1978 to deter alcohol consumption. Image courtesy of Library and Archives Canada.\n\nAlcohol use acts as a floating signifier pathologizing Indigenous people, whether allegedly consumed by the parent or individual. This applies especially in death. Robert Cross, the Winnipeg Police officer who shot and killed Indigenous leader J.J. Harper in 1988, explicitly blamed Harper’s death on his alleged drinking: “The natives drink and they get in trouble,” he told a journalist. “Blaming the police for their troubles is like an alcoholic blaming the liquor store for being open late.” Two Métis sisters who repeatedly called Winnipeg Police for help before being stabbed to death in 2000 were disregarded by 911 operators, with one responding “everybody’s had a few to drink there, is that right?” before accusing them of lying.\n\nIn January 2018, the Globe and Mail was slammed for its article reporting that 15-year-old Tina Fontaine—pulled out of Winnipeg’s Red River four years earlier—“had drugs, alcohol in [her] system when she was killed.” The Assembly of Manitoba Chiefs denounced the wording in a letter to the newspaper’s editor-in-chief, arguing the headline undermined the fight for missing and murdered Indigenous women and girls and “serves to erase these memories from the public collective and replace them with the thought that she is just like the rest of them—‘another dead Indian.’”\n\nDelilah Saunders, whose own sister Loretta was killed a few months before Tina, wrote in an article for Flare that “this is so often what we hear about an Indigenous woman or girl who is missing or found murdered. Reported stories discuss her lifestyle, often labelling it as high-risk. The story might mention sex work or drug use. This narrative is dangerous because it dehumanizes Indigenous women, girls and two-spirited peoples.”\n\nThe same framing occurred in media and legal processes following the killings of 22-year-old Colten Boushie in 2016 by Saskatchewan farmer Gerald Stanley and 16-year-old Eishia Hudson in 2020 by Winnipeg Police: Colten reportedly had a blood alcohol level three times the legal limit when he was killed, while Eishia had allegedly stolen liquor from a liquor store. These narratives are exploited to help justify or explain away Indigenous death, like narratives about FASD are harnessed to account for teens not being able to “fit” in with white families.\n\n“With Tina Fontaine, Colten Boushie and Eishia Hudson in particular, the public narrative of their involvement to alcohol leading up to their death or the toxicology reports filed after death, were paraded in the media as if they offered up some kind of justification in their murders,” Longman says.\n\n“The way these cases were presented by the media tells us that predatorial behaviour, police violence and murder over property at the hands of white people are lesser crimes that shall go unpunished. Further, the nature in which they were presented also suggests that alcohol and substance consumption by Indigenous youth is reason enough for their death. It is a direct link to protecting and upholding white supremacy and white violence.”\n\nThe pathologization of Indigenous death was described as a process of “psychocentrism” by York University sociologist Mandi Gray in a 2016 article about inquests into two Indigenous youth hanging themselves in the Manitoba Youth Centre, a provincial jail in Winnipeg, in 2010.\n\nWhile these deaths didn’t explicitly relate to alcohol use, Gray’s analysis of how the inquest recommendations “demonstrate the constitution of transgressive subjects via the construct of the defective Indigenous body” can be similarly applied to how Indigenous youth become ascribed by alleged alcohol consumption—FASD, intoxication, so-called antisocial behaviours—that in turn justify “institutional remedies.”\n\n“They present the Indigenous psyche as something in need of repair, and settler colonial society as both the standard of normalcy and health, and the exemplar of how these young women should learn to behave, despite the challenges posed by their backgrounds,” Gray wrote.\n\nThis pathologization allows the settler-colonial state and its citizenry to absolve itself from responsibility for failing to provide basic necessities of life such as housing, food, and healthcare, and family separation through the child welfare system, incarceration, and police violence. The white supremacist obsession with racial purity and blood quantum has merely advanced a new object to produce authority and surveillance over alcohol, measured and disciplined by blood. The Indigenous person becomes marked by alcohol, regardless of whether they actually drink, while all other issues of colonialism, trauma, and organized abandonment by the state are disregarded.\n\n“Because of these systems of family separation, Indigenous kids have to often commit these acts of ‘alleged theft against the state’ in an attempt to access the resources that they need that are not being provided for them to live a healthy life,” says Champagne about alleged liquor thefts by Indigenous youth, including Eishia. “Why aren’t they living a healthy life? Let’s take a look at the systems of family separation that young people are dealing with.\n\n“And I don’t know Eishia’s story, but I know the story of too many other young people in my life who have had this relationship with substances or this relationship with alcohol or crime,” he adds. “And I know these young people are not doing this to hurt others. I know these young people are doing the best that they can with the tools that they have available, which are super limited.”\n\nIncarcerated for drinking\n\nThis pathologization of Indigenous alcohol use is fully systematized through carceral policies such as conditions linked to bail (charged and awaiting trial), probation (part of or the entirety of a sentence), and parole (early release from jail or prison).\n\nFor example, Errol Greene was arrested in 2016 for breaching a bail condition to abstain from alcohol, with the condition resulting from being charged for mischief a few months earlier.\n\nGreene, a 26-year-old Indigenous man, was incarcerated at the Winnipeg Remand Centre for the bail breach. Two days later, after being repeatedly denied access to anti-seizure medication by correctional officers, he died of internal bleeding in hospital. Greene’s death was an extreme example of the consequences of alcohol consumption being policed through the so-called justice system: he had not even been convicted for mischief, but was killed by the state due to the criminalization of alcohol use as a bail condition.\n\nDespite supposed improvements in sentencing practices with the use of Gladue reports—which detailsan Indigenous person’s history and pertinent conditions such as suspected FASD or substance use issues for a judge to consider—alcohol consumption remains a key tool for police and courts to control the actions and movements of Indigenous people.\n\nAn image produced in 1977 depicting a suspicious-looking man exchanging cash for bottles of alcohol at the window of an unidentified building on reserve. The Indigenous man in the building is saying, “Hah-Aii,” as both look at the police car that is approaching with its sirens blaring. This caricature is a reference to the popular film, The French Connection. Image courtesy of Library and Archives Canada.\n\nThis has the most extreme impacts in Manitoba and Saskatchewan, where three-quarters of all adults admitted to custody are Indigenous. An estimated 70 percent of prisoners in provincial jails in Manitoba are held in remand—meaning they haven’t been convicted for a crime but couldn’t get bail, or breached a bail condition—which is the main reason for the province having by far the highest per-capita incarceration rate in the country. The situation is somehow even worse in Northern Manitoba, where accused people have been required to spend months waiting for a bail hearing and having to be transported 400 kilometers in a prison van between The Pas and Thompson.\n\nWhen an accused person is let out on bail, the Crown recommends bail conditions that are supposedly related to the offence. However, University of Winnipeg criminal justice professor Bronwyn Dobchuk-Land says in an interview with Canadian Dimension that conditions are often unrelated to the offence and nearly impossible to abide by.\n\nPolice exert a considerable amount of influence over what charges are laid, often throwing an array of recommended charges at a person at hoping a few will stick when the Crown makes its decision. Dobchuk-Land says the Crown often selects charges with the lowest burden of proof if there isn’t a lot of evidence, resulting in charges like mischief (which Errol was charged with). The number of charges against a person also influences whether a judge determines whether to let someone out on bail or remand them into custody until trial.\n\nA 2014 article by criminologist Justin Piché attributed some of the spike in remand population across Canada to risk aversion (of an accused person not showing up to a court appearance or committing another highly publicized crime while on bail) by the carceral system, resulting in more charges being laid and more bail conditions placed.\n\nA report by the Canadian Civil Liberties Association (CCLA) published that same year, titled Set Up to Fail: Bail and the Revolving Door of Pre-trial Detention, said that court orders to abstain from consuming alcohol was one of the most frequent bail conditions used, appearing in 45.5 percent of bail orders. Another 22.7 percent of bail orders in Manitoba prohibited the accused person from entering any establishment whose primary source of revenue is from alcohol sales.\n\nOther frequently used bail conditions include prohibitions of weapons possession, not appearing at certain addresses or being in proximity of particular people, or not contacting victims or witnesses of the alleged crime. Over half of all bail releases in Ontario were required to attend treatment or counselling, according to the report.\n\nKatherine Bueti, founding senior partner of the Winnipeg criminal defence law firm Bueti Wasyliw Wiebe, says the way that courts have dealt with alcohol and bail conditions have changed over the last decade, evolving from an automatic condition on virtually every bail to something more specifically catered to people facing substance-related charges—such as impaired driving or possession of drugs or crimes allegedly committed in furtherance of drug use such as property theft for the purposes of alcohol or drug procurement. She says that conditions are increasingly applied based on perceived ability to comply, although “some judges will still impose it no matter what.”\n\nBreaching a bail condition can result in an administration of justice charge, a criminal offence. The CCLA report found that administration of justice charges were the most serious charge in 20 percent of all criminal and federal cases, with half of those resulting from bail breaches. Manitoba’s zero-tolerance bail breach policy, introduced by the provincial NDP, means that an accused person can be busted for being a few minutes late to a meeting and removes discretion whether to breach someone on bail for violating a condition.\n\nBueti says there are a “litany of reasons” as to how an alcohol-related bail violation comes to the attention of police, including calls from an observer notifying them of a person becoming intoxicated or police investigating a noise complaint or a similar issue coming across a breach. Police may also identify intoxication based on erratic behaviour that they can’t explain, slurring words or lack of balance, or if it’s someone who police are already familiar with.\n\n“If there’s anything that sort of makes them suspicious or a little leery, they will note it in their report and that triggers the process,” Bueti says. “Often, what will happen is they will ask people ‘have you ingested any alcohol or drugs?’ Maybe they’ll ask other people around.”\n\nBueti says that every bail breach warrants jail time, up to 30 days on average for each breach. That jail time can compound based on the number of breaches, escalating to 45, 60, or 90 days.\n\nSimilarly, breaking a parole condition lands a person right back into the system. A lengthy profile about 37-year-old Elliot Hudson was published earlier this year by Global News, chronicling the Ottawa man’s struggles with alcohol use. Hudson was paroled in 2019 but started drinking five days later, which violated one of his parole conditions: “He woke up hungover and scared,” wrote journalist Jane Gerster. “He worried he wouldn’t be able to stop drinking again, so he called his parole officer to come clean. He thought she might be able to steer him towards a detox centre or some sort of community-based treatment. She issued a Canada-wide warrant for his arrest.”\n\nDobchuk-Land says that this process of alcohol-based release conditions serves the strategic interests of Winnipeg Police, who are increasingly focused on doing “proactive policing” through their so-called “smart policing” initiative rather than “reactive policing” that primarily responds to calls.\n\nThis “proactive” approach “relies heavily on the policing of people with existing conditions and the policing of places where those people live and work,” Dobchuk-Land says. That gives police legal justification to “check up” on people with bail or prohibition conditions and breach anyone who they find in violation, including consuming alcohol or being in a bar. Dobchuk-Land says it’s a “very useful tool” for police to monitor people.\n\n“One of the mechanisms through which the police have so much power is that they’ve been able to enter so many people into the system so that so many people are living with conditions so everything is a legal intervention and they can breach people so there are many administration of justice breaches,” she says.\n\nThis process reflects an earlier orientation established with the aforementioned auto theft suppression strategy and expanded with the subsequent gang suppression strategy, in which key offenders were identified and subjected to ankle monitoring, house arrest, and near-constant surveillance.\n\nDobchuk-Land says that this focuses on policing individual people rather than policing incidents, something that had always informally existed in the criminal justice system but was formalized in these strategies. The same is now playing out with the response to alleged liquor thefts, with the provincial liquor corporation posting a list of people charged with theft on their website and a Crown prosecutor assigned to specifically prosecute alleged liquor thieves—a highly focused effort made even more concerning in conjunction with the new security screening process that scans IDs with next to no transparency about the usage of personal information.\n\nIn November, the executive director of the Canadian Civil Liberties Association told CBC News: “There’s no way that they should be able to swipe people’s ID cards or driver’s licences, because then they’re going to be getting data that goes way beyond whether or not the person is the legal age.”\n\nOf course, alcohol use doesn’t end when someone is incarcerated: it simply makes it even harder to access. Many prisoners make homemade alcohol out of various food products, resulting in 4,300 seizures of alcohol between 2012 and 2016 by Correctional Service Canada. Ivan Zinger, the correctional investigator of Canada, estimates that 80 percent of prisoners have a history of substance use and two-thirds were intoxicated when they committed a crime.\n\nAll of these measures help advance the pathologization of alcohol use by Indigenous people, combining with discourses around family separation, FASD, and death to maintain it as an object of individual and social concern that has to be managed through increasingly drastic measures. Alcohol use, along with drug use more broadly, serves as a ready-made justification for intervention and control, built upon decades and centuries of racist mythmaking and surveillance of who is allowed to drink.\n\n“It’s a really jarring division in terms of people who are allowed to live without police harassment versus people who are legally subject to police harassment,” Dobchuk-Land says.\n\nDemolishing Indigenous drinking spaces\n\nDespite alcohol consumption by Indigenous people being made legal in 1951, the R v Drybones decision of 1969 allowing intoxication off reserves, and regulatory powers downloaded to band councils in 1985, racist liquor control measures continued advancing through the pathologization of Indigenous people and alcohol-related carceral policies resulting in a deadly remand crisis.\n\nSupposedly progressive reforms have only entrenched discrimination in more pallatable forms. Unsurprisingly, this expansion of racist liquor control has grown outwards from the individual person, and the carceral state of police, jails, and courts, to the urban geographical form itself. Over the last several decades, developers and politicians in Winnipeg have actively sought to eradicate Indigenous drinking spaces through gentrification and violent policing practices, physically replacing them with bars and parties for rich white people to enjoy.\n\nThis process was meticulously detailed on Owen Toews’ 2018 book, Stolen City: Racial Capitalism and the Making of Winnipeg. In it, he argues that a system of urban apartheid prevented Indigenous people from accessing many of Winnipeg’s bars, hotels, cafes, restaraunts and other public spaces throughout the postwar period—especially those south of Portage Avenue, which were “bitterly inhospitable” to Indigenous people. As a result, Main Street and the North End became hubs for Indigenous people to gather, including for music and radical political organizing. Bars and hotels that sold alcohol were key parts of this geography.\n\nToews writes about how, against the desires of community members who were advocating for an Indigenous development vision for the Main Street strip rooted in Indigenous-owned housing, schools, and businesses (called “Neeginan,” Cree for “our place”), the City of Winnipeg cast the area as “a pathological danger” that “ought to be policed, contained, and eventually eliminated.” Many of Main Street’s hotels were bulldozed and replaced with shelters, food banks, and an opera house. This displaced the bar scene to the Bell Hotel on Main Street and the St. Regis and Garrick Hotels, both south of Portage Avenue.\n\nThese hotels then became the focus of CentreVenture and the Chipman family’s ambitions to remake downtown Winnipeg for luxury condos and the much-anticipated return of the Winnipeg Jets. CentreVenture was created in 1999 by city council as an arm’s length corporation with funding from the state to develop dozens of municipally owned properties in Winnipeg’s downtown.\n\nToews writes that “the very existence of CentreVenture and its new plan indicated the impossibility of capitalist markets functioning without police and a litany of other state supports,” which included the Winnipeg Police’s “Operation Clean Sweep” to police so-called “disorder” and an assortment of police cadets and downtown business patrols. Its first objective was to buy up and close the Bell Hotel in 2007 due to complaints from other businesses in the area about the impacts of its alcohol sales (this resulted in the eviction of 75 residents with no relocation program). According to Toews, the closure of the Bell Hotel’s bar “eliminated one of the few remaining unsupervised gathering places for neighbourhood residents.”\n\nThis process of “retaking the city”—which geographer Neil Smith articulated as a question of “on whom is revenge to be exacted?”—was swiftly followed by a campaign to destroy hotel and beer vendors in the city’s downtown; this plan was justified using an NDP-commissioned report that recommended the destruction of at least seven downtown hotels. This resulted in the buying up and closing of the St. Regis to specifically shut down its bar, and destruction of the Carlton Inn. Both of these were long-time hubs for Indigenous people that were frequently slandered by the city and its obedient media class as “unsafe” or “troubled property” and making people feel “uncomfortable” due to alleged public intoxication and aggressive panhandling.\n\nAll of this was to make way for the so-called SHED—the “Sports, Hospitality, and Entertainment District”—which would serve as the centrepiece of the new hockey arena to house the Winnipeg Jets, alongside the new downtown police station. In an interview with Canadian Dimension, Toews says that CentreVenture explicitly tried to push the local Indigenous community out of the area by targeting Indigenous bars.\n\n“They wanted to get rid of people,” Toews says. “Alcohol consumption is used as an excuse just to get rid of people. It makes them an easy target.\n\n“They very explicitly targeted the bars at the St. Regis and Carlton hotels because it was Native people who went there and lived there, and because those properties were in close proximity to properties that were being redeveloped and significantly invested in,” he explains. “They wanted to get Indigenous people away from their investments. I think they used that long tradition of white people not tolerating Native people drinking as an excuse to get Native people away from those properties.”\n\nIn the place of these previous sites of Indigenous gathering, CentreVenture and its corporate partners constructed a new assortment of bars and drinking establishments—but for a rich white clientele: suburbanites visiting the downtown for a Jets game, or lawyers and start-up bros living nearby in newly constructed condo towers. The Carlton Inn was literally replaced by True North Square, a series of luxury towers that now houses, among other things, a provincial liquor store (and received an exemption from the city to build affordable housing units). The MTS Centre, the arena where the Winnipeg Jets play, was described by Toews as what “could well be the single largest concentration of public intoxication between Calgary and the Great Lakes.”\n\n“These are intense spaces of alcohol consumption and white drunkenness,” says Sabiston about the Winnipeg Jets Whiteout parties and Canada Day celebrations in Osborne Village. “Violence is happening: people are getting into fights, people are getting stabbed. It’s acceptable somehow.”\n\nGetting routinely buzzed at the Forks, hip microbreweries, over mimosas at brunch, or while drinking in parks are regarded as acceptable habits, so long as the participants are white. Longman says: “Alcoholism within white society is entirely normalized, and at times, even fetishized. Alcoholism is so celebrated within whiteness that it is marketed and branded as a lifestyle.”\n\nSuch drinking habits can lead to people of colour feeling less safe, with drunk people more likely to carry out racist attacks.\n\nToews says that CentreVenture and the downtown “business improvement zones” continue to obsessively stalk where Indigenous people drink, to try displace them from the area in fear that they will jeopardize private investments and white comfort. The washrooms at popular downtown bars are locked to discourage the “wrong kind of people” from using them. Last October, Manitoba Liberal leader Dougald Lamont and Winnipeg Mayor Brian Bowman advocated for the closure of a downtown Liquor Mart where large quantities of high-alcohol sherry is sold.\n\nThe geography of racist liquor control policies continues to expand and reconstitute itself in the name of “community safety” and “downtown revitalization,” destroying and displacing Indigenous people and drinking spaces.\n\nAs Toews suggests, it is key that we understand this process as highly intentional, rather than a series of well-meaning mistakes. Hotels and bars used by Indigenous people were explicitly targeted by developers and politicians as sites that needed to be removed and replaced with gentrified establishments selling craft beer and $15 cocktails to attract a rich and predominantly white clientele to generate private profits—and hopefully move into the high-end condos in the area.\n\nTo succeed, these discourses combined centuries-old discriminations against Indigenous people: that they can’t hold their liquor, that it irrevocably damages them, that it explains their poverty and death and incarceration, that they need to be forcibly separated from it for their own good. It also rejected outright alternative development visions for Winnipeg created by Indigenous people, instead advancing a racist and alcohol-entrenched reconfiguration of the city.\n\nAn image depicting a long RCMP paddy-wagon parked outside a bar. At the back of the paddy-wagon an RCMP officer is holding the door open for an Indigenous man. Image courtesy of Library and Archives Canada.\n\nAlternative visions\n\nThis article has sought to demonstrate how racist liquor control measures have evolved and become entrenched over time to maintain the oppression and exploitation of Indigenous people.\n\nThroughout this history, alcohol has been weaponized to justify the expansion of policing and to discipline citizenship through practices of enfranchisement and liquor service based on arbitrary readings of race (and mixed race). It has flooded remote communities via man camps for the purposes of resource extraction, leading to extreme social disruption and danger for Indigenous women and girls. While outright bans on liquor consumption by Indigenous people have been gradually removed, significant discrimination remains, typically in the vocabulary of “public health” and “community safety.” Three of these manifestations have been briefly explored: the relationship between family separation, FASD discourse, and pathologization of Indigenous death; alcohol-related bail and probation conditions; and gentrification and destruction of Indigenous drinking spaces.\n\nThese are far from the only relevant aspects—but serve as some fundamental explanations for how and why the racist moral panic about alleged liquor store thefts has taken on such public resonance. Many aspects of history are now repeating, quite literally: historian Adele Perry notes that by introducing secure entrances with ID scans, the provincial liquor stores are bringing back the physical format that they had until the 1970s in which all alcohol was kept behind a desk and retailed based on a politics of “respectable access.”\n\n“Liquor is just ready in this particular context of Western Canada to become a focus of a lot of anxieties about safety, about the social order, about race, about morality,” Perry says. “It’s just ready to roll.”\n\nPolicy discussions around “community safety” in Winnipeg continue to be controlled by pro-police politicians and organizations. Organizations like Millennium for All, which is fighting to get airport-like security measures removed from the city’s downtown library, have frequently challenged this trend by asking “public safety for whom?” and working to differentiate feeling “uncomfortable” from feeling “unsafe.”\n\nHowever, groups advocating for a different definition of community safety continue to be sidelined by the city’s power brokers. Sabiston notes that Indigenous people are often invited to participate in committees to make positive contributions without any access to funds or power to actually influence structural changes. Champagne points out that the City of Winnipeg recently spent $150,000 on a report from consulting giant MNP about “crime prevention” while simultaneously awarding a measly total of $100,000 to 23 community groups including the North End Women’s Centre, Mama Bear Clan, and the Immigrant & Refugee Community Organization of Manitoba for frontline community safety and crime prevention (receiving a max of $5,000 each).\n\n“I think the City of Winnipeg needs to look at the way it’s allocating its dollars in crime prevention,” he says. “Maybe $150,000 for a report versus $100,000 for 23 groups doing frontline family support: there might be a little bit of confusion of which one is more important.”\n\nAs always, there are many alternative visions for society that fights back against racist and carceral policies which result in Indigenous dispossession and death. History is not fate, and we can organize for different material conditions if a clean break is made from existing discourses of liquor control.\n\nOnce again, this does not suggest that harmful alcohol use does not exist, or that people do not experience the impacts of alleged thefts and assaults. Rather, as Black and Indigenous abolitionists have been stating for decades, the reality is that punitive measures do not resolve these issues. In a recent podcast episode, Ruth Wilson Gilmore said: “The threat of violence and actual expression of violence—interpersonal—only produces more of itself. This is the knot we’re trying to untangle: knowing how difficult it is to let go of the feeling—which is real, I’m not saying it’s not real—to let go of the feeling that you want to hurt somebody who hurt you.”\n\nThe same approach can be applied to issues of alcohol use and its associated social impacts.\n\n“The best place to start undoing the harmful perception of alcohol consumption within our own Indigenous communities is learning more about and engaging in harm reduction,” Longman says. “While alcoholism remains present within our communities, understanding more about users and their needs would reduce the stigmatization we are so used to from the settler state and within our own lives.”\n\nWhile harm reduction is frequently discussed for drugs such as heroin via safe consumption sites, decriminalization, and safe supply, there is less explicit discussion about the same approaches being taken to alcohol use. Part of that is likely attributed to the near-universal public acceptance of drinking, as part of what author Ann Dowsett Johnston describes as an “alcogenic” society. A renown substance use researcher once told me that he had been attending international harm reduction conferences for the previous 25 years and has tended to be the only one talking about alcohol.\n\nBut there are very successful harm reduction programs designed for alcohol users, including managed alcohol programs in which people are provided with a regular and tailored dose of alcohol to reduce acute harms (particularly for people consuming non-beverage alcohol such as mouthwash). As Champagne says, these programs means that people “can have access to the things that they need to care for themselves and reduce harms over time.”\n\nTo be sure, sobriety can be a helpful solution for some people. But abstinence-only programming such as Alcoholics Anonymous have long been critiqued for their lack of scientific rigour and long-term success: that doesn’t mean it doesn’t work for some, but it certainly doesn’t work for everyone. As indicated by the name, harm reduction takes the approach of minimizing the most harmful aspects of alcohol use while promoting individual self-determination (which may mean continued alcohol use, or a shift to less or even no use). As the lengthy Atlantic feature critiquing AA put it, “promoting abstinence as the only valid goal of treatment likely deters people with mild or moderate alcohol-use disorder from seeking help. The prospect of never taking another sip is daunting, to say the least.”\n\nChampagne says this approach can be integrated into community-based safety measures at liquor stores, replacing security with community hosts like those used at various non-profit health centres in Winnipeg. These kinds of responses can connect people with resources, rather than threatening them with police and other carceral responses.\n\nAs argued throughout this article, liquor control tends to be far more about control than liquor. It has been part and parcel of a network of genocidal policies of colonialism: residential schools, forced relocation, family separation, police violence, missing and murdered Indigenous women and girls, evictions and displacement, and ongoing dispossession from lands and waters. Rather than relinquish colonial management of Indigenous peoples, the state reconstitutes liquor control as a means of justifying continued interventions.\n\nAlcohol use can be a problem, as can pretty much anything. But resolving such issues cannot be done by the capitalist state. In fact, it is antithetical to its mission of privatization, deregulation, and cuts to social services. Addressing these harms requires a radical commitment to life-sustaining services—housing, harm reduction, mental health and substance use resources, food security, income supports—and a dismantling of the carceral state.\n\n“Secure housing is probably the most obvious thing,” Sabiston says when asked what Indigenous youth who he worked with could benefit from. “So many of our youth are bouncing from house to house to house, don’t even have their own clothes, are always trading clothes. There’s certain low-humming anxieties and structures of uncertainty that the rest of us just don’t have to deal with. That has such a huge impact.”\n\nMeanwhile, Longman emphasizes that solutions must address child apprehension, ongoing land disputes, and policing of Indigenous people.\n\n“True justice would look like returning children back to their Indigenous communities, returning land back, and dissolving the police force,” Longman concludes. “Spending priorities would instead address housing solutions, harm reduction and safe injection sites, mental health supports, and Indigenous-led healing resources.”\n\nJames Wilt is a freelance journalist and graduate student based in Winnipeg. He is a frequent contributor to CD, and has also written for Briarpatch, Passage, The Narwhal, National Observer, Vice Canada, and the Globe and Mail. James is the author of the recently published book, Do Androids Dream of Electric Cars? Public Transit in the Age of Google, Uber, and Elon Musk (Between the Lines Books). He organizes with the police abolitionist organization Winnipeg Police Cause Harm. You can follow him on Twitter at @james_m_wilt.\n\nWe Need Your Help\n\nMore than 75% of our operating budget comes to us in the form of donations from our readers. These donations help to pay our bills, and honorariums for some of our writers, photographers and graphic artists. Our supporters are part of everything we do.\n\nDONATE NOW\n\nADVERTISEMENT\n\nPOPULAR STORIES\nOne-year-old Ahmad Al-Najjar was beheaded by Israel—with a US bomb\nOpen letter: Stop subsidizing genocide\nWhy the housing crisis is not an immigration problem\nEpoch Times on the ropes after money-laundering charges laid\nCanada is still blocking aid to Afghanistan\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nRELATED READING\nCANADIAN POLITICS\nInquiry needed into police violence against Indigenous peoples\n\nPam Palmater / April 22, 2020 / 6 min read\n\nCANADIAN POLITICS\nClimate justice in so-called Canada\n\nAngele Alook, Emily Eaton, David Gray-Donald, Joël Laforest, Crystal Lameman, and Bronwen Tucker / January 18, 2023 / 7 min read\n\nCANADIAN POLITICS\nStatues, churches, vandalism, and the nationalist and colonial tales we like to call ‘history’\n\nPaul Burrows / July 4, 2021 / 7 min read\n\nCANADIAN POLITICS\nFrom Clayoquot Sound to Fairy Creek: What have we learned?\n\nKim Goldberg / October 19, 2021 / 6 min read\n\nINDIGENOUS POLITICS\nDecolonizing the zombie apocalypse: An interview with Jeff Barnaby about his new film ‘Blood Quantum’\n\nSean Carleton / April 26, 2020 / 5 min read\n\nENVIRONMENT\nThe Day After: Infrastructure\n\nJonathan Peyton and James Wilt / June 25, 2020 / 11 min read\n\nSUPPORT CD TODAY\n\nMore than 75% of our operating budget comes to us in the form of donations from our readers. These donations help to pay our bills, and honorariums for some of our writers, photographers and graphic artists. Our supporters are part of everything we do.\n\nDONATE NOW\nNEVER MISS A STORY\n\nSign up for our email newsletter and get our news and analysis delivered on the regular.\n\n SIGN UP\nBROWSE THE ARCHIVE\nABOUT DONATE SUBMISSIONS ADVERTISE CONTACT US\n\nFounded in 1963, Canadian Dimension is a forum for debate on important issues facing the Canadian Left today, and a source for analysis of national and regional politics, labour, economics, world affairs and art.\n\nWe acknowledge the financial support of the Government of Canada.\n\nAll content ©1963–2024 Canadian Dimension   |   Top of page"}
{"url": "https://www.theglobeandmail.com/canada/article-indigenous-women-girls-killed-at-rate-six-times-higher-than-non/", "title": "Indigenous women, girls killed at rate six times higher than non-Indigenous, according to StatsCan - The Globe and Mail", "body": "Skip to main content\nSEARCH\nNEWSLETTERS\nWATCHLIST\nLOG IN\nSUBSCRIBE\nFROM $1.99/WEEK\nHOME\nFOR YOU\nCANADA\nWORLD\nBUSINESS\nINVESTING\nPERSONAL FINANCE\nOPINION\nPOLITICS\nSPORTS\nLIFE\nARTS\nDRIVE\nREAL ESTATE\nIndigenous women, girls killed at rate six times higher than non-Indigenous, according to StatsCan\nALESSIA PASSAFIUME\nOTTAWA\nTHE CANADIAN PRESS\nPUBLISHED OCTOBER 4, 2023\n\nThis article was published more than 6 months ago. Some information may no longer be current.\n\nReport an editorial error\n\nReport a technical issue\n\nMore from Canada\nA bottle of blood serum from the 1940s gives researchers hope to save lives on battlefields of the 2020s\nCalgary mayor applauds reduced water use after pipeline break\nCalgary mayor Jyoti Gondek apologizes for communication gaps as city works to repair water main\nLethbridge MLA resigns, opening potential seat for leadership hopeful Naheed Nenshi\nSome B.C. landlords asking tenants for out-of-bounds rent increases, imply eviction\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nTrending\nSo what if inflation is falling? The damage to our finances is done\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nLoss of historic St. Anne’s Anglican Church in Toronto ‘catastrophe for Canadian architecture’\nTax collectors claim $300-million owed in alleged fraud related to First Nations gas stations\nWith so much technology in cars, why can’t the screen show me what the check engine light means?\nMore for you\nFreeland says broad strokes of capital-gains tax hike haven’t changed, details coming Monday\nFar right’s election gains rattle EU’s traditional powers, Macron calls snap polls\nLoss of historic St. Anne’s Anglican Church in Toronto ‘catastrophe for Canadian architecture’\nFOOD FOR THOUGHT\nMediterranean diet helps women live longer, study finds\nFollow related authors and topics\nSTATISTICS CANADA\nFOLLOW\n\nAuthors and topics you follow will be added to your personal news feed in Following.\n\nInteract with The Globe\nRETIREMENT NEWSLETTER\nRethink retirement\nSee how seniors are reshaping the meaning of retirement\nSIGN UP\nGLOBE EVENTS\nFixing the Broken Rung\nFREE VIRTUAL EVENT | Tuesday, May 18, 2024 @ 12:30 P.M. ET | Join The Globe's Déjà Leonard and experts for a discussion on promotion and talent development.\nREGISTER NOW\nTHE GLOBE WOMEN'S COLLECTIVE\nBringing women at all career stages together\nFocused reporting aimed at moving the needle toward gender equity in the workplace\nEXPLORE NOW\nLATELY PODCAST\nThe ADHD economy\nOur guest, Daniel Kolitz, author of The History of Adderall for Pioneer Works, tells us about the rise of the medication, how it’s changed the way we work, and his own experience on and off the drug\nLISTEN NOW"}
{"url": "https://www.reddeeradvocate.com/news/acquittal-of-accused-in-tina-fontaines-death-disappoints-winnipeg-police-chief/", "title": "Acquittal of accused in Tina Fontaine’s death disappoints Winnipeg police chief - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nAcquittal of accused in Tina Fontaine’s death disappoints Winnipeg police chief\nWinnipeg’s police chief says he’s disappointed that a jury acquitted a man accused of killing 15-year-old teenager Tina Fontaine.\nThe Canadian Press\nMar 2, 2018 11:55 AM\n\t\n\t\n\t\n\t\n\t\n\t\nWinnipeg Chief Danny Smyth told the city’s police services board that he wished police could have brought forward a more compelling case in the Tina Fontaine murder. (Photo by THE CANADIAN PRESS)\n\nWinnipeg’s police chief says he’s disappointed that a jury acquitted a man accused of killing 15-year-old teenager Tina Fontaine.\n\nRaymond Cormier was found not guilty last week of second-degree murder in the 2014 death of the teen, whose body was wrapped in a duvet cover and weighed down with rocks when it was found in the Red River.\n\nChief Danny Smyth told the city’s police services board that he had hoped for a different outcome.\n\nHe said it’s clear the jury didn’t find enough evidence to convict and he wished police could have brought forward a more compelling case.\n\nBut Smyth commended the officers who he said worked hard on the case and thanked prosecutors for taking it to trial.\n\nHe said Tina’s death has prompted change and pointed to Manitoba no longer housing children in care in hotels.\n\n“If not anything else, this trial provided transparency,” Smyth said Friday. “The community was able to learn about the investigation. They were able to see evidence and learn about the circumstances that led up to Tina’s death.”\n\nTina was raised by her great-aunt, Thelma Favel, on the Sagkeeng First Nation, 120 kilometres northeast of Winnipeg. She left to visit her mother in Winnipeg at the end of June 2014 and became an exploited youth.\n\nFavel called Child and Family Services with concerns about Tina, who ran away repeatedly from a youth shelter and hotels where she was placed.\n\nShe was last seen leaving a downtown hotel, where she told a private contract worker employed by child welfare that she was going to a shopping centre to meet friends.\n\nIt’s not known how Tina died. A pathologist testified at the trial that the girl’s death was suspicious because of the manner in which her body was found.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://winnipegsun.com/news/provincial/groundswell-of-support-show-governments-need-to-work-on-landfill-search-says-amc-grand-chief", "title": "Support shows gov’s need to work on landfill search: AMC grand chief | Winnipeg Sun", "body": "Skip to Content\nSections\nSearch\nSubscribe\nSign In\nNews\nOpinion\nSports\nEntertainment\nLife\nShopping\nDriving\nRemembering\nePaper\nSUNShine Girls\nNewsletters\nManage Print Subscription\nEmpty Stocking Fund\nAdvertisement 1\nPrevious\nKLEIN: Historic milestone achieved: Arctic Gateway Group unveils new facility at Port of Churchill\nTRENDING\nBILLECK: Another big off-season awaits for Winnipeg Jets\nTRENDING\n\"Biggie's Back\": Bombers star linebacker Adam Bighill expected back vs. Redblacks\nTRENDING\nLILLEY: Freeland warns of dark future in Canada without capital gains tax hike\nTRENDING\nBOMBERS NOTEBOOK: Sergio Castillo happy microchip saga behind him\nTRENDING\nNext\nBreadcrumb Trail Links\nNewsManitoba\nGroundswell of support shows governments need to work on landfill search, says AMC grand chief\nAuthor of the article:\nDave Baxter Local Journalism Initiative reporter\nPublished Sep 01, 2023  •  Last updated Sep 01, 2023  •  3 minute read\n64 Comments\nAssembly of Manitoba Chiefs (AMC) Grand Chief Cathy Merrick says she is thankful for a new coalition of churches and church leaders that have joined together in demanding a landfill search for human remains in Manitoba. Dave Baxter/Local Journalism Initiative/Winnipeg Sun PHOTO BY DAVE BAXTER/LOCAL JOURNALISM INITIATIVE /Winnipeg Sun\nArticle content\n\nThe leader of the Assembly of Manitoba Chiefs (AMC) says she is thankful for a new coalition of churches and church leaders that have joined together in demanding a landfill search for human remains in Manitoba and thankful for recent support she said is proving it is far more than just First Nations people who want to see a search of the Prairie Green Landfill.\n\nAdvertisement 2\nSTORY CONTINUES BELOW\nArticle content\n\n“We strongly hold the belief that the collective unity of these groups in supporting the families will demonstrate to the world that this issue is not exclusive to First Nations in Manitoba,” AMC Grand Chief Cathy Merrick said in a media release.\n\nMerrick’s comments come after four national churches — the Evangelical Lutheran Church in Canada, the United Church of Canada, the Presbyterian Church in Canada, and the Anglican Church of Canada — announced they are calling on all levels of government in Canada to begin work on a search of the Prairie Green Landfill for the remains of Morgan Harris and Marcedes Myran, two Indigenous women believed to have been murdered and dumped at the landfill north of Winnipeg by an alleged serial killer.\n\nThe Winnipeg Sun's Daily Headline News\n\nGet the latest headlines, breaking news and columns.\n\nSign Up\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nArticle content\nAdvertisement 3\nSTORY CONTINUES BELOW\nArticle content\n\n“It’s not just our people demanding justice,” Merrick said. “We are receiving support from around the world, because people recognize that the issue before us is a human rights issue.”\n\nMerrick said she hopes that both the province and the federal government are taking note of the support coming in for a landfill search and of where that support is coming from.\n\nPublic calls in recent months to search the Prairie Green Landfill have also come from Amnesty International, CUPE Local 500, the national Union of Taxation Employees, the Canadian Museum for Human Rights, the Provincial Council of Women of Manitoba, the Assembly of Manitoba Chiefs, the Treaty Commissioner of Saskatchewan, and several other organizations, officials and politicians across Canada.\n\nAdvertisement 4\nSTORY CONTINUES BELOW\nArticle content\n\n“This collective effort stands as a powerful gesture of reconciliation,” Merrick said. “All levels of government must work together to implement the 231 calls to justice and get real about reconciliation.\n\n“Commitment means nothing without meaningful action.”\n\nMerrick added the support from the churches could go a long way towards repairing some of the damage that has been caused historically to First Nations people through churches in Canada, saying it was a “significant step forward in healing the historic relationship between First Nations and the church.”\n\nJeremy Skibicki was charged with first-degree murder in December in the deaths of four women, including Harris and Myran, whose remains are both believed to be at the privately-run Prairie Green Landfill north of Winnipeg.\n\nAdvertisement 5\nSTORY CONTINUES BELOW\nArticle content\n\nHe has also been charged in the death of Rebecca Contois, whose remains were found last year at the Brady Road Landfill and an unidentified woman Indigenous leaders are calling Buffalo Woman, whose remains have not been found.\n\nManitoba Premier Heather Stefanson announced on July 6 that the province would not offer assistance to search the Prairie Green Landfill, saying she came to the decision because of the results of a feasibility study.\n\nThe feasibility study said a search for Harris and Myran was feasible, but could cost as much as $184 million and pose health and safety threats to workers, and that there was no guarantee that it would be successful.\n\nIn a statement sent to the Winnipeg Sun on July 20, a spokesperson for the premier’s office said the premier was firm on her decision and on the reasons behind it.\n\n“Our hearts go out to the families, who are dealing with unimaginable grief, but leadership requires difficult decisions. There is no guarantee of finding remains and immediate and long-term health and safety risks are real and cannot be ignored,” the spokesperson said.\n\n— Dave Baxter is a Local Journalism Initiative reporter who works out of the Winnipeg Sun. The Local Journalism Initiative is funded by the Government of Canada.\n\nArticle content\nWinnipeg Sun is part of the Local Journalism Initiative and reporters are funded by the Government of Canada to produce civic journalism for underserved communities. Learn more about the initiative\nShare this article in your social network\nThese Barefoot Shoes are Leaving Neuropathy Experts Baffled\nBarefoot Vitality\n|\nSponsored\nManitoba RCMP shoot and kill man who was allegedly assaulting a woman\nWinnipeg Sun\nSUNshine Girl Elisa\nWinnipeg Sun\nStop Buying Lottery Tickets & Start Doing This Instead!\nYukon Casino\n|\nSponsored\nClick Here\nStop scrolling, stop scratching, try this instead\nDaily Pulse\n|\nSponsored\nSeniors Born Before 1967 Wanted For Invisible Hearing Aids\nBest Hearing Aids\n|\nSponsored\nLearn More\nStop scratching these, and try this instead\nDaily Pulse\n|\nSponsored\nCOMMENTS\nYou must be logged in to join the discussion or read more comments.\nCreate an Account\nSign in\nJOIN THE CONVERSATION\n\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.\n\nLoading...\nTRENDING\nKLEIN: Historic milestone achieved: Arctic Gateway Group unveils new facility at Port of Churchill\nUPDATED: RCMP widen search for missing Winnipeg woman\nLILLEY: Freeland warns of dark future in Canada without capital gains tax hike\nBILLECK: Another big off-season awaits for Winnipeg Jets\n\"Biggie's Back\": Bombers star linebacker Adam Bighill expected back vs. Redblacks\nREAD NEXT\n \n \n \n \n \nTHIS WEEK IN FLYERS"}
{"url": "http://www.netnewsledger.com/2016/08/04/ontario-regional-chief-day-welcomes-long-overdue-mmiw-inquiry/", "title": "Ontario Regional Chief Day Welcomes Long Overdue MMIW Inquiry - NetNewsLedger", "body": "  \nNews\nLocal News\nRegional News\nNational News\nInternational News\nBusiness\nLocal Business\nRegional Business\nNational Business\nInternational Business\nMining\nInternational Mining\nNational Mining\nRegional Mining\nMining Press Releases\nIndigenous\nLocal Indigenous\nRegional Indigenous\nNational Indigenous\nInternational Indigenous\nSports\nLocal Sports\nRegional Sports\nNational Sports\nInternational Sports\nHealth\nLocal Covid-19\nRegional Covid-19\nNational Covid-19\nInternational Covid-19\nWeather\nLocal Weather\nRegional Weather\nNational Weather\nInternational Weather\nClimate News\nLiving\nGas Prices Across the Region\nTechnology\nTravel\nEntertainment\n 20 C \nThunder Bay\nNetNewsLedger\nAdvertisement\nNEWS\nBUSINESS\nMINING\nINDIGENOUS\nSPORTS\nHEALTH\nWEATHER\nLIVING\n  \nHome  Anishinaabe  Ontario Regional Chief Day Welcomes Long Overdue MMIW Inquiry\nAnishinaabeTop Stories\nOntario Regional Chief Day Welcomes Long Overdue MMIW Inquiry\nBy NetNewsLedger -\nAugust 4, 2016\n511\nOntario Regional Chief Isadore Day (Wiindawtegowinini)\nOntario Regional Chief Isadore Day (Wiindawtegowinini)\n\nTHUNDER BAY – “On behalf of the Chiefs of Ontario, I welcome the announcement of this long overdue inquiry into this national crisis and want to acknowledge the families, the women’s groups and the Indigenous organizations for taking the lead and pushed the federal government for an inquiry,” said Regional Chief Day. “The MMIW Inquiry’s mandate is slated to end in 2018 and in the meantime, we look forward to an interim report which should contain immediate recommendations and direct action. We will continue to adhere to the ‘Families First’ philosophy and look forward to working with and providing support to the commissioners and the regional liaison representatives.”\n\nOntario Regional Chief Isadore Day welcomes today’s announcement rolling out the much-anticipated Missing and Murdered Indigenous Women National Inquiry and says we must rally behind the commissioners and support the families in the critical work they will carry out over the next two years.\n\nIndigenous Affairs Minister Carolyn Bennett, Justice Minister Jody Wilson-Raybould and Status of Women Minister Patty Hajdu unveiled the plan for the missing and murdered indigenous women inquiry this morning at the Canadian Museum of History in Gatineau, Que.\n\nThe government announced the five-person panel and the budget set at $53.86 million, topped up from the $40 million budget commitment. Justice Canada is also putting an additional $16.17 million over four years to create family information liaison units in each province and territory and to increase funding for culturally appropriate victims’ services. The inquiry will begin Sept. 1 and run until Dec. 31, 2018, at a cost estimated at $53.8 million.\n\nThe commissioners are: Marion Buller named chief commissioner and is British Columbia’s first female First Nations judge; Michèle Audette, leading women’s First Nations advocate, Innu francophone and former president of the Native Women’s Association of Canada; Qajaq Robinson, Ottawa-based lawyer specializing in Aboriginal issues and land and treaty claims, born in Nunavut; Marilyn Poitras, constitutional and aboriginal law expert at the University of Saskatchewan; Brian Eyolfson, First Nations and human rights lawyer, former vice-chair of the Human Rights Tribunal of Ontario.\n\n“We have known for years what many of these recommendations should look like,” said Regional Chief Day. “Canada’s inquiry into murdered and missing Indigenous women and girls is a direct result of the generational impact of residential schools combined with today’s child welfare crisis, which stems from poverty and despair. I want this inquiry to examine the factors driving a systemic, high rate of violence against Indigenous women and girls and the role of justice institutions like police forces and coroners’ offices.”\n\nChief Ava Hill of the Six Nations of the Grand River agrees adding it must also include men and boys and the impact on families in First Nation communities. “If we are to take a non-discriminatory approach and are genuinely concerned with helping all victims of violence and homicide, then we need to support the families as they get involved in the process which should include men and boys. And by strengthening the support in our communities, we will be doing our part to help bring this national tragedy to an end.”\n\nSome families and advocates expressed disappointment the announcement makes no specific mention of police investigations, an issue that came up at all 17 pre-inquiry consultations held earlier this year. A 2015 United Nations report found that young First Nations, Métis and Inuit women were five times more likely to die under violent circumstances than their non-Aboriginal counterparts.\n\n“As the inquiry will seek to accomplish the development of strong recommendations, many feel that it will not attempt to seek justice for specific cases or correct an investigation to a case gone cold,” said Regional Chief Day. “Our families and First Nations must have an oversight and advocacy process that will seek justice immediately. Many cases where police agencies are in question must not be lost along this path. We must continue to seek to have these justice mechanisms built into the process.”\n\nTAGS\n#MMIW\nPrevious article\nWestjet Flight 142 Diverted to Thunder Bay over Explosives Threat\nNext article\nBombardier Completes LTE Testing for Mass Transit and Mainline Rail\nNetNewsLedger\nhttp://www.netnewsledger.com\nNetNewsledger.com or NNL offers news, information, opinions and positive ideas for Thunder Bay, Ontario, Northwestern Ontario and the world. NNL covers a large region of Ontario, but we are also widely read around the country and the world. To reach us by email: newsroom@netnewsledger.com. Reach the Newsroom: (807) 355-1862\n      \nRELATED ARTICLESMORE FROM AUTHOR\nMurdered and Missing Indigenous Women Inquiry Meetings Postponed\nMurdered and Missing Indigenous Women and Girls Meetings Update\nMMIWG – Deadline for Standing Extended to April 18\nONWA Seeks to Serve as Contact Point for MMIW Inquiry\nTreaty Three Police Seeking Missing Woman\nNWAC Outlines How to Engage with MMIW Inquiry\nFOLLOW US\n  \nNetNewsLedger – Statement of Journalistic Standards Terms and Conditions Privacy Contact Land Acknowledgement\n© Copyright © 2014 - 2020 NetNewsledger.com. All Rights Reserved."}
{"url": "https://winnipegsun.com/news/provincial/southern-chiefs-urge-action-on-issue-of-mmiwg2s", "title": "Southern Chiefs' urge action on issue of MMIWG2S+ | Winnipeg Sun", "body": "Skip to Content\nSections\nSearch\nSubscribe\nSign In\nNews\nOpinion\nSports\nEntertainment\nLife\nShopping\nDriving\nRemembering\nePaper\nSUNShine Girls\nNewsletters\nManage Print Subscription\nEmpty Stocking Fund\nAdvertisement 1\nPrevious\nKLEIN: Historic milestone achieved: Arctic Gateway Group unveils new facility at Port of Churchill\nTRENDING\nBILLECK: Another big off-season awaits for Winnipeg Jets\nTRENDING\n\"Biggie's Back\": Bombers star linebacker Adam Bighill expected back vs. Redblacks\nTRENDING\nLILLEY: Freeland warns of dark future in Canada without capital gains tax hike\nTRENDING\nBOMBERS NOTEBOOK: Sergio Castillo happy microchip saga behind him\nTRENDING\nNext\nBreadcrumb Trail Links\nNewsManitoba\nSouthern Chiefs' urge action on issue of MMIWG2S+\nAuthor of the article:\nGlen Dawkins\nPublished Jun 03, 2023  •  3 minute read\n8 Comments\nSouthern Chiefs' Organization Grand Chief Jerry Daniels. PHOTO BY FACEBOOK PHOTO /Winnipeg Sun/Local Journalism Initiative\nArticle content\n\nThe Southern Chiefs’ Organization marked the fourth anniversary Saturday of the release of the final report of the National Inquiry into Missing and Murdered Indigenous Women and Girls by calling on governments to take more action.\n\nAdvertisement 2\nSTORY CONTINUES BELOW\nArticle content\n\n“Today, it is four years since the release of Reclaiming Power and Place,” said SCO Grand Chief Jerry Daniels in a statement Saturday, referring to the national inqufinal report. “This report provides a pathway for society to address the national emergency of missing and murdered Indigenous women, girls, two spirit, and gender-diverse people. Once again, the Southern Chiefs’ Organization calls on all levels of government to work with First Nations on an urgent basis to address the ongoing violence perpetuated against our women, girls, two spirit, and gender-diverse people.”\n\nEarlier this year, the Canadian Femicide Observatory for Justice and Accountability reported that 850 women were murdered in the last five years and the numbers are rising. On average, one women or girl was killed every 48 hours and a disproportionate number were First Nations.\n\nThe Winnipeg Sun's Daily Headline News\n\nGet the latest headlines, breaking news and columns.\n\nSign Up\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nArticle content\nAdvertisement 3\nSTORY CONTINUES BELOW\nArticle content\n\nIn 2019, the National Inquiry into MMIWG concluded the violence perpetuated against Indigenous women in Canada amounted to genocide. In 2021, a National Action Plan was released, and in January this year the federal government hosted a National Roundtable, bringing together provincial and territorial leaders as well as families, survivors, and Indigenous leadership, to focus on the issue.\n\n“Progress has also been slow in terms of implementing the 231 Calls for Justice,” said Daniels “We know there are many advocates and family members who continue to push for justice for their loved ones. We stand with all impacted citizens. We are grateful for the passage of the motion unanimously adopted by all parties in the House of Commons on May 2 to recognize the ongoing genocide as a Canada-wide emergency. This motion recognized decades of insufficient action from all levels of government. It is essential to address the effects of this national crisis with the urgency it deserves.”\n\nAdvertisement 4\nSTORY CONTINUES BELOW\nArticle content\n\nIn a joint statement by Premier Heather Stefanson, Indigenous Reconciliation and Northern Relations Minister Eileen Clarke and Families Minister and Minister responsible for gender equity Manitoba Rochelle Squires, the provincial government pledged to move forward on implementation through a ‘whole-of-Manitoba’ approach based on partnerships, co-development and collaboration.\n\n“Our government remains committed to working closely with Indigenous leadership, community-based organizations and law enforcement to continue to respond to the Calls for Justice of the national inquiry and to combat gender-based violence in Manitoba,” read the statement, referencing the ongoing work of Manitoba’s Gender-Based Violence Committee of Cabinet, the introduction of Clare’s law, and funding to Giganawenimaanaanig (formerly the Manitoba MMIWG2S+ Implementation Committee) via the Ma Mawi Wi Chi Itata Centre. “We must also continue to listen to the voices of those directly affected to further acknowledge the individual and collective strength, courage, and resilience that families, survivors and communities continue to demonstrate while fighting for justice and safety for Indigenous women, girls and 2SLGBTQQIA+ peoples.”\n\nAdvertisement 5\nSTORY CONTINUES BELOW\nArticle content\n\n“In the Province of Manitoba, ending violence against Indigenous women, girls, two spirit, and gender-diverse people does not appear to be a priority for the government,” said Daniels. “We are the only western province without an action plan to implement the final report and Calls for Justice. There are no excuses for this inaction and lack of investment into this ongoing national emergency.\n\n“The lives of our women, girls, two spirit, and gender-diverse people are depending on leadership to step up and address this crisis.”\n\nEvery Oct. 4, SCO launches an education and awareness campaign and in 2021 they conducted a survey to learn more about the priorities of southern First Nations regarding the 231 Calls for Justice. SCO also launched their Survivors’ Healing Program to provide support to Survivors and those who are impacted by MMIWG2S+. “This work moves forward without any funding or resource support from the Province of Manitoba,” SCO said in the statement.\n\ngdawkins@postmedia.com\n\nTwitter: @SunGlenDawkins\n\nArticle content\nShare this article in your social network\nYou will never turn off your computer again, if you own a mouse.\nPlay this game for 1 minute and see why everyone is addicted. No Installation. Play for free.\nPanzer.Quest\n|\nSponsored\nPlay Now\nManitoba RCMP shoot and kill man who was allegedly assaulting a woman\nWinnipeg Sun\nSUNshine Girl Elisa\nWinnipeg Sun\nIf you have a mouse, you will never turn off your computer again.\nPlay this game for 1 minute and see why everyone is addicted. No Installation. Play for free.\nPanzer.Quest\n|\nSponsored\nPlay Now\nStop Buying Lottery Tickets & Start Doing This Instead!\nYukon Casino\n|\nSponsored\nClick Here\nStop scratching these, and try this instead\nDaily Pulse\n|\nSponsored\nIf you have a mouse, this game will keep you awake all night long.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nCOMMENTS\nYou must be logged in to join the discussion or read more comments.\nCreate an Account\nSign in\nJOIN THE CONVERSATION\n\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.\n\nLoading...\nTRENDING\nKLEIN: Historic milestone achieved: Arctic Gateway Group unveils new facility at Port of Churchill\nUPDATED: RCMP widen search for missing Winnipeg woman\nLILLEY: Freeland warns of dark future in Canada without capital gains tax hike\nBILLECK: Another big off-season awaits for Winnipeg Jets\n\"Biggie's Back\": Bombers star linebacker Adam Bighill expected back vs. Redblacks\nREAD NEXT\n \n \n \n \n \nTHIS WEEK IN FLYERS"}
{"url": "http://www.netnewsledger.com/2017/12/18/nipissing-first-nation-chief-calls-mmiwg-head-commissioner-resign/", "title": "Nipissing First Nation Chief Calls for MMIWG Head Commissioner to Resign - NetNewsLedger", "body": "  \nNews\nLocal News\nRegional News\nNational News\nInternational News\nBusiness\nLocal Business\nRegional Business\nNational Business\nInternational Business\nMining\nInternational Mining\nNational Mining\nRegional Mining\nMining Press Releases\nIndigenous\nLocal Indigenous\nRegional Indigenous\nNational Indigenous\nInternational Indigenous\nSports\nLocal Sports\nRegional Sports\nNational Sports\nInternational Sports\nHealth\nLocal Covid-19\nRegional Covid-19\nNational Covid-19\nInternational Covid-19\nWeather\nLocal Weather\nRegional Weather\nNational Weather\nInternational Weather\nClimate News\nLiving\nGas Prices Across the Region\nTechnology\nTravel\nEntertainment\n 20 C \nThunder Bay\nNetNewsLedger\nAdvertisement\nNEWS\nBUSINESS\nMINING\nINDIGENOUS\nSPORTS\nHEALTH\nWEATHER\nLIVING\n  \nHome  Anishinaabe  Nipissing First Nation Chief Calls for MMIWG Head Commissioner to Resign\nAnishinaabeTop Stories\nNipissing First Nation Chief Calls for MMIWG Head Commissioner to Resign\nBy NetNewsLedger -\nDecember 18, 2017\n661\nInstitutional, Knowledge keeper & expert hearings on Family and child welfare\n\nBy Kelly Anne Smith\n\nNIPISSING FIRST NATION – The Chief of Nipissing First Nation is asking for the resignation of the head commissioner of the National Inquiry into Missing and Murdered Indigenous Women and Girls (MMIWG).\n\nChief Scott McLeod sided with the majority at The Assembly of First Nations Special Chief Assembly in Ottawa on December 9. The congregation voted to ask the federal government to “reset” the inquiry by appointing a new leader. The assembly is also requesting the inquiry be given two more years to complete the mission of “learning the truth by honouring the lives and legacies of Indigenous women, girls, and members of the LGBTQ2S community”. There has been criticism of the inquiry’s communication with the public and by focusing on testimonials rather than on finding solutions.\n\nChief McLeod is in agreement with the resolution. “Unfortunately, in the best interest of the process and confidence of the families that are deeply affected by MMIWG, I have to support the call for Commissioner Buller to step down. It’s a very difficult and sensitive issue but it’s interfering with the Inquiry itself. The well-being and confidence needs to be placed in the forefront. This isn’t a personal attack on Buller by any means but merely a vote in the best interest of the families.”\n\nIt was reported that Chief Janice Henderson of Mitaanjigamiing First Nation was originally critical of the commission but changed her mind. Chief Henderson now thinks the commission would be delayed if Buller stepped down. Chief Henderson attended the recent MMIWG Inquiry hearings in Thunder Bay and felt the commissioners were very supportive of family members. Meanwhile, at the Special Chiefs Assembly, Head Commissioner Marion Buller said she won’t step down.\n\nThe stretching of resources on First Nations with changes to federal laws were also under discussion by the chiefs. The government will remove sex-discrimination from the Indian Act. There are now consultations in place to include the pre-1951 group who were excluded from being appointed Indigenous status.\nNipissing First Nation Chief McLeod could face flux in his community of 2600 members. “The removal of the 1951 cutoff is a bittersweet situation for our community. First, it is great to have our families recognized and welcomed back to the communities to which they belong. However, the issue is that First Nations are already underfunded for social programs, health programs, and education. The Federal government needs to step up and fix these funding gaps now more than ever. First Nations are always left to deal with problems that are a result of Canada’s crimes against us.”\n\nCannabis was on the agenda as an information session to the Chiefs. Chief McLeod is apprehensive of the upcoming legalization of marijuana. “Nipissing First Nation has not looked at a Cannabis dispensary. Our concerns at this time are that legalization is happening too fast. First Nations require time to implement regulations, look at social impacts, provide education, increase policing and so on. We are not opposing but feel once again that First Nations will be left with many issues to deal with.” The federal government has announced that provinces will receive 75% of pot tax revenue.\n\nTAGS\nMMIWG\nNational Inquiry\nPrevious article\nThunder Bay Police Seek Assistance to Locate Missing Female\nNext article\nWarm Up with Scotch Beef Barley Soup\nNetNewsLedger\nhttp://www.netnewsledger.com\nNetNewsledger.com or NNL offers news, information, opinions and positive ideas for Thunder Bay, Ontario, Northwestern Ontario and the world. NNL covers a large region of Ontario, but we are also widely read around the country and the world. To reach us by email: newsroom@netnewsledger.com. Reach the Newsroom: (807) 355-1862\n      \nRELATED ARTICLESMORE FROM AUTHOR\nOttawa’s Progress on MMIWG Report: Inuit Women’s Group Calls for Faster Action\nThunder Bay Launches Urban Indigenous Community Safety Plan on MMIWG Report Anniversary\nAssembly of First Nations (AFN) Marks the Fifth Anniversary of National Inquiry into Missing and Murdered Indigenous Women and Girls (MMIWG) with Progress Report...\nThunder Bay Missing Person Report: Dominique HARDY, 36\nThunder Bay Police Seek Help to Locate Missing Lakehead University Student Reanna OWEN\nThunder Bay Community Alert: 15-Year-Old Heaven MOSES-FORTIER Reported Missing\nFOLLOW US\n  \nNetNewsLedger – Statement of Journalistic Standards Terms and Conditions Privacy Contact Land Acknowledgement\n© Copyright © 2014 - 2020 NetNewsledger.com. All Rights Reserved."}
{"url": "https://www.theglobeandmail.com/opinion/article-the-mmiwg-inquiry-cannot-be-allowed-to-fail/", "title": "The MMIWG inquiry cannot be allowed to fail - The Globe and Mail", "body": "Skip to main content\nSEARCH\nNEWSLETTERS\nWATCHLIST\nLOG IN\nSUBSCRIBE\nFROM $1.99/WEEK\nHOME\nFOR YOU\nCANADA\nWORLD\nBUSINESS\nINVESTING\nPERSONAL FINANCE\nOPINION\nPOLITICS\nSPORTS\nLIFE\nARTS\nDRIVE\nREAL ESTATE\nOPINION\nThe MMIWG inquiry cannot be allowed to fail\nMARION BULLER\nCONTRIBUTED TO THE GLOBE AND MAIL\nPUBLISHED APRIL 23, 2018\n\nThis article was published more than 6 years ago. Some information may no longer be current.\n\nSHARE\n\nMarion Buller is chief commissioner of the National Inquiry into Missing and Murdered Indigenous Women and Girls.\n\nFamilies first.\n\nThat is the approach of the National Inquiry for Missing and Murdered Indigenous Women and Girls. Families and survivors are deeply invested in the success of the inquiry. And we are equally invested and committed to families who have lost loved ones and those who are survivors of violence.\n\nAdmittedly, the national inquiry has experienced a number of setbacks that played out publicly; however, it has made important progress on several fronts, which needs to be acknowledged.\n\nIncreasingly over time, families and survivors are courageously participating in large numbers with the hope of making a real difference. To date, more than 1,000 witnesses have shared their personal stories of loss, pain and heartache at hearings across the country. They have contributed valuable recommendations for meaningful changes. About 700 more people are registered to add their truths and recommendations to the public record.\n\nRegistration for families and survivors concluded on April 20 but we will reach out to them to hear their stories and receive their truths. Our statement gatherers will continue this important work and engage with as many families and survivors as time permits to take their statements and receive their recommendations. We will not stop until we are compelled to stop to begin to write our final report.\n\nIn addition to collecting this crucial testimony, during the current mandate, the national inquiry plans to undertake important research and hold hearings on racism, police practices, human rights and government services.\n\nIndigenous leaders and grassroots activists, who fought for decades for a formal inquiry, knew at the outset that two years was simply insufficient to fulfil the ambitious mandate set out by the government and to uncover real answers to the staggering levels of violence faced by Indigenous women and girls in this country. Policing, child welfare, systems of justice and social services could each be the subject of a public inquiry in their own right. But they are not. These and other crucial matters are all rolled into the mandate of the inquiry.\n\nMany commissions of inquiry over the years needed extensions to get across the finish line, so ours is not an unusual request of the government. For example, the Truth and Reconciliation Commission was given an extension and it took seven years to complete its work.\n\nShould the national inquiry be forced to wrap up without the adequate time and resources to do the job correctly, families and survivors who participated stand not only to be disappointed, but potentially revictimized in the process. But there’s even more at stake. Time is needed to do the work required to make robust and meaningful recommendations for systemic changes and improvement. If we don’t develop the solutions needed to address this ongoing tragedy in our communities, it is the next generation of daughters, granddaughters and nieces who will continue to pay an unconscionable price.\n\nIndigenous women in Canada report rates of violence, including domestic violence and sexual assault, that are 3.5 times higher than non-Indigenous women. Young Indigenous women are five times more likely than other Canadian women of the same age to die as a result of violence.\n\nYet many Canadians have little knowledge of the injustices, violence and abuse experienced by Indigenous women. We must continue to shine a bright light on these hard truths. Ultimately, Canada must be moved to address the underlying root and systemic causes of Indigenous women and girls going missing or dying. The national inquiry cannot be expected to do it alone, nor do we want to do it in a superficial manner.\n\nThere is still significant work needed in critical areas of research and forensic investigation. Further hearings on topics such as the justice system, sexual exploitation, health care and addiction services are required. The government has made strong statements about its commitment to this issue and the importance of the national inquiry completing its work. It is now up to the government to honour commitments made, make the right decision and grant the extension.\n\nWe need “all hands on deck” to meet the ongoing challenges, to continue and conclude the essential work that needs to be done. It is time for Indigenous organizations and governments, families, survivors, communities and Canadians from coast to coast to coast to come together once again on this critical issue that affects all of us.\n\nQuite simply, we all have a responsibility to ensure the national inquiry’s success in uncovering the truth. In doing so, we will properly honour the memories of Indigenous women and girls who were taken from us. We will help families and survivors on their paths to healing. And we will build a safer and brighter future for all women and girls.\n\nSign up for the Opinion Newsletter.\n\nKeep your opinions sharp and informed with a helpful summary of The Globe’s most provocative columns, covering politics, world affairs, business, arts, health and the way we live (subscribers only).\n\nSUBSCRIBE TO SIGN UP\nEXPLORE NEWSLETTERS\n\nReport an editorial error\n\nReport a technical issue\n\nEditorial code of conduct\n\nMore from Opinion\n‘Wrong and misguided to make McKinsey the scapegoat.’ Federal contracting rules, plus other letters to the editor for June 10\nOPINION\nIn hockey, income inequality is for losers\nJEFF RUBIN\nOPINION\nCanada may be headed for a populist government – but how would it govern?\nDAVID MCLAUGHLIN\nWhat else do you call it when people conspire against their own country?\nOPINION\nThe EU’s very survival is on the ballot in European elections\nKONRAD YAKABUSKI\nOPINION\nFor Keir Starmer, Labour’s near-certain win in the British election will be a blessing and a curse\nSAMUEL MCILHAGGA\nREAD OR POST COMMENTS\nTrending\nSo what if inflation is falling? The damage to our finances is done\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nLoss of historic St. Anne’s Anglican Church in Toronto ‘catastrophe for Canadian architecture’\nTax collectors claim $300-million owed in alleged fraud related to First Nations gas stations\nWith so much technology in cars, why can’t the screen show me what the check engine light means?\nMore for you\nFreeland says broad strokes of capital-gains tax hike haven’t changed, details coming Monday\nCalgary mayor Jyoti Gondek apologizes for communication gaps as city works to repair water main\nNewfoundland woman was ‘living in fear’ in for-profit shelter. She was killed there\nFar right’s election gains rattle EU’s traditional powers, Macron calls snap polls\nInteract with The Globe\nGLOBE CLIMATE NEWSLETTER\nShould Canada's recovery plan be green?\nStay on top of Canada’s environment and climate change news\nSIGN UP\nGLOBE EVENTS\nFixing the Broken Rung\nFREE VIRTUAL EVENT | Tuesday, May 18, 2024 @ 12:30 P.M. ET | Join The Globe's Déjà Leonard and experts for a discussion on promotion and talent development.\nREGISTER NOW\nREPORT ON BUSINESS\nYour biggest investment is you. Don’t sell it short.\nMake more informed decisions with Canada’s leading source of business and investing news\nSTART NOW\nWASTED SPACE\n613 pieces of of lazy land in cities and towns across the country\nOttawa wants affordable housing on ‘every possible piece’ of federal land. So how much is out there? A Globe analysis found enough to house 750,000 people\nREAD NOW"}
{"url": "https://www.cowichanvalleycitizen.com/news/final-day-of-public-hearings-for-missing-and-murdered-indigenous-women-and-girls/", "title": "Final day of public hearings for missing and murdered Indigenous women and girls - Cowichan Valley Citizen", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\n18.1 °C\nHome News\nFinal day of public hearings for missing and murdered Indigenous women and girls\nThe hearings have lasted all week in Richmond\nThe Canadian Press\nApr 8, 2018 1:05 PM\n\t\n\t\n\t\n\t\n\t\n\t\nElder Marge George delivers a morning prayer during the first day of five in the last community hearing of the national inquiry into missing and murdered Indigenous women and girls. (Ashley Wadhwani/Black Press)\n\nA longtime advocate for missing and murdered Indigenous women told her own story of abuse on the last scheduled day of public hearings for the national inquiry Sunday.\n\nBernie Williams, who has fought for women on Vancouver’s Downtown Eastside for 30 years, said her abuse began at age three and continued through foster homes and a marriage, involving broken bones and brutal rapes.\n\nOne foster family forced the kids to eat from bowls on their hands and knees, like dogs, she said.\n\n“At the age of 11 to 12 years old, six of us girls were sold into the sex trade work,” said Williams, who is now 60.\n\n“As many of you know, I don’t wear shorts very often, because I have cigarette burns all through my legs right up to my back. … This is what we endured, we were just kids.”\n\nWilliams, who says she lost three sisters and her mother to murder, says she’s tired of seeing elders at food banks and unanswered calls for things like health, healing and wellness centres.\n\n“Why has it taken over 4,000 women and girls’ names to secure and still keep asking the same questions,” she said.\n\nShe said it’s time to stem a tide of lateral violence — in which people in need fight amongst one another instead of against systemic problems.\n\nREAD: Traditional medicine helps heal at missing women inquiry\n\nMetro Vancouver’s hearings on Sunday were the last that were scheduled for the National Inquiry into Missing and Murdered Indigenous Women and Girls, though others will continue to testify in private.\n\nThe inquiry was established by the federal government in 2015 to investigate the disproportionately high number of missing and murdered Indigenous women and girls in Canada, and to give family members a chance to have their stories heard.\n\nREAD: Sharing truth with art at inquiry into missing, murdered Indigenous women\n\nChief Commissioner Marion Buller, who has said the inquiry needs more time, is expected to make closing remarks this afternoon.\n\nBuller told the Canadian Press that the inquiry has enough material to produce a report, but it will only scratch the surface of the issues without more time.\n\nCommissioners asked the federal government last month for a two-year extension, but Buller says it remains unclear if that request will be granted.\n\nAmy Smart, The Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRCMP investigating after pedestrian struck by car in Duncan\n\t\tOld Farm Market south of Duncan hires new store manager\n\t\tNew legislation opens up possibility of 3,600 new housing units in Duncan\n\t\tDuncan family loses rental home to fire over the weekend\n\t\tCowichan Tribe member loses his home, and irreplaceable items in house fire\nFacebook Comments (0) \nTODAY IN B.C.\n\nThere are no items to show.\n\n  \nCowichan Valley Citizen\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nNanaimo News Bulletin\nParksville Qualicum Beach News\nAlberni Valley News\nLake Cowichan Gazette\nChemainus Valley Courier\nLadysmith Chronicle\nTofino-Ucluelet Westerly News\nVancouver Island Free Daily\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Cowichan Valley Citizen and Black Press Media Publications Contact"}
{"url": "https://nationalpost.com/news/canada/report-into-genocide-of-indigenous-women-calls-for-widespread-changes", "title": "Report into 'genocide' of Indigenous women calls for widespread changes | National Post", "body": "Skip to Content\nIntroducing Puzzmo's new Pile-Up Poker, where poker meets solitaire. Play it today >>\nSections\nSearch\nSubscribe\nSign In\nNewsletters\nCanada\nWorld\nFinancial Post\nNP Comment\nLongreads\nPuzzmo\nLife\nShopping\nEpaper\nManage Print Subscription\nAdvertisement 1\nBreadcrumb Trail Links\nNewsCanada\nReport into 'genocide' of Indigenous women calls for widespread changes\n\nThe recommendations include developing an effective response to human trafficking cases and sexual exploitation and violence\n\nAuthor of the article:\nKristy Kirkup, The Canadian Press\nPublished Jun 03, 2019  •  4 minute read\nJoin the conversation\nIndigenous people go to the closing ceremony for the National Inquiry into Missing and Murdered Indigenous Women and Girls in Gatineau, Que. PHOTO BY THE CANADIAN PRESS/ADRIAN WYLD\nArticle content\n\nThe chief commissioner of the inquiry into missing and murdered Indigenous women and girls told survivors and families on Monday they have started to rewrite Canadian history.\n\nWhile speaking at a ceremony at the Canadian Museum of History in Gatineau, Que., former B.C. judge Marion Buller said she and her fellow commissioners are holding up a mirror to the country, reflecting what they heard from more than 2,300 people over two years of cross-country public hearings and work to gather evidence.\n\nAdvertisement 2\nSTORY CONTINUES BELOW\nTRENDING\nSubscriber only.\nFIRST READING: The real reason the Liberals are holding on for dear life\nSUBSCRIBER ONLY\nMichael Higgins: To Freeland, the capital gains tax is all that is keeping Canada from anarchy\nOver 50,000 supporters march in Walk With Israel rally in Toronto\nLiberals have good reason to fear Pierre Poilievre: Full Comment podcast\nConservatives, Bloc ask Hogue Commission to investigate allegations of treason \nArticle content\n\n“Your truths cannot be unheard,” Buller told hundreds gathered in the grand hall of the museum, including Prime Minister Justin Trudeau.\n\nThe ceremony marks the release of the much-anticipated inquiry report, which contains more than 200 recommendations to multiple levels of government.\n\nIt calls the violence against First Nations, Metis and Inuit women and girls a form of “genocide” and a crisis “centuries in the making.”\n\n“These abuses and violations have resulted in the denial of safety, security, and human dignity,” the report says.\n\nIt also calls for action in areas including justice and health, suggesting that health-service providers develop programs that could help young people recognize the signs of being targeted for exploitation.\n\nCrown-Indigenous Relations Minister Carolyn Bennett, Indigenous Services Minister Seamus O’Regan and numerous other officials and advocates are also at the ceremony.\n\nChief commissioner Marion Buller speaks at the closing ceremony for the National Inquiry into Missing and Murdered Indigenous Women and Girls in Gatineau, Que. PHOTO BY THE CANADIAN PRESS/ADRIAN WYLD\n\nThe report, the culmination of a three-year effort often beset by controversy, delays and personnel problems, documents what Buller calls “important truths” — including that Canadian laws and institutions are themselves to blame for violating the human rights of Indigenous Peoples.\n\nNP Posted\n\nGet a dash of perspective along with the trending news of the day in a very readable format.\n\nSign Up\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nArticle content\nAdvertisement 3\nSTORY CONTINUES BELOW\nArticle content\n\n“I hope that knowing these truths will contribute to a better understanding of the real lives of Indigenous people and the violations of their human and Indigenous rights when they were targeted for violence,” Buller writes in the report.\n\nShe also makes a point to acknowledge potential criticisms.\n\nSkeptics will be fearful and will complain that the financial cost of rebuilding is too great\n\n“Skeptics will be fearful and will complain that the financial cost of rebuilding is too great, that enough has been done, that enough money has been spent,” Buller writes.\n\n“To them I say, we as a nation cannot afford not to rebuild. Otherwise, we all knowingly enable the continuation of genocide in our own country.”\n\nThe steps necessary to “end and redress this genocide” must be no less monumental than the combination of systems and actions that have been used to “maintain colonial violence for generations,” the commissioners say.\n\nThe recommendations — framed in the report as “calls for justice” — include developing an effective response to human trafficking cases and sexual exploitation and violence, including in the sex industry. They are not optional, but constitute legal imperatives, the report says.\n\nAdvertisement 4\nSTORY CONTINUES BELOW\nArticle content\n\nAdditional calls include the need to establish a national Indigenous and human rights ombudsperson and a national Indigenous and human rights tribunal.\n\nRECOMMENDED FROM EDITORIAL\nResults of inquiry into 'genocide' of Indigenous women to be released today\nMissing, murdered women inquiry calls for justice system to review policies\n\nIt also recommends the development of a national action plan to ensure equitable access to employment, housing, education, safety, and health care, as well as long-term funding for education programs and awareness campaigns related to violence prevention.\n\nThe report also strongly focuses on the need for actors in the justice system and in police services to acknowledge that the historical and current relationship with Indigenous women, girls, and two-spirit people has been largely defined by “colonialism, racism, bias, discrimination, and fundamental cultural and societal differences.”\n\n“We further call upon all police services and justice system actors to acknowledge that, going forward, this relationship must be based on respect and understanding, and must be led by, and in partnerships with, Indigenous women, girls, and 2SLGBTQQIA (two-spirit, lesbian, gay, bisexual, transgender, queer, questioning, intersex, asexual) people.”\n\nAdvertisement 5\nSTORY CONTINUES BELOW\nArticle content\n\nMissing and murdered Indigenous women are believed to number in the thousands in Canada, but the report says that despite the commission’s best efforts to quantify the extent of the tragedy, “no one knows an exact number.”\n\nIn 2005, the Native Women’s Association of Canada created a database tracking cases and produced a 2010 report documenting 582 missing and murdered Indigenous women. In 2014, the RCMP released a national overview and pegged the number of cases between 1980 and 2012 at nearly 1,200. Other unverified estimates are far higher.\n\nResponding to the conclusions is the responsibility not only of federal and provincial governments and law enforcement agencies, but all Canadians in both the immediate and long-term, the report says.\n\n“Individuals, institutions, and governments can all play a part … We encourage you, as you read these recommendations, to understand and, most importantly, to act on yours.”\n\nOur website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our daily newsletter, Posted, here.\n\nArticle content\nShare this article in your social network\nYou will never turn off your computer again, if you own a mouse.\nPlay this game for 1 minute and see why everyone is addicted. No Installation. Play for free.\nPanzer.Quest\n|\nSponsored\nPlay Now\nAn eclectic mix of restaurants and chefs are vying for the coveted James Beard Awards\nNational Post\nPrime Minister Justin Trudeau should 'repent,' half-brother says\nNational Post\nIf you have a mouse, you will never turn off your computer again.\nPlay this game for 1 minute and see why everyone is addicted. No Installation. Play for free.\nPanzer.Quest\n|\nSponsored\nPlay Now\nSeniors in Alberta Eligible For Hearing Aids In April\nConnect Hearing\n|\nSponsored\nGet over $1,500 in value in the first year!*\nBMO\n|\nSponsored\nApply Now\nIf you have a mouse, this game will keep you awake all night long.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nCOMMENTS\nYou must be logged in to join the discussion or read more comments.\nCreate an Account\nSign in\nJOIN THE CONVERSATION\n\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.\n\nLoading...\nREAD NEXT\n \n \n \n \n \nLATEST FROM SHOPPING ESSENTIALS\nBeauty buzz: The must-try beauty products we put to the test this week\n\nRouge Hermès Orange Néon Lipstick, Nudestix Nudescreen Blush Tint SPF 30, and Pupa Dreamscape Translucent Face Highlighter.\n\n33 minutes ago\nFASHION & BEAUTY\n5 stylish trench coats to try on this season\n\nFrom a denim delight to a faux-leather find, theses are the five best trench coats of summer 2024.\n\n33 minutes ago\nFASHION & BEAUTY\nAdvertisement 2\nLast-minute Father's Day gifts that will arrive on time\n\nWhether he’s into tech, music, sports or the great outdoors\n\n3 hours ago\nSHOPPING ESSENTIALS\nThe 5 best Father's Day gifts for 2024\n\nWhether you’re up for a big, big splurge or looking to gift something small and sentimental, here are five perfect presents for Father’s Day\n\n1 day ago\nFASHION & BEAUTY\nHow to perfectly clean a toilet\n\nCleaning tips to help keep your toilet spotless and germ-free\n\n2 days ago\nSHOPPING ESSENTIALS\nTHIS WEEK IN FLYERS"}
{"url": "https://www.westerlynews.ca/news/red-dresses-hanging-on-ubco-campus-address-nation-wide-issue/", "title": "Red dresses hanging on UBCO campus address nation wide issue - Tofino-Ucluelet Westerly News", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\n13.5 °C\nHome News\nRed dresses hanging on UBCO campus address nation wide issue\nThe REDress Project at UBCO focuses on the conversation about missing and murdered Indigenous women\nCarli Berry\nFeb 28, 2018 12:53 PM\n\t\n\t\n\t\n\t\n\t\n\t\nRed dresses like this one could be seen on the UBCO’s campus Tuesday, as part of The REDress Project and tea talk held by the Women’s Resource Centre and Indigenous Students Association. - Credit: Carli Berry/Capital News\n\nRed dresses were blowing in the wind as they hung from trees, branches and poles at UBC Okanagan.\n\nTen dresses could be seen at the university as part of the REDress Project and tea talk, Tuesday Feb. 27.\n\nThe REDress Project is a nationwide event, focusing on the issue of missing and murdered Indigenous women.\n\n“It’s definitely for awareness. Even the people at the event don’t know a lot of information on missing and murdered Indigenous women. It’s generally not talked about on campus, or in everyday life,” said Taya Jardine, volunteer director at UBCO’s Women’s Resource Centre. “A lot of people don’ t know how close and how strongly impacted the local community is.”\n\nJardine was referring to the five women who went missing in the North Okanagan in less than two years. The body of one, Traci Genereaux, was found on a property in Salmon Arm in October.\n\nThe tea talks are held monthly on various topics throughout the year. This one featured missing and murdered Aboriginal women and approximately 20 students shared their voices on the subject.\n\n“The main aim of the tea talks is to really get information out there; to get students involved on campus in a safe space where they can talk about their feelings and opinions on different matters,” said Jardine.\n\n“I feel like bringing the dresses out forces that conversation out of Indigenous communities, into settler communities as well.”\n\nIndigenous women of all ages are being taken and murdered, said Jardine. “Some of the people we were talking about, especially Tina Fontaine, she was 15, just in the child protective system. Other ones are mothers and could be any of us really. That’s why it’s important to talk about.”\n\nFontaine was found dead in Winnipeg’s Red River in 2014. The man accused of the murder was found not guilty last week.\n\nIt’s about getting the information to a generation who can make changes, she said.\n\n“On the university campus people are here to learn and aside from learning terms, it should be an environment of social learning as well.”\n\nThe dress project was held by the Women’s Resource Centre in partnership with the Indigenous Students Association.\n\nTo report a typo, email: edit@kelownacapnews.com.\n\n<>\n\n@carliberry_\ncarli.berry@kelownacapnews.com\nLike us on Facebook and follow us on Twitter.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tUcluelet to host public hearing on nixing vacation rental restrictions\n\t\tWolf ‘likely’ cause of dog’s disappearance in Tofino\n\t\tCBT scores $7M for biosphere centre project in Tofino\n\t\tCedar & Salt withdraws from coffee shop plan at Ucluelet’s Amphitrite Point\n\t\tUcluelet's first annual Longboard Classic smashes expectations\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nCBT scores $7M for biosphere centre project in Tofino\nUcluelet to host public hearing on nixing vacation rental restrictions\nPilot program helps Nuu-chah-nulth youth get their driver’s licences\nUcluelet's first annual Longboard Classic smashes expectations\nTofino police looking for owner of wedding ring found on Cox Bay\nMore from Today In BC >\n  \nTofino-Ucluelet Westerly News\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nNanaimo News Bulletin\nCowichan Valley Citizen\nLake Cowichan Gazette\nChemainus Valley Courier\nLadysmith Chronicle\nTofino-Ucluelet Westerly News\nVancouver Island Free Daily\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Tofino-Ucluelet Westerly News and Black Press Media Publications Contact"}
{"url": "https://www.cloverdalereporter.com/news/lawyer-with-mmiw-inquiry-resigns-citing-government-interference/", "title": "Lawyer with MMIW inquiry resigns, citing government interference - Cloverdale Reporter", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAuto\nJobs\nObituaries\nGood News\n12.6 °C\nHome News\nLawyer with MMIW inquiry resigns, citing government interference\nA lawyer for the National Inquiry has announced he’s resigned\nThe Canadian Press\nJul 2, 2018 5:22 PM\n\t\n\t\n\t\n\t\n\t\n\t\nThe Canadian Press The Canadian Press\n\nA lawyer for the National Inquiry into Missing and Murdered Indigenous Women and Girls has announced he’s resigned, and in a statement cites government interference among his reasons.\n\nBreen Ouellette, who worked as a commission counsel for the inquiry at its Vancouver offices, posted online that he resigned on June 21.\n\nBreen, who is Metis, says in the statement that he believes the federal government has “undermined the independence and impartiality of the national inquiry” and that he cannot remain part of a process that he says “is speeding towards failure.”\n\nRELATED: Final day of public hearings for missing and murdered Indigenous women and girls\n\nHe also asks the inquiry’s commissioners to allow him to fully disclose the reasons behind his resignation, which he says he cannot do as a lawyer.\n\nThe inquiry has been plagued by chronic delays, staff turnover and complaints from families about disorganization, poor communication and a lack of transparency.\n\nNadine Gros-Louis, a spokeswoman for the inquiry, confirmed in an email that Ouellette has stepped down, noting that staffing changes do occur.\n\n“As you can appreciate, and as with all organizations, staffing does not remain constant, especially in an environment dealing with difficult subject matter where many staff work extended hours,” Gros-Louis wrote.\n\nBreen’s statement doesn’t mention long hours. As an example of government interference, though, he said the inquiry needs to be able to properly investigate allegations of “illegal and improper” foster-care apprehensions.\n\n“The national inquiry could use its powers to force government departments to comply with investigations into these allegations. The perpetrators could be identified so that governments could stop the misuse of billions of Canadian tax dollars by a few heartless bureaucrats seeking to advance their careers,” Breen wrote.\n\n“However, interference by the federal government is undermining this important function of the national inquiry. Canadians deserve to know which provinces and territories perpetuate this unnecessary and harmful spending of billions of tax dollars on foster-care apprehensions.”\n\nLast month, the government turned down a request by inquiry officials for a two-year extension in order to give commissioners until Dec. 31, 2020, to make recommendations and produce findings.\n\nInstead, the government agreed to only extend the inquiry’s deadline by another six months. That gives commissioners until next April 30 to finish its hearings and submit a final report, instead of the initial deadline of Nov. 1 of this year.\n\nRELATED: Search for missing women to continue\n\nReached late Monday, Breen said the refusal to grant the two-year-extension, along with the funding for it, shows the government isn’t serious about the commissioners meeting the inquiry’s mandate.\n\n“They’re trying to kill the national inquiry in a death by a thousand cuts, and they’re trying to pin the failure on the commissioners,” Breen said in a phone interview from Vancouver.\n\nCarolyn Bennett, minister of Crown-Indigenous relations, explained the decision to extend the mandate by just six months was made in part because provinces and territories were not unanimously supportive of extending the terms of reference for the inquiry into next year.\n\nGros-Louis, meanwhile, said the inquiry remains independent and impartial.\n\n“With diverse backgrounds, experience and expertise, we are united by a deep commitment to honour the missing and murdered, uncover the truth and build a better future for Indigenous women and girls,” she wrote.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending in News\n\t\tB.C. United promises free shingles vaccine after seniors advocate report\n\t\tPilot makes emergency landing at Manning Park\n\t\tB.C. company receives hundreds of millions to expand hydrogen fuel stations\n\t\tBody of missing rower found in Abbotsford\n\t\tWhite Rock faces multi-unit housing quandary\nFacebook Comments (0) \n3 sent to hospital after serious motorcycle crash in Surrey\nBlack Press Media\nUPDATE: Vancouver synagogue arson being investigated as hate crime, police say\nBlack Press Media\nDon't Miss Last Minute River Cruise Bargains! Search Here\nFavorite Searches\n|\nSponsored\nLearn More\nWhen to Retire: A Guide for Canadians With $500k+\nFisher Investments Canada\n|\nSponsored\n2024 Last Minute Cruise Bargains (Search The Prices)\nFavorite Searches\n|\nSponsored\nLearn More\nRestaurant, 80-room hotel proposed for South Surrey\nBlack Press Media\nMan given over 3 years for violent sexual assault at CFB Esquimalt dorm\nBlack Press Media\nUnsold Cruise Cabins: Last-Minute Discounts (Take A Look)\nFavorite Searches\n|\nSponsored\nLearn More\nCruise Deals Alert: Last-Minute Offers You Can't Miss\nFavorite Searches\n|\nSponsored\nLearn More\nMassive Last-Minute Cruise Deals (Book Now)\nFavorite Searches\n|\nSponsored\nLearn More\nHeppells to host last Ugly Potato Day event at South Surrey farm\nBlack Press Media\nSurrey Greek Food Festival cooks again for first time in 4 years starting Friday\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nMrs. Meow Meow recovering after being shot on Vancouver Island \nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nVancouver Bandits win third straight\nHarrison Hot Springs Mayor Ed Wood resigns\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nMore from Today in B.C. >\n \nCloverdale Reporter\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nToday in BC\nCanadian News\nWorld News\nEntertainment\nSports\nBusiness\nTrending Now\nOpinion\nSubmit News Tips\nLangley Advance Times\nNeighbours\nSurrey Now Leader\nMaple Ridge-Pitt Meadows News\nPeace Arch News\nAldergrove Star\nLangley Advance Times\nNorth Delta Reporter\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nBook a Print Ad\nAuto\nToday's Drive\nAuto Showcase\nJobs\nLocalWork\nJoin Our Team\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\nLocal Good News\nSocial Media\nCloverdale Live\nToday in BC\nYoutube\nI love British Columbia\nI love Alberta\nI love Nunavut\nI love Yukon\nI love Northwest Territories\n© 2024 Cloverdale Reporter and Black Press Media Publications Contact"}
{"url": "https://www.caledoniacourier.com/news/vigil-downtown-kelowna-to-remember-missing-and-murdered-indigenous-women/", "title": "Vigil in downtown Kelowna to remember Missing and Murdered Indigenous Women - Caledonia Courier", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\nHome News\nVigil in downtown Kelowna to remember Missing and Murdered Indigenous Women\nIn Canada, Indigenous women, girls, and 2SLGBTQIA+ people experience high rates of violence\n\tJacqueline Gelineau\n\nOct 6, 2023 8:13 AM\nOct 6, 2023 8:22 AM\n\t\n\t\n\t\n\t\n\t\n\t\n(Jacqueline Gelineau/Capital News)\n\nThe Ki-Low-Na Friendship Society hosted a vigil in downtown Kelowna to remember the Missing and Murdered Indigenous Women, Girls and 2SLGBTQIA+ (MMIWG+) people in North America.\n\nA march through the streets of downtown on Oct. 4, was followed by a ceremony where Elders stood beside the next generation of Kelowna’s Indigenous leaders to drum, sing and hold space for their missing and murdered sisters and 2SLGBTQIA+ community members.\n\nIn Canada, Indigenous women, girls, and 2SLGBTQIA+ people experience higher rates of violence and are over-represented as victims of violent crime, when compared to the rest of the population, according to the Canadian Federal Government, the Assembly of First Nations, the MMIWG+ National Action Plan, and the Canadian National Inquiry into MMIW+.\n\nThe exact number of missing and murdered Indigenous women, girls, and 2SLGBTQIA+ people in Canada is unknown as thousands of deaths and disappearances have not been reported or have been misreported, says the MMIWG+ National Action Plan.\n\nThe National Action plan calls on all levels of government to step up and implement strategies to stop violence against Indigenous women, girls and 2SLGBTQIA+ people.\n\nIn Kelowna, the Ki-Low-Na Friendship Society works at a community level to support Indigenous people, offer resources and share knowledge. Members of the RCMP and city council attended the vigil as a show of support in the fight to stop violence against Indigenous women and gender-diverse people.\n\nThe National Action Plan aims to address and bring awareness not only to missing and murdered women, but also to instances of sexual assault, child abuse, bullying, harassment and self-harm, which disproportionately impact Canada’s female and two-spirit Indigenous community.\n\nThe Final Phase Report by the National Inquiry says that “persistent and deliberate human and Indigenous rights violations and abuses are the root cause behind Canada’s staggering rates of violence against Indigenous women, girls and 2SLGBTQIA+ people.”\n\nPeople at the vigil in Kelowna shared stories of loss and came together to remember their sisters who are missing and who have died.\n\nKelowna’s Friendship Society offers support and programming to people in all stages and phases of life while working with the community in Kelowna to preserve, share and promote Indigenous culture. To learn more about the Ki-Low-Na Society, and the services they offer, visit kfs.bc.ca.\n\nFor more information on the actions taken by the federal government visit rcaanc-cirnac.gc.ca.\n\nHave a story/tip?\n\t\n\nAbout the Author: Jacqueline Gelineau\n\nRead more\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tFort St. James teacher to scale Mt. Everest equivalent to fundraise for Gaza children\n\t\tRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\n\t\tSearchers scan aerial video for clues about missing B.C. climbers\n\t\tCan Kootenay factory-built homes help solve B.C.'s housing crisis?\n\t\tThis new EV gets you to the Okanagan and back for $35\nFacebook Comments (0) \nFort St. James teacher to scale Mt. Everest equivalent to fundraise for Gaza children\nBlack Press Media\nNew B.C. laws mandate safe distance between vehicles, pedestrians and others\nBlack Press Media\nIf you have a mouse, this game will keep you awake all night long.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nDon't Miss Last Minute River Cruise Bargains! Search Here\nFavorite Searches\n|\nSponsored\nLearn More\nPlay this game for 1 minute and see why everyone is addicted.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nGreening Up Fort St. James dissolving after 15 years of environmental advocacy\nBlack Press Media\nBlack Press Media parent company acquires Oregon’s largest newspaper group\nBlack Press Media\n2024 Last Minute Cruise Bargains (Search The Prices)\nFavorite Searches\n|\nSponsored\nLearn More\nUnsold Cruise Cabins: Last-Minute Discounts (Take A Look)\nFavorite Searches\n|\nSponsored\nLearn More\nCruise Deals Alert: Last-Minute Offers You Can't Miss\nFavorite Searches\n|\nSponsored\nLearn More\nTerrace police remove distraught passenger from Westjet flight\nBlack Press Media\nNew ‘Hunger Games’ novel, ‘Sunrise on the Reaping,’ coming next year\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nHarrison Hot Springs mayor resigns amid clashes with council\nMrs. Meow Meow recovering after being shot on Vancouver Island \nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nSearchers scan aerial video for clues about missing B.C. climbers\nMore from Today in B.C. >\n \nCaledonia Courier\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nTerrace Standard\nThe Northern View\nSmithers Interior News\nKitimat Northern Sentinel\nHaida Gwaii Observer\nBurns Lake Lakes District News\nHouston Today\nVanderhoof Omineca Express\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Caledonia Courier and Black Press Media Publications Contact"}
{"url": "https://www.asianage.com/world/americas/040619/womens-rights-slipping-gender-equality-under-attack-canadian-pm-justin-trudeau.html", "title": "‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau", "body": "  Menu e-Paper | Age on Sunday  \n Auto Refresh  Search   Horoscope\n\nTuesday, Jun 11, 2024 | Last Update : 12:05 AM IST\n\nHome\n \nIndia\nWorld\nMetros\nBusiness\nOpinion\nSports\nTechnology\nEntertainment\nPhotos\nLife\nNewsmakers\n \nMore  \nBooks\nScience\nHoroscope\nAge on Sunday\nDelhi Age\nMumbai Age\nDecaf\nDiscourse\n360 Degree\nEditors' Picks\nJust In\nPlay Games\n   World   Americas  04 Jun 2019  ‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau\nWorld, Americas\n‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau\nREUTERS\nPublished : Jun 4, 2019, 10:58 am IST\nUpdated : Jun 4, 2019, 10:58 am IST\n\nConference opened by procession of indigenous men and women, in traditional clothing, wearing red in memory of murdered and missing girls.\n\n Trudeau hailed as a 'significant step toward justice' a Canadian government finding on Monday that the death of more than 1,000 aboriginal girls and women in recent decades was a national genocide. (Photo: File)\n\nVancouver: Gender equality is “under attack” amid hatred, misogyny and politicians campaigning to undo women’s rights, Canadian Prime Minister Justin Trudeau said on Monday at the launch of a global conference on women’s issues.\n\nProgress in women’s rights is backsliding in the face of taunts and hostility that travel on social media and seep into public discourse, said Trudeau, a self-avowed feminist who appointed the first gender-balanced cabinet.\n\nSome 8,000 delegates from more than 165 countries are attending Women Deliver in Vancouver, the world’s largest gender equality conference, which will address topics from women’s political empowerment to education and employment.\n\nThe conference was opened by a procession of indigenous men and women, clad in traditional clothing, some wearing red in memory of murdered and missing girls and women.\n\nTrudeau hailed as a “significant step toward justice” a Canadian government finding on Monday that the death of more than 1,000 aboriginal girls and women in recent decades was a national genocide.\n\nThe report, from an inquiry launched by Trudeau’s government in 2016, blamed the violence on long-standing discrimination against indigenous people and Canada’s failure to protect them.\n\n“For too long, indigenous women and girls have experienced violence at a rate that is staggering when compared to non-indigenous women,” Trudeau said.\n\nThe report made scores of recommendations, and Trudeau vowed to develop and implement a national action plan to prevent future violence.\n\nHe told delegates that women around the world were battling misogyny, racism and hatred.\n\n “Gender equality is under attack,” he said. “Individuals and interest groups are trying to roll back women’s rights. “Politicians are giving into the pressure, shamefully campaigning to undo women’s hard-won victories. That’s a daunting reality.”\n\nThe inquiry into the missing and murdered women was a painful process that heard testimony from thousands of witnesses, including hundreds of family members of victims.\n\nCiting colonial violence, racism, sexism and more, the report said many indigenous people have grown up normalized to violence, while Canadian society showed “an appalling apathy” to addressing the issue.\n\n “The National Inquiry into Missing and Murdered Indigenous Women and Girls finds that this amounts to genocide,” it said.\n\nTags: canada pm, justin trudeau, women empowerment, racism, sexism\nLocation: Canada, Ontario\nLATEST FROM WORLD\nSouth Africa's ANC calls demands for President Ramaphosa to step down for coalition talks a 'no-go'\n\nChina's Chang'e-6 successfully lands on rarely explored Moon's far side to collect samples\n\nIndia discusses Maldives debt\n\nIndia asks Iran to free Indians on seized ship\n\nADVERTISEMENT\nMOST POPULAR\n1\n\nClean chit for Aryan Khan in cruise drugs case\n\n2\n\n'Chak de phatte India', says Harnaaz Sandhu after becoming Miss Universe 2021\n\n3\n\nMutation linked to remdesivir resistance found in Covid patient\n\n4\n\nClimate finance isn’t charity, says Union minister Bhupender Yadav at COP26 summit\n\n5\n\nIndian origin astronaut-led NASA's SpaceX Crew-3 team headed to ISS\n\nMORE\nADVERTISEMENT\nEDITORS' PICKS\nParsa Venkateshwar Rao Jr | Ambiguities remain amid India’s pledges at COP26\nJai Bhim: Protecting rights and providing hope in India’s democracy\n‘Afghanistan has changed, women will fight back’\nThe world was silent: Afghan filmmaker Sahraa Karimi on Taliban takeover\nI selected Irrfan Khan because of his eyes: Mostofa Sarwar Farooki\nMORE\nALSO FROM\nENTERTAINMENT\nActor RanaDaggubati and entrepreneur Miheeka Bajaj tied the knot on Saturday evening\nPre-Oscar party sets the mood for the big day\nAmbani bash: SRK, Shahid, Aishwarya and others snapped at Antilia\nPics: Take inspiration for your next vacay from Kiara Advani\nCity Of Stars: Hrithik, Malaika, Kartik & others spotted in Mumbai\nWAR screening: Ananya, Varun, Disha and others watch Hrithik-Tiger's film\nHome Deccan Chronicle Andhrabhoomi Financial Chronicle About Us Contact Us Feedback E-Paper Privacy Policy\n\nCopyright © 2016 - 2024 The Asian Age.\nDesigned, Developed & Maintained By Daksham"}
{"url": "http://www.caledoniacourier.com/news/justice-rally-walk-to-end-violence-against-women/", "title": "Justice rally, walk to end violence against women - Caledonia Courier", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\nHome News\nJustice rally, walk to end violence against women\nSurvivors, supporters, local RCMP detachment and members of the community joined together in a Walk to End Violence on Friday June 9. The walk started and ended at Chief Kwah Memorial hall with a mid point stop at Spirit Square. At all three points; the start, the middle and the end people shared a few words, speaking up against violence experienced by women, especially indigenous and marginalised women of minority groups.\nFiona Maureen\nJun 21, 2017 1:30 AM\n\t\n\t\n\t\n\t\n\t\n\t\nParticipants walked from Kwah Hall to Spirit Square where a few people spoke against domestice violence. Photo Fiona Maureen\n\nSurvivors, supporters, local RCMP detachment and members of the community joined together in a Walk to End Violence on Friday June 9. The walk started and ended at Chief Kwah Memorial hall with a mid point stop at Spirit Square. At all three points; the start, the middle and the end people shared a few words, speaking up against violence experienced by women, especially indigenous and marginalised women of minority groups.\n\n“The National Inquiry into Missing and Murdered Indigenous Women and Girls is coming up [to Prince George] and people should be getting their communities ready. Women who have experienced violence can still apply to be a witness at the Inquiry. It is reported that they are going to need an extension. Communities need to get their services ready to support survivors,” said Marion Erickson of the Northern Women’s Centre.\n\n“Community leaders need to get their indigenous healers, mental health services, and transportation ready. They will need to fundraise for transportation to get to the inquiry because that is not going to be covered by the inquiry. Go to the inquiry website [www.mmiwg-ffada.ca] and speak to some of the family and see if they need some emotional and spiritual support. One of the tough things which is going on right now is that a lot of people on reserve don’t have internet. They need to stay informed as much as they can. It’s going to be a hard time for our communities people should be ready and people shouldn’t be speaking against it [the Inquiry],” said Marion Erickson.\n\nMarion openly shares that she is a survivor of domestic violence. For the past few years Marion has been working towards her undergraduate degree in Public Administration and Community Development. Recently, she was elected by the student body of to Senate where she sits on various senate committees. Marion was also recently awarded the Student Mentorship opportunity by the Prince George City Council and attended the 2017 Federation of Canadian Municipalities meeting in Ottawa last week. She will graduate from her Bachelors degree in 2019.\n\nWhen asked about this walk and how it came about, the organiser, Youth Justice coordinator, Maddison Sam explained, “Originally it began with a young women’s group. I wanted to educate them about healthy living, healthy lifestyle, drug awareness, living with an addict and then it came about, talking about violence against women and how it gets pushed to the side a lot.”\n\n“One quote that really spoke to me”, says Maddison, “The honour of our people lies in the moccasin tracks of the women and its true our community wouldn’t be where it is if it wasn’t for the women. And all our women are slowly being marginalised. You see it with drug addictions, sexual violence, domestic violence, collateral violence [experienced by children in families where there is abuse], and our women are becoming silent. I just want everyone know that they are not alone. It happens too often and I believe it is getting worse and pushed under the table. Our women are scared to speak out, they are intimidated. And this is something Nak’azdli should be talking about. We are a strong community, we have so many assets in our community. But violence in our community is not something that’s really discussed. “Violence against women is not something that is not discussed. It is not reported. There are not a lot of reported incidences. That is the issue. You hear it in women talking about it, they open up to you, lots of them come to me share situations that they are in.”\n\nMaddison Sam grew up in Fort St. James. She just recently graduated with a Diploma in Criminology from the College of New Caledonia. She is the Youth Justice Coordinator for the Nak’azdli Alternate Justice Centre. She is running programs over the summer and engaging with youth in a way that promotes healthy lifestyles while focusing on awareness and prevention activities.\n\nMaddison explains how she started the ‘Ts’ekezoo’ Young Women’s Group in the beginning of May. “The intent behind this group is to promote healthy, independent lifestyles within the young women. From this idea, I had thoughts about having a ‘Violence Against Women Awareness’ walk. After discussing some ideas with my coworkers and community members, it was evident that an initiative to spread awareness was needed in our community.\n\n“Violence against women is more common than people may think. The Canadian Women’s Foundation website states that half of all women in Canada have experienced at least one incident of physical or sexual violence since the age of 16. Not to mention, Aboriginal women are being killed at six times the rate of Non-Aboriginal Women. These facts are very concerning.\n\n“This march was a great opportunity for not only the Nak’azdli Whut’en, but the whole community to demonstrate that we do not condone or tolerate this type of behaviour. Also, this was a way to show possible victims of violence that they are not alone. Violence affects everyone and comes in many forms. Whether it be physical, sexual, emotional, psychological, or verbal abuse, it is not okay. Too often, women are afraid to speak out because of intimidation or fear of backlash. By the community gathering together, we are breaking this silence,” says Maddison.\n\nParticipants walked from Kwah Hall to Spirit Square where a few people spoke against domestice violence. Photo Fiona Maureen\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tFort St. James teacher to scale Mt. Everest equivalent to fundraise for Gaza children\n\t\tRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\n\t\tSearchers scan aerial video for clues about missing B.C. climbers\n\t\tCan Kootenay factory-built homes help solve B.C.'s housing crisis?\n\t\tThis new EV gets you to the Okanagan and back for $35\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nHarrison Hot Springs mayor resigns amid clashes with council\nMrs. Meow Meow recovering after being shot on Vancouver Island \nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nSearchers scan aerial video for clues about missing B.C. climbers\nMore from Today in B.C. >\n \nCaledonia Courier\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nTerrace Standard\nThe Northern View\nSmithers Interior News\nKitimat Northern Sentinel\nHaida Gwaii Observer\nBurns Lake Lakes District News\nHouston Today\nVanderhoof Omineca Express\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Caledonia Courier and Black Press Media Publications Contact"}
{"url": "http://www.reddeeradvocate.com/news/tears-flow-at-thunder-bay-hearing-for-missing-and-murdered-indigenous-women-inquiry/", "title": "Tears flow at Thunder Bay hearing for missing and murdered Indigenous women inquiry - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nTears flow at Thunder Bay hearing for missing and murdered Indigenous women inquiry\nA grieving mother, clutching a feather gifted to her by an elder, wiped back tears on Monday as she recounted the torment of losing her daughter — one of dozens of missing and murdered Indigenous women a public inquiry is investigating.\nThe Canadian Press\nDec 4, 2017 10:00 PM\n\t\n\t\n\t\n\t\n\t\n\t\n\nA grieving mother, clutching a feather gifted to her by an elder, wiped back tears on Monday as she recounted the torment of losing her daughter — one of dozens of missing and murdered Indigenous women a public inquiry is investigating.\n\nAs the first witness to testify at the start of three days of hearings in Thunder Bay, Ont., Anita Ross told the National Inquiry into Missing and Murdered Indigenous Women and Girls of her mounting despair the evening her daughter, Delaine Copenace, 16, disappeared in February last year.\n\n“She went for a walk with other teens,” Ross, of Kenora, Ont., testified, as a photograph of her dead daughter sat on a nearby empty chair. “She never returned.”\n\nRoss said provincial police were initially dismissive of her concerns, suggesting the girl was probably just drunk somewhere. But Ross said Delaine, who had a twin sister, was responsible and always let her family know where she was. They began searching, putting up posters, contacting everyone they knew, activating social-media networks.\n\n“I was so scared, really hurt not knowing where she was,” Ross said. “It really hurts not knowing where your baby was. I was adamant to find her.”\n\nRoss said she felt she couldn’t trust most of the provincial police officers she had to deal with. They seemed indifferent to her anguish, she said.\n\nScores of volunteers and officers would launch an exhaustive search for Delaine, but police called off their search after 14 days.\n\n“That broke my heart,” Ross said, tears streaming down her face. “It’s like they gave up on her. I was so angry and hurt.”\n\nSeveral mornings later, officers arrived at her door.\n\n“They told me they had found a body,” she recalled. “I asked them right away: Is it my daughter? They said they didn’t know yet. But I think they knew already.”\n\nDelaine had been found in the water, still wearing her favourite T-shirt, in Lake of the Woods in March 2016, several weeks after she went missing. Within two days of the grim discovery, the coroner decided the teen had drowned with no evidence of foul play. There would be no inquest, a decision that only added to her anguish.\n\nThe “garbage” coroner’s report, Ross added, was sloppy and arrived without warning at her home via regular mail.\n\nHer daughter, Ross said, showed signs of bruising and no bloating.\n\n“Somebody hurt my baby,” she said. “There’s just no way my daughter was in the water all that time. I believe my daughter was abducted and held against her will.”\n\nRoss said the feather she was holding was given to her by an elder during the search. “He said, ‘Think of it as your daughter’.”\n\nThe hearings, in a city in which First Nations have long complained of racism, opened at a hotel with drummer women and the lighting of an oil lamp, traditionally used by the Inuit to provide heat and light in igloos and the North. Elders and support workers were on hand in purple T-shirts to help because “it does get heavy sometimes,” said Barbara Sevigny, a health worker.\n\n“Even if they’re found, the murder is never solved,” Sevigny said. “Let’s hope something gets done.”\n\nOne of the four commissioners, Brian Eyolfson, said solving the problem of violence would be a long-term process.\n\nCo-commissioner Michele Audette, said it was important to acknowledge the purpose of the inquiry and the desolation felt by many relatives of the murdered and missing.\n\n“A loved one disappears, a loved one got killed. And where was the system?” Audette said in opening remarks. “What we hear so far: They were so lonely.”\n\nThe inquiry, Audette said, will allow Canada to “officially listen” to what went wrong and “our truth.”\n\nIn all, about 50 family members and survivors are due to tell their stories during the two days of live-streamed public hearings and a third day of private submissions.\n\nThe federal government set up the inquiry in December 2015 to address the high number of missing and murdered Indigenous women and girls. The commissioners officially began the inquiry in September 2016 and were hoping to issue a final report by the end of 2018.\n\nAt least eight Indigenous students, in Thunder Bay for schooling, have been found dead in recent years — several by drowning.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://www.reddeeradvocate.com/news/holes-in-duvet-cover-under-scrutiny-in-death-of-teenaged-girl/", "title": "Holes in duvet cover under scrutiny in death of teenaged girl - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nHoles in duvet cover under scrutiny in death of teenaged girl\nThe trial of a man accused of killing a 15-year-old Indigenous girl in Winnipeg has heard more testimony about a duvet cover that was wrapped around the girl when she was found.\nThe Canadian Press\nFeb 5, 2018 11:00 AM\n\t\n\t\n\t\n\t\n\t\n\t\n\nThe trial of a man accused of killing a 15-year-old Indigenous girl in Winnipeg has heard more testimony about a duvet cover that was wrapped around the girl when she was found.\n\nRaymond Cormier has pleaded not guilty to second-degree murder in the death of Tina Fontaine, whose body was pulled from the Red River in August 2014.\n\nThe trial heard from two women last week who said the duvet cover looked the same as one that Cormier used while living in a tent in their backyard.\n\nOne of the women said she had seen two cigarette burn marks in the cover Cormier had.\n\nThe trial heard today from Winnipeg police Const. Garrett Carrette, who brought the duvet cover Tina’s body was discovered in to court and showed the jury two holes in it.\n\nUnder cross-examination, Carrette agreed with Cormier’s lawyer that the holes looked like rips or tears in the fabric.\n\nTina died shortly after moving from the Sagkeeng First Nation to Winnipeg to visit her mother.\n\nShe became a sexually exploited youth and was missing for days before her body was found.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCentral Alberta RCMP search for suspects in an armed home invasion\nFacebook Comments (0) \nInnisfail RCMP vehicle rammed at Pine Lake traffic stop\nBlack Press Media\nCentral Alberta RCMP search for suspects in an armed home invasion\nBlack Press Media\nPlay this game for 1 minute and see why everyone is addicted.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nIf you have a mouse, you have to play this game. \nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians Under Age 80 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nTornado watch issued for Wetaskiwin\nBlack Press Media\nParkade expansion progressing at Red Deer hospital\nBlack Press Media\nCurrently the best free game. \nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians In Alberta With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nEmpty Alaska Cruises Departing From Alberta That Seniors Can Book For Dirt Cheap\nFavorite Searches\n|\nSponsored\nRed Deer man, Oilers fan sets up oil derrick in pickup truck\nBlack Press Media\nThunderstorm spawns five tornadoes in Central Alberta\nBlack Press Media\nAlways Keep a Bread Clip in Your Wallet, Here's Why\nLifeHackGuru\n|\nSponsored\nWhat is the best way to make a second income per month?\nWise Tips\n|\nSponsored\nEmpty Alaska Cruise Cabins For Sale Now (See Prices)\nSearchTopics\n|\nSponsored\nMOST POPULAR\nCyclists participate in Fancy Women Bike Ride in Red Deer\nBlack Press Media\nMOST POPULAR\nSeven Red Deer Renegades players sign with RDP Queens Soccer\nBlack Press Media\nHang A Bag Of Water With Pennies Outside Your Front Door\nLifeHackGuru\n|\nSponsored\nCanadians Born 1944 - 1983 Could Get This Benefit\nSeniors Choice\n|\nSponsored\nUnsold Ductless AC Units Cost Almost Nothing To Run (Take A Look)\nGoSearches\n|\nSponsored\nRed Deer Emergency Services responds to fire at high school\nBlack Press Media\nOne home damaged from Central Alberta tornado\nBlack Press Media\nFormer Rebels lead Oilers to first Stanley Cup Final in 18 years\nBlack Press Media\nRed Deer Polytechnic celebrates graduates at 60th convocation\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "http://www.reddeeradvocate.com/news/families-walk-highway-of-tears-before-mmiw-hearing/", "title": "Families walk Highway of Tears before MMIW hearing - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nFamilies walk Highway of Tears before MMIW hearing\nSMITHERS, B.C. — Gladys Radek raised a fist in the air and wept as she reached the end of her 350-kilometre journey along British Columbia’s Highway of Tears.\nThe Canadian Press\nSep 25, 2017 8:10 PM\n\t\n\t\n\t\n\t\n\t\n\t\nPhoto by THE CANADIAN PRESS Driving a car covered with photos of missing women, Gladys Radek, left, is overcome with emotion as she leads a group of family members and advocates of missing and murdered Indigenous women and girls upon arrival in Smithers, B.C., after walking along the so-called Highway of Tears, on Monday. Radek organized the walk along the notorious stretch of Highway 16 where dozens have disappeared or been killed in honour of the 12th anniversary of the disappearance of her niece, Tamara Lynn Chipman. The walk began in Prince Rupert and ended in Smithers where the National Inquiry into Missing and Murdered Indigenous Women and Girls is holding hearings beginning Tuesday.\n\nSMITHERS, B.C. — Gladys Radek raised a fist in the air and wept as she reached the end of her 350-kilometre journey along British Columbia’s Highway of Tears.\n\nThe Indigenous grandmother finished her walk along the notorious stretch of Highway 16 for the seventh and final time on Monday. It is the same highway where her beloved niece Tamara Lynn Chipman disappeared.\n\nOutside a community centre in Smithers, B.C., her voice shook as she spoke to those who had walked alongside her, including commissioners from the national inquiry into missing and murdered women.\n\n“I want to thank you all for standing so proud and loud, to show our commissioners that we have love for our missing and murdered women,” she said through tears.\n\n“I’m very proud of this moment right now because when Tamara went missing, nobody cared. When Tamara went missing, there were many others who were already missing, many others who had been murdered.”\n\nDozens of women have disappeared or been killed along the highway between Prince Rupert and Prince George in central B.C.\n\nRadek and other family members and advocates left Prince Rupert on Thursday and arrived Monday in Smithers, where the National Inquiry into Missing and Murdered Indigenous Women and Girls will hold hearings starting Tuesday.\n\nThe walkers were accompanied by vehicles and have covered sections of the route in a relay fashion, allowing them to complete the walk of hundreds of kilometres over the span of a few days.\n\nDuring the final stretch through the town of Smithers, Radek, who is missing a leg, drove a car covered in photographs of women who have disappeared or been killed. She wept behind the wheel as passersby waved and honked their horns.\n\nInquiry commissioner Michele Audette joined the group three days ago, while Chief Commissioner Marion Buller joined on Monday. Commissioner Qajaq Robinson was supposed to attend the hearings but had to bow out due to a family emergency.\n\nAudette said she walked to honour the resilience and strength of the families who will be speaking for the first time to the inquiry. The hearings will be powerful, she said.\n\n“I feel it since I arrived, there’s a lot of emotion, lots of anxiety also or stress, because it’s the first time for them,” she said. “Just being there beside them and listening, maybe it’s helped.”\n\nThe inquiry has been plagued by controversy, including the resignation of commissioner Marilyn Poitras this summer and complaints from families about poor communications and delays.\n\nBuller told a Senate committee last week that the inquiry’s work has been hampered by federal bureaucracy.\n\nRhonda Lee McIsaac, who lives in Haida Gwaii and has Ojibway heritage, participated in the walk for the first time and said it was a moving experience.\n\n“I’m walking for everybody who cannot walk,” said McIsaac. “I have lost a loved one. I grew up in foster care and I was adopted out. This is part of my story.”\n\nMore than 40 people have signed up to speak at the Smithers hearings, which run through Thursday. They are the second hearings held by the inquiry after it visited Whitehorse in May.\n\nThe inquiry is set to visit nine communities this fall, including Edmonton, Winnipeg and Thunder Bay, Ont.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCentral Alberta RCMP search for suspects in an armed home invasion\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://www.reddeeradvocate.com/news/red-dresses-a-reminder-of-missing-and-murdered-indigenous-women/", "title": "Red dresses a reminder of missing and murdered Indigenous women - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nRed dresses a reminder of missing and murdered Indigenous women\nDozens of red dresses hung around Red Deer and Red Deer College\n\tPaul Cowley\n\nNov 25, 2019 2:00 PM\nNov 25, 2019 5:26 PM\n\t\n\t\n\t\n\t\n\t\n\t\n\nDozens of red dresses were hung around Red Deer on Monday, poignant reminders of the huge number of missing and murdered Indigenous women.\n\n“The dresses that are hanging are empty. We’re trying to show the significance and the impact of the numbers of murdered and missing Indigenous women,” said Sheila Bannerman, of the Red Feather Women.\n\nHow many have gone missing or been murdered is not even known, said Bannerman. The last up-to-date numbers were gathered in 2015 as preparations were underway for that year’s tour of the Walking With Our Sisters installation, which was at the Red Deer District Museum and Art Gallery that June.\n\n“At that time, we were told there were 1,200 murdered women (since 2012) whose cases were considered unfounded or were not followed up on,” said Bannerman.\n\n“That’s a long time ago, and we don’t really have any updated stats because stats aren’t kept on this.\n\n“That’s the issue. These women are human beings, they are people, they have human rights, they are family members and it doesn’t matter what the circumstances are of their lives,” said Bannerman.\n\n“They are people and deserve the respect of an investigation into where they are if they’re missing or what happened if they were murdered.\n\n“So that’s why we’re here.”\n\nALSO READ: Red dresses will be hung throughout Red Deer on Monday\n\nWhat statistics are available tell a tragic story. The homicide rate for Indigenous women in Canada is six times higher than the rate for non-Indigenous women.\n\nIn 2015, Indigenous women accounted for nearly one-quarter of female homicide victims, even though they represent only 2.5 per cent of the population.\n\nIndigenous women are five times more likely to die from violence as non-Indigenous women.\n\nA forum was held at Red Deer College on Monday, which was the United Nations International Day for the Elimination of Violence Against Women.\n\nRed dresses were first used to draw attention to missing and murdered Indigenous women in 2009, when Winnipeg-based Metis artist Jaime Black created the REDdress Project, an art installation that toured North America.\n\nAbout 50 red dresses were donated and hung from trees around the city on Monday, including at City Hall, the courthouse, in front of the Red Deer Native Friendship Society’s office, and near the Dumpster where murder victim Talia Meguinis’s body was found in 2012.\n\nMeguinis was killed on Feb. 20, 2012, and her body was stuffed into a Dumpster in the alley behind her Riverside Meadows apartment.\n\nOne of the dresses was also hung in Gasoline Alley as a reminder that highways often prove dangerous places for women, who unwittingly catch rides with predators.\n\nTalitha Klym, who is with the college’s Indigenous students services, said they wanted to focus on Indigenous women for one day of the students’ association’s 16 Days of Activism against Gender-based Violence and reached out to the Red Deer Feather Women to participate.\n\nThey put together 500 postcards, each with a small felt red dress attached.\n\nOne side talks about the initiative and the back provides information on how people can get involved in spreading the message through their own actions and attitudes.\n\nKlym found that many students were unaware of the significance of the red dresses, but have shown their interest in learning about it.\n\nThere’s been a lot of support,” she said.\n\n\npcowley@reddeeradvocate.com\nLike us on Facebook and follow us on Twitter\n\nHave a story/tip?\n\t\n\nAbout the Author: Paul Cowley\n\nPaul grew up in Brampton, Ont. and began his journalism career in 1990 at the Alaska Highway News in Fort. St. John, B.C.\nRead more\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCentral Alberta RCMP search for suspects in an armed home invasion\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "https://www.cloverdalereporter.com/news/lawyer-with-mmiw-inquiry-resigns-citing-government-interference/", "title": "Lawyer with MMIW inquiry resigns, citing government interference - Cloverdale Reporter", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAuto\nJobs\nObituaries\nGood News\n12.6 °C\nHome News\nLawyer with MMIW inquiry resigns, citing government interference\nA lawyer for the National Inquiry has announced he’s resigned\nThe Canadian Press\nJul 2, 2018 5:22 PM\n\t\n\t\n\t\n\t\n\t\n\t\nThe Canadian Press The Canadian Press\n\nA lawyer for the National Inquiry into Missing and Murdered Indigenous Women and Girls has announced he’s resigned, and in a statement cites government interference among his reasons.\n\nBreen Ouellette, who worked as a commission counsel for the inquiry at its Vancouver offices, posted online that he resigned on June 21.\n\nBreen, who is Metis, says in the statement that he believes the federal government has “undermined the independence and impartiality of the national inquiry” and that he cannot remain part of a process that he says “is speeding towards failure.”\n\nRELATED: Final day of public hearings for missing and murdered Indigenous women and girls\n\nHe also asks the inquiry’s commissioners to allow him to fully disclose the reasons behind his resignation, which he says he cannot do as a lawyer.\n\nThe inquiry has been plagued by chronic delays, staff turnover and complaints from families about disorganization, poor communication and a lack of transparency.\n\nNadine Gros-Louis, a spokeswoman for the inquiry, confirmed in an email that Ouellette has stepped down, noting that staffing changes do occur.\n\n“As you can appreciate, and as with all organizations, staffing does not remain constant, especially in an environment dealing with difficult subject matter where many staff work extended hours,” Gros-Louis wrote.\n\nBreen’s statement doesn’t mention long hours. As an example of government interference, though, he said the inquiry needs to be able to properly investigate allegations of “illegal and improper” foster-care apprehensions.\n\n“The national inquiry could use its powers to force government departments to comply with investigations into these allegations. The perpetrators could be identified so that governments could stop the misuse of billions of Canadian tax dollars by a few heartless bureaucrats seeking to advance their careers,” Breen wrote.\n\n“However, interference by the federal government is undermining this important function of the national inquiry. Canadians deserve to know which provinces and territories perpetuate this unnecessary and harmful spending of billions of tax dollars on foster-care apprehensions.”\n\nLast month, the government turned down a request by inquiry officials for a two-year extension in order to give commissioners until Dec. 31, 2020, to make recommendations and produce findings.\n\nInstead, the government agreed to only extend the inquiry’s deadline by another six months. That gives commissioners until next April 30 to finish its hearings and submit a final report, instead of the initial deadline of Nov. 1 of this year.\n\nRELATED: Search for missing women to continue\n\nReached late Monday, Breen said the refusal to grant the two-year-extension, along with the funding for it, shows the government isn’t serious about the commissioners meeting the inquiry’s mandate.\n\n“They’re trying to kill the national inquiry in a death by a thousand cuts, and they’re trying to pin the failure on the commissioners,” Breen said in a phone interview from Vancouver.\n\nCarolyn Bennett, minister of Crown-Indigenous relations, explained the decision to extend the mandate by just six months was made in part because provinces and territories were not unanimously supportive of extending the terms of reference for the inquiry into next year.\n\nGros-Louis, meanwhile, said the inquiry remains independent and impartial.\n\n“With diverse backgrounds, experience and expertise, we are united by a deep commitment to honour the missing and murdered, uncover the truth and build a better future for Indigenous women and girls,” she wrote.\n\nThe Canadian Press\n\nLike us on Facebook and follow us on Twitter.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending in News\n\t\tB.C. United promises free shingles vaccine after seniors advocate report\n\t\tPilot makes emergency landing at Manning Park\n\t\tB.C. company receives hundreds of millions to expand hydrogen fuel stations\n\t\tBody of missing rower found in Abbotsford\n\t\tWhite Rock faces multi-unit housing quandary\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\nMrs. Meow Meow recovering after being shot on Vancouver Island \nApollo astronaut who showed Earth to humanity killed in plane crash near B.C.\nVancouver Bandits win third straight\nHarrison Hot Springs Mayor Ed Wood resigns\nRCMP warn 10 'money mules' to stop aiding investment fraudsters in B.C.\nMore from Today in B.C. >\n \nCloverdale Reporter\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nToday in BC\nCanadian News\nWorld News\nEntertainment\nSports\nBusiness\nTrending Now\nOpinion\nSubmit News Tips\nLangley Advance Times\nNeighbours\nSurrey Now Leader\nMaple Ridge-Pitt Meadows News\nPeace Arch News\nAldergrove Star\nLangley Advance Times\nNorth Delta Reporter\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nBook a Print Ad\nAuto\nToday's Drive\nAuto Showcase\nJobs\nLocalWork\nJoin Our Team\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\nLocal Good News\nSocial Media\nCloverdale Live\nToday in BC\nYoutube\nI love British Columbia\nI love Alberta\nI love Nunavut\nI love Yukon\nI love Northwest Territories\n© 2024 Cloverdale Reporter and Black Press Media Publications Contact"}
{"url": "https://www.asianage.com/world/americas/040619/womens-rights-slipping-gender-equality-under-attack-canadian-pm-justin-trudeau.html", "title": "‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau", "body": "  Menu e-Paper | Age on Sunday  \n Auto Refresh  Search   Horoscope\n\nTuesday, Jun 11, 2024 | Last Update : 12:12 AM IST\n\nHome\n \nIndia\nWorld\nMetros\nBusiness\nOpinion\nSports\nTechnology\nEntertainment\nPhotos\nLife\nNewsmakers\n \nMore  \nBooks\nScience\nHoroscope\nAge on Sunday\nDelhi Age\nMumbai Age\nDecaf\nDiscourse\n360 Degree\nEditors' Picks\nJust In\nPlay Games\n   World   Americas  04 Jun 2019  ‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau\nWorld, Americas\n‘Women’s rights slipping, gender equality under attack’: Canadian PM Justin Trudeau\nREUTERS\nPublished : Jun 4, 2019, 10:58 am IST\nUpdated : Jun 4, 2019, 10:58 am IST\n\nConference opened by procession of indigenous men and women, in traditional clothing, wearing red in memory of murdered and missing girls.\n\n Trudeau hailed as a 'significant step toward justice' a Canadian government finding on Monday that the death of more than 1,000 aboriginal girls and women in recent decades was a national genocide. (Photo: File)\n\nVancouver: Gender equality is “under attack” amid hatred, misogyny and politicians campaigning to undo women’s rights, Canadian Prime Minister Justin Trudeau said on Monday at the launch of a global conference on women’s issues.\n\nProgress in women’s rights is backsliding in the face of taunts and hostility that travel on social media and seep into public discourse, said Trudeau, a self-avowed feminist who appointed the first gender-balanced cabinet.\n\nSome 8,000 delegates from more than 165 countries are attending Women Deliver in Vancouver, the world’s largest gender equality conference, which will address topics from women’s political empowerment to education and employment.\n\nThe conference was opened by a procession of indigenous men and women, clad in traditional clothing, some wearing red in memory of murdered and missing girls and women.\n\nTrudeau hailed as a “significant step toward justice” a Canadian government finding on Monday that the death of more than 1,000 aboriginal girls and women in recent decades was a national genocide.\n\nThe report, from an inquiry launched by Trudeau’s government in 2016, blamed the violence on long-standing discrimination against indigenous people and Canada’s failure to protect them.\n\n“For too long, indigenous women and girls have experienced violence at a rate that is staggering when compared to non-indigenous women,” Trudeau said.\n\nThe report made scores of recommendations, and Trudeau vowed to develop and implement a national action plan to prevent future violence.\n\nHe told delegates that women around the world were battling misogyny, racism and hatred.\n\n “Gender equality is under attack,” he said. “Individuals and interest groups are trying to roll back women’s rights. “Politicians are giving into the pressure, shamefully campaigning to undo women’s hard-won victories. That’s a daunting reality.”\n\nThe inquiry into the missing and murdered women was a painful process that heard testimony from thousands of witnesses, including hundreds of family members of victims.\n\nCiting colonial violence, racism, sexism and more, the report said many indigenous people have grown up normalized to violence, while Canadian society showed “an appalling apathy” to addressing the issue.\n\n “The National Inquiry into Missing and Murdered Indigenous Women and Girls finds that this amounts to genocide,” it said.\n\nTags: canada pm, justin trudeau, women empowerment, racism, sexism\nLocation: Canada, Ontario\nLATEST FROM WORLD\nSouth Africa's ANC calls demands for President Ramaphosa to step down for coalition talks a 'no-go'\n\nChina's Chang'e-6 successfully lands on rarely explored Moon's far side to collect samples\n\nIndia discusses Maldives debt\n\nIndia asks Iran to free Indians on seized ship\n\nADVERTISEMENT\nMOST POPULAR\n1\n\nClean chit for Aryan Khan in cruise drugs case\n\n2\n\n'Chak de phatte India', says Harnaaz Sandhu after becoming Miss Universe 2021\n\n3\n\nMutation linked to remdesivir resistance found in Covid patient\n\n4\n\nClimate finance isn’t charity, says Union minister Bhupender Yadav at COP26 summit\n\n5\n\nIndian origin astronaut-led NASA's SpaceX Crew-3 team headed to ISS\n\nMORE\nADVERTISEMENT\nEDITORS' PICKS\nParsa Venkateshwar Rao Jr | Ambiguities remain amid India’s pledges at COP26\nJai Bhim: Protecting rights and providing hope in India’s democracy\n‘Afghanistan has changed, women will fight back’\nThe world was silent: Afghan filmmaker Sahraa Karimi on Taliban takeover\nI selected Irrfan Khan because of his eyes: Mostofa Sarwar Farooki\nMORE\nALSO FROM\nENTERTAINMENT\nActor RanaDaggubati and entrepreneur Miheeka Bajaj tied the knot on Saturday evening\nPre-Oscar party sets the mood for the big day\nAmbani bash: SRK, Shahid, Aishwarya and others snapped at Antilia\nPics: Take inspiration for your next vacay from Kiara Advani\nCity Of Stars: Hrithik, Malaika, Kartik & others spotted in Mumbai\nWAR screening: Ananya, Varun, Disha and others watch Hrithik-Tiger's film\nHome Deccan Chronicle Andhrabhoomi Financial Chronicle About Us Contact Us Feedback E-Paper Privacy Policy\n\nCopyright © 2016 - 2024 The Asian Age.\nDesigned, Developed & Maintained By Daksham"}
{"url": "https://www.nanaimobulletin.com/news/murdered-and-missing-honoured-at-stolen-sisters-memorial-march-in-b-c/", "title": "Murdered and missing honoured at Stolen Sisters Memorial March in B.C. - Nanaimo News Bulletin", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nAutos\nJobs\nObituaries\nGood News\n15.1 °C\nHome News\nMurdered and missing honoured at Stolen Sisters Memorial March in B.C.\n‘We come together to make change within the systems in our society’\nKeri Coles\nFeb 17, 2019 12:30 PM\n\t\n\t\n\t\n\t\n\t\n\t\nThe march is an annual event, first started in Vancouver’s Downtown Eastside, to remember, honour and grieve for the missing or murdered Indigenous women and their families. (Keri Coles/News staff)\n\nThe Stolen Sisters Memorial March walked through the streets of Victoria Saturday to honour missing and murdered Indigenous women, girls and two-spirit people. It was not a protest, said organizers, it was a memorial.\n\nThe march is an annual event, first started in Vancouver’s Downtown Eastside, to remember, honour and grieve for the missing or murdered Indigenous women and their families.\n\n“We are in our twelfth year now and the numbers of women going missing and murdered is not decreasing. In society Indigenous women, girls and two-spirit people are seen as less than. This is one of the factors as to why this is happening to our women and why we come here together today and stand in solidarity,” said Nancy Kinyewakan. “We stand here and form circles in unity to recognize and bring awareness to what has happened and what is happening to our First Nations women and children.”\n\nRELATED: Sharing truth with art at inquiry into missing, murdered Indigenous women\n\nIndigenous women and girls make up 4.3 percent of the total female population in Canada but make up 11.3 percent of the murdered and missing cases.\n\nA report released by the RCMP in 2014 said that between 1980 and 2012, a total of 1,181 Indigenous women and girls were murdered or went missing. Of those, 1,017 Indigenous women and girls were homicide victims and 164 are missing.\n\n“Violence happens in spaces of lawlessness. How is it that Indigenous women and girls are in spaces of lawlessness in this land called Canada,” said Dr. Val Napoleon, professor of aboriginal justice and governance at UVic. “The essential work of today, all of us, is to re-build Indigenous law so that we can create safe and inclusive communities.”\n\nRELATED: Indigenous children still being treated unequally by provinces: advocate\n\nThe National Inquiry into Missing and Murdered Indigenous Women and Girls was launched by the federal government in 2016 to investigate the disproportionately high number of missing and murdered Indigenous women and girls in Canada, and to give family members a chance to have their stories heard.\n\nThe final report with actionable solutions and recommendations for change is expected to be submitted to the federal government by April 30.\n\nRELATED: Number of murdered or missing aboriginal women ‘horrifying’\n\n“We come together to make change within the systems in our society – the justice system, the education system, the child welfare system, the foster care system – because almost all of us are survivors,” said Kinyewakan. “Over the years, I’ve had my voice oppressed and it took me a long time to find my voice but I stand here today to use my voice to support this important issue.”\n\n \nkeri.coles@blackpress.ca\nFollow us on Instagram Like us on Facebook and follow us on Twitter.\nThe march is an annual event, first started in Vancouver’s Downtown Eastside, to remember, honour and grieve for the missing or murdered Indigenous women and their families. (Keri Coles/News staff)\nThe march is an annual event, first started in Vancouver’s Downtown Eastside, to remember, honour and grieve for the missing or murdered Indigenous women and their families. (Keri Coles/News staff)\nThe march is an annual event, first started in Vancouver’s Downtown Eastside, to remember, honour and grieve for the missing or murdered Indigenous women and their families. (Keri Coles/News staff)\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tMan with brain injury can advance complaint against BC Ferries\n\t\tLETTER TO THE EDITOR: Nanaimo’s Terminal Avenue lanes too narrow\n\t\tNanaimo night market will provide sensory balance space amid bustle\n\t\tPopulating Rutherford an intricate exercise for Nanaimo school district\n\t\tPolice seek help finding missing newcomer to Nanaimo\nFacebook Comments (0) \nMan stabbed multiple times in the chest in downtown Nanaimo\nBlack Press Media\nBrush fire thwarted, home destroyed in North Saanich house fire\nBlack Press Media\nIf you have a mouse, this game will keep you awake all night long.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nThe most realistic game 2024. If you own a mouse, you have to play this.\nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians Born Before Before 1972 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nOff-leash dog injured after being struck with machete on Vancouver Island trail\nBlack Press Media\nFamily concerned for well-being of missing Nanaimo woman\nBlack Press Media\nThe most realistic game 2024. If you own a mouse, play it for 1 minute.\nPlay this game for free. No Installation.\nBaseAttackForce\n|\nSponsored\nPlay Now\nCurrently the best free game. Play for free. No Installation.\nPlay this game for 1 minute and see why everyone is addicted.\nDesertOrder\n|\nSponsored\nCanadians Under Age 80 With No Life Insurance Are Taking Advantage Of This\nCovered For Life\n|\nSponsored\nLearn More\nIconic Vancouver Island pub turns 100 years old in 2024\nBlack Press Media\nMan who broke into B.C. home, sexually assaulted woman sentenced to 5 years\nBlack Press Media\nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN B.C.\n\nThere are no items to show.\n\n  \nNanaimo News Bulletin\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nBC\nNational\nWorld News\nOpinion\nSubmit News Tips\nNeighbours\nParksville Qualicum Beach News\nCowichan Valley Citizen\nLake Cowichan Gazette\nChemainus Valley Courier\nLadysmith Chronicle\nTofino-Ucluelet Westerly News\nVancouver Island Free Daily\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nToday's Home\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nAutos\nToday's Drive\nAuto Showcase\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\nGood News\n© 2024 Nanaimo News Bulletin and Black Press Media Publications Contact"}
{"url": "http://www.reddeeradvocate.com/news/families-walk-highway-of-tears-before-mmiw-hearing/", "title": "Families walk Highway of Tears before MMIW hearing - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nFamilies walk Highway of Tears before MMIW hearing\nSMITHERS, B.C. — Gladys Radek raised a fist in the air and wept as she reached the end of her 350-kilometre journey along British Columbia’s Highway of Tears.\nThe Canadian Press\nSep 25, 2017 8:10 PM\n\t\n\t\n\t\n\t\n\t\n\t\nPhoto by THE CANADIAN PRESS Driving a car covered with photos of missing women, Gladys Radek, left, is overcome with emotion as she leads a group of family members and advocates of missing and murdered Indigenous women and girls upon arrival in Smithers, B.C., after walking along the so-called Highway of Tears, on Monday. Radek organized the walk along the notorious stretch of Highway 16 where dozens have disappeared or been killed in honour of the 12th anniversary of the disappearance of her niece, Tamara Lynn Chipman. The walk began in Prince Rupert and ended in Smithers where the National Inquiry into Missing and Murdered Indigenous Women and Girls is holding hearings beginning Tuesday.\n\nSMITHERS, B.C. — Gladys Radek raised a fist in the air and wept as she reached the end of her 350-kilometre journey along British Columbia’s Highway of Tears.\n\nThe Indigenous grandmother finished her walk along the notorious stretch of Highway 16 for the seventh and final time on Monday. It is the same highway where her beloved niece Tamara Lynn Chipman disappeared.\n\nOutside a community centre in Smithers, B.C., her voice shook as she spoke to those who had walked alongside her, including commissioners from the national inquiry into missing and murdered women.\n\n“I want to thank you all for standing so proud and loud, to show our commissioners that we have love for our missing and murdered women,” she said through tears.\n\n“I’m very proud of this moment right now because when Tamara went missing, nobody cared. When Tamara went missing, there were many others who were already missing, many others who had been murdered.”\n\nDozens of women have disappeared or been killed along the highway between Prince Rupert and Prince George in central B.C.\n\nRadek and other family members and advocates left Prince Rupert on Thursday and arrived Monday in Smithers, where the National Inquiry into Missing and Murdered Indigenous Women and Girls will hold hearings starting Tuesday.\n\nThe walkers were accompanied by vehicles and have covered sections of the route in a relay fashion, allowing them to complete the walk of hundreds of kilometres over the span of a few days.\n\nDuring the final stretch through the town of Smithers, Radek, who is missing a leg, drove a car covered in photographs of women who have disappeared or been killed. She wept behind the wheel as passersby waved and honked their horns.\n\nInquiry commissioner Michele Audette joined the group three days ago, while Chief Commissioner Marion Buller joined on Monday. Commissioner Qajaq Robinson was supposed to attend the hearings but had to bow out due to a family emergency.\n\nAudette said she walked to honour the resilience and strength of the families who will be speaking for the first time to the inquiry. The hearings will be powerful, she said.\n\n“I feel it since I arrived, there’s a lot of emotion, lots of anxiety also or stress, because it’s the first time for them,” she said. “Just being there beside them and listening, maybe it’s helped.”\n\nThe inquiry has been plagued by controversy, including the resignation of commissioner Marilyn Poitras this summer and complaints from families about poor communications and delays.\n\nBuller told a Senate committee last week that the inquiry’s work has been hampered by federal bureaucracy.\n\nRhonda Lee McIsaac, who lives in Haida Gwaii and has Ojibway heritage, participated in the walk for the first time and said it was a moving experience.\n\n“I’m walking for everybody who cannot walk,” said McIsaac. “I have lost a loved one. I grew up in foster care and I was adopted out. This is part of my story.”\n\nMore than 40 people have signed up to speak at the Smithers hearings, which run through Thursday. They are the second hearings held by the inquiry after it visited Whitehorse in May.\n\nThe inquiry is set to visit nine communities this fall, including Edmonton, Winnipeg and Thunder Bay, Ont.\n\nHave a story/tip?\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "http://www.tjcnewspaper.com/canada-launches-investigating-into-aboriginal-women-murder-cases-154607/", "title": "Tjcnewspaper.com", "body": "Tjcnewspaper.com\nThis Page Is Under Construction - Coming Soon!\n\nWhy am I seeing this 'Under Construction' page?\n\nRelated Searches:\nFree Credit Report\nAnti Wrinkle Creams\nWork from Home\nAll Inclusive Vacation Packages\nAccident Lawyers\nTrademark Free Notice Review our Privacy Policy Service Agreement Legal Notice\nPrivacy Policy|"}
{"url": "https://www.reddeeradvocate.com/news/red-dresses-a-reminder-of-missing-and-murdered-indigenous-women/", "title": "Red dresses a reminder of missing and murdered Indigenous women - Red Deer Advocate", "body": "Skip to content\nPlayNEWSLETTER SIGNUP\n  \nNews\nMore\nContests\nShop\nE-EditionsClassifieds\nJobs\nObituaries\n18.7 °C\nHome News\nRed dresses a reminder of missing and murdered Indigenous women\nDozens of red dresses hung around Red Deer and Red Deer College\n\tPaul Cowley\n\nNov 25, 2019 2:00 PM\nNov 25, 2019 5:26 PM\n\t\n\t\n\t\n\t\n\t\n\t\n\nDozens of red dresses were hung around Red Deer on Monday, poignant reminders of the huge number of missing and murdered Indigenous women.\n\n“The dresses that are hanging are empty. We’re trying to show the significance and the impact of the numbers of murdered and missing Indigenous women,” said Sheila Bannerman, of the Red Feather Women.\n\nHow many have gone missing or been murdered is not even known, said Bannerman. The last up-to-date numbers were gathered in 2015 as preparations were underway for that year’s tour of the Walking With Our Sisters installation, which was at the Red Deer District Museum and Art Gallery that June.\n\n“At that time, we were told there were 1,200 murdered women (since 2012) whose cases were considered unfounded or were not followed up on,” said Bannerman.\n\n“That’s a long time ago, and we don’t really have any updated stats because stats aren’t kept on this.\n\n“That’s the issue. These women are human beings, they are people, they have human rights, they are family members and it doesn’t matter what the circumstances are of their lives,” said Bannerman.\n\n“They are people and deserve the respect of an investigation into where they are if they’re missing or what happened if they were murdered.\n\n“So that’s why we’re here.”\n\nALSO READ: Red dresses will be hung throughout Red Deer on Monday\n\nWhat statistics are available tell a tragic story. The homicide rate for Indigenous women in Canada is six times higher than the rate for non-Indigenous women.\n\nIn 2015, Indigenous women accounted for nearly one-quarter of female homicide victims, even though they represent only 2.5 per cent of the population.\n\nIndigenous women are five times more likely to die from violence as non-Indigenous women.\n\nA forum was held at Red Deer College on Monday, which was the United Nations International Day for the Elimination of Violence Against Women.\n\nRed dresses were first used to draw attention to missing and murdered Indigenous women in 2009, when Winnipeg-based Metis artist Jaime Black created the REDdress Project, an art installation that toured North America.\n\nAbout 50 red dresses were donated and hung from trees around the city on Monday, including at City Hall, the courthouse, in front of the Red Deer Native Friendship Society’s office, and near the Dumpster where murder victim Talia Meguinis’s body was found in 2012.\n\nMeguinis was killed on Feb. 20, 2012, and her body was stuffed into a Dumpster in the alley behind her Riverside Meadows apartment.\n\nOne of the dresses was also hung in Gasoline Alley as a reminder that highways often prove dangerous places for women, who unwittingly catch rides with predators.\n\nTalitha Klym, who is with the college’s Indigenous students services, said they wanted to focus on Indigenous women for one day of the students’ association’s 16 Days of Activism against Gender-based Violence and reached out to the Red Deer Feather Women to participate.\n\nThey put together 500 postcards, each with a small felt red dress attached.\n\nOne side talks about the initiative and the back provides information on how people can get involved in spreading the message through their own actions and attitudes.\n\nKlym found that many students were unaware of the significance of the red dresses, but have shown their interest in learning about it.\n\nThere’s been a lot of support,” she said.\n\n\npcowley@reddeeradvocate.com\nLike us on Facebook and follow us on Twitter\n\nHave a story/tip?\n\t\n\nAbout the Author: Paul Cowley\n\nPaul grew up in Brampton, Ont. and began his journalism career in 1990 at the Alaska Highway News in Fort. St. John, B.C.\nRead more\n\t\n Share by Email\n\t\n Share on Facebook\n\t\n Share on X\n\t\n Share on LinkedIn\n\t\n Print\n\t\nTrending\n\t\tRed Deer Emergency Services responds to fire at high school\n\t\tNew appointments for Westerner Park board of directors\n\t\tRed Deer gains new family doctors\n\t\tLofty Red Deer protester raises alarm about AI leading to dystopian future\n\t\tCyclists participate in Fancy Women Bike Ride in Red Deer\nFacebook Comments (0) \nYOUR VOTE MATTERS\nParticipate in our next community poll.\nWhat Canadian issue concerns you the most?\n Healthcare\n Climate change\n Economy\n Education\n\nVote Results > Archives >\n\nTODAY IN ALBERTA\nHackett: The highs and lows of fandom\nHay's Daze: Leave the dronage to the experts\nCalgarians urged to do better in curbing water use during unprecedented main break\nElks and Riders, once proud CFL teams fallen on hard times, seek redemption in 2024\nRode: High School Rugby Provincials off and running in Red Deer\nMore from Today In Alberta >\n  \nRed Deer Advocate\nAbout Us\nContact Us\nAdvertising\nSupport Centre\nTerms of Service\nPrivacy Policy\nJoin our Team\nNews\nLocal News\nNewsletters\nSubscribe\nAlberta\nNational\nWorld News\nOpinion\nSubmit News Tips\nMore\nOur Community\nPublic Notices\nVideo\nPhoto Galleries\nTravel\nWest Coast Traveller\nCannabis\nPodcasts\nFood\nLife\nContact Us\nContests\nPuzzles\nContests\nShop\nImpress Stories\nMarketplace\nReal Estate\nImpress TV\nAdd Your Business\nE-Editions\nClassifieds\nAll Classifieds\nPost a Print Ad\nItems for Sale\nGarage Sales\nJobs\nLocal Work\nObituaries\nCelebrations of Life\nFuneral Care Services\nIn Memory\nPlace an Obituary\n© 2024 Red Deer Advocate and Black Press Media Publications Contact"}
{"url": "http://www.tjcnewspaper.com/canada-launches-investigating-into-aboriginal-women-murder-cases-154607/", "title": "Tjcnewspaper.com", "body": "Tjcnewspaper.com\nThis Page Is Under Construction - Coming Soon!\n\nWhy am I seeing this 'Under Construction' page?\n\nRelated Searches:\nsong lyrics\nHealthy Weight Loss\nfashion trends\nmusic videos\nDental Plans\nTrademark Free Notice Review our Privacy Policy Service Agreement Legal Notice\nPrivacy Policy|"}
